{"https://www.wired.com/story/prime-day-tracker-and-ring-2025-1/": {"title": "19 Best Prime Day Fitness Tracker Deals and Smart Ring Sales (2025)", "summary": "This year, you have four whole days to shop the Amazon Prime Day deals. We've highlighted the sales on some of our favorite fitness trackers and smart rings. The Apple Watch Series 10 is the best fitness tracker for iPhone users. Garmin Forerunner 265 is the older version of the Forerunner series of running watches.", "url": "https://www.wired.com/story/prime-day-tracker-and-ring-2025-1/", "content": "In the northern hemisphere, it's hard not to spend the winter in a state of slumbering sloth, just waiting for sunshine and good times to start again. Conveniently, Prime Day fitness tracker deals (all four days of them) drop right in the middle of summer, which makes this a great time to pick up the smartwatch or smart ring that you just didn't have the cash for at Christmas.\n\nThis year, you have four whole days to shop the Amazon deals, but if you don't want to take that much time, I've highlighted the sales on some of our favorite fitness trackers and smart rings. Not a subscriber yet? Perhaps our list of the best Amazon Prime Perks can convince you to sign up. Deal hunters should also check out our Best Amazon Prime Day Deals roundup and Prime Day liveblog.\n\nUpdated July 10, 2025: We've added new deals on the Fitbit Inspire 3, Samsung Galaxy Watch7, and the Polar H10.\n\nWIRED Featured Deals\n\nFitness Tracker Deals\n\nThe Best Smart Ring\n\nAs you might expect with my job, I am frequently asked what fitness tracker to get, and this year, more often than not, I have told people to just buy an Oura Ring 4 (9/10, WIRED Recommends) . You don't have to wear it on your wrist, the battery life is longer than most trackers, and Oura issues interesting, meaningful software updates regularly. This is the first time it's gone on sale, and you should get it.\n\nA Continuous Glucose Monitor\n\nOf all the fitness trackers that I've tested this year, none has inspired as many questions as a continuous glucose monitor (CGM). You click the sensor on your arm and a tiny sensor reads the glucose in your interstitial fluid. When you eat something that spikes your blood sugar, like, oh, a cookie, you get an alert on your phone saying, “No! Don't do that!” If you're pre-diabetic or dealing with a health condition, you're probably very interested in getting one. Abbott is currently offering 9-15 percent off the sensors.\n\nThe Best Fitness Tracker\n\nFitbit has faced pretty stiff competition over the years (most notably from the Apple Watch), but its flagship Charge line is still the best overall fitness tracker for the money. Even tracking multiple activities a day, the battery lasts over a week. The updated app looks great, and multiple Google integrations make the Fitbit Charge 6 (7/10, WIRED Recommends) easier to use than ever.\n\nThe Best If You Have an iPhone\n\nThe Apple Watch Series 10 is the best fitness tracker for iPhone users. It still doesn't have blood oxygen sensing due to a patent dispute, but it's otherwise a solid fitness tracker. The standout feature is sleep apnea notifications. The watch uses an accelerometer and machine learning to check if you have breathing disturbances at night. The Series 10 is also thinner, lighter, easier to wear, and charges faster than previous models.\n\nThe Best Analog Fitness Tracker\n\nBefore I even started this job, I had purchased the original Withings Steel HR, which was the first of Withings' gorgeous fitness trackers that don't even look like regular fitness trackers. The Scanwatch 2 follows in that tradition with a comprehensive suite of health features and Withings' new cardiac-focused health features, like Cardio Check-Up, which lets you send your cardiac data instantly to Withings' board of certified cardiologists.\n\nThe Best Kids’ Watch\n\nI have personally convinced many parents in my life to buy the Fitbit Ace LTE (7/10, WIRED Recommends) for their kids. It's a Fitbit, so it works even if one parent is Android and the other is Apple (if so, why?), and the $10/month subscription includes data, so you don't need to fuss with adding service to your cell plan. Fitbit Arcade incentivizes my kids to keep their watches on and charged, and I like Google's included kids' safety features.\n\nBest Ring for Samsung Fans\n\nThe Samsung Galaxy Ring (7/10, WIRED Recommends) is slim and lightweight, with decent sleep tracking, the ability to auto-detect workouts, and accurate cycle and heart rate tracking. You need a Samsung watch or phone to take full advantage, but Samsung's devices are slick when used together.\n\nA Great Garmin\n\nGarmin is known for its Forerunner series of running watches. The Forerunner 255 (8/10, WIRED Recommends) is the older version of the Forerunner 265 that we recommend in our roundup, but Garmins age well, and the older version does have some features to recommend it over the newer one, like better battery life.\n\nThe Cheapest Tracker You Should Buy\n\nIt may be cheap, but the Amazfit Active 2 (6/10, WIRED Reviewed) is no slouch on the sensor front with a photo plethysmography (PPG) sensor, accelerometer, gyroscope, barometric altimeter, ambient light, and temperature sensor to track your sleep, heart rate, and blood oxygen saturation. It also boasts tons of workout modes, long battery life, and 5 ATM water resistance.\n\nThe Most Affordable Apple Watch\n\nWhile it's not the most exciting Apple watch, the SE series is the cheapest way to try out an Apple fitness tracker. The SE uses watchOS 11, which can connect to the Vitals app, which makes it easy to check your heart rate and respiration in a dashboard without hunting through the Health or Fitness apps. It has the last S8 chip, which is what the Series 8 has, and features like Crash Detection to call your emergency contact and emergency responders if you've been in a car accident. The SE series doesn't have the latest health features, like the ability to check your skin temperature, and the display is noticeably smaller than Apple's other options, but for the price this is hard to beat, especially on sale.\n\nSamsung's Flagship Smartwatch\n\nSamsung’s flagship smartwatch is a no-brainer for folks in Samsung’s ecosystem. The Galaxy Watch Ultra boasts dual-band GPS, excellent health and activity monitoring features, and two-day battery life. It's tough, too, with a titanium case and 10 ATM/IP68 ratings. Samsung announced a newer version of the Galaxy Watch Ultra, but it's actually the same watch with 64 GB of storage and a new color, so it's smart to snag this one for half its MSRP.\n\nA No-Subscription Smart Ring\n\nWhile the Oura Ring 4 is undoubtedly the champion of smart rings, you'll be paying $8 a month if you want the full experience. The Ultrahuman Ring Air (7/10, WIRED Recommends), though, comes with an included “lifetime subscription,” meaning you'll have full access to your data and analytics when you pick one of these up. It's the first time the price has dropped this low too, so if ever there was a time, it's now.\n\nThe Cheapest Fitbit\n\nHere's proof that reliable tracking doesn't have to be expensive. The standout feature of the Fitbit Inspire 3 is its incredibly long battery life. We're talking up to 10 days! The teeny, tiny AMOLED screen is super bright, making it easy to see your stats despite its tiny size.\n\nA Stylish Garmin\n\nMost Garmin watches aren't likely to win any beauty prizes—they're chunky, with an emphasis on the technical over aesthetic. The Lily 2 is the exception. It's Garmin that looks more like, well, a nice watch. You can even get it with a leather band. It's one of the smallest Garmins and battery life is on the short side—three to four days. But it has a Pulse Ox sensor, a beautiful Corning Gorilla Glass lens, a metal bezel, and standard Garmin features like Body Battery and fall detection.\n\nThe Best Wear OS Smartwatch\n\nSlick looks, Fitbit integration, and bags of features, the Google Pixel Watch 3 (8/10, WIRED Recommends) is the best Wear OS watch for folks with an Android phone. It's no slouch as a health and fitness tracker, with electrocardiogram readings, sleep tracking, heart rate readings, blood-oxygen measurements, and stress tracking.\n\nThe Best for Samsung Phones\n\nSamsung phone owners should consider this wearable as it offers excellent health and fitness tracking and some exclusive features that only work when paired with a Samsung phone, such as FDA-cleared sleep apnea detection. It's a great discount but that's partly because the new one has just arrived.\n\nFor Serious Health Tracking\n\nIt might be a little long in the tooth, but the Fitbit Sense 2 is probably still the best for serious health tracking and the closest to a competitor for the Apple Watch. It has ECG functionality, and can track your stress. There's also built-in GPS, an SpO2 sensor, and a skin temperature sensor, too.\n\nThe Best Heart Rate Monitor\n\nWhile fitness trackers generally have built-in heart rate monitors, a separate strap on your bicep or around your chest is far more accurate when things get sweaty and intense during a tough workout. Polar's strap has a comfortable buckle connector and silicone dots to keep it in place.\n\nA Smart Scale\n\nIf you still have a humble bathroom scale, it may be time to upgrade to one that has fancy new tricks, like tracking your vascular age and visceral fat. The Withings Body Comp connects directly to the Withings app (so you don't need to have your phone nearby) and shows a staggering amount of data, everything from your weight to muscle mass, heart rate, pulse wave velocity, and weird things like the air quality and your body water percentage."}, "https://www.wired.com/story/ftc-click-to-cancel-rule-killed-consumer-advocates-could-revive-it/": {"title": "The ‘Click-to-Cancel’ Rule Was Killed, but Consumer Advocates Could Revive It", "summary": "The Federal Trade Commission's \"Click to Cancel\" rule was unanimously struck down by the US Court of Appeals for the Eighth Circuit on Tuesday. States-level rules already have started to step in with more consumer protections than what’s currently offered at the federal level.", "url": "https://www.wired.com/story/ftc-click-to-cancel-rule-killed-consumer-advocates-could-revive-it/", "content": "United States residents almost escaped subscription cancellation hell, but the Federal Trade Commission's “Click to Cancel” rule was unanimously struck down by the US Court of Appeals for the Eighth Circuit on Tuesday—just days before it was set to go into effect.\n\nWhat would have happened if this updated FTC rule had gone into effect on July 14 as planned? “The stated goal was that they wanted to make it as easy for you to cancel a subscription as it is to sign up,” says John Breyault, vice president of public policy, telecommunications, and fraud at the National Consumers League. How reasonable! It’s the type of rule that sounds like it should already exist as part of baseline consumer protections.\n\nIf I can sign up for a gym membership or a news website subscription or a food delivery service with just a few seamless taps on my smartphone, then why am I so often thrown into a labyrinth of puzzles—with people to call or in-person locations to visit—whenever I want to opt out from one of the recurring subscription charges. Even services that do allow users to cancel online may include more steps than the sign-up process or introduce confusingly labeled buttons that slow the process.\n\nThe Eighth Circuit’s decision to nix the Click to Cancel rule was based on procedural complaints, not on the substance of what the consumer protections entailed. “While we certainly do not endorse the use of unfair and deceptive practices in negative option marketing, the procedural deficiencies of the Commission’s rulemaking process are fatal here,” reads the appeal court’s published opinion.\n\nJohn Davisson, director of litigation at the Electronic Privacy Information Center, sees this decision as “very poorly reasoned” and hopes the current FTC tries to revisit the rule to protect consumers better.\n\n“It would be such a slam dunk for the commission,” says Davisson. “I think everyone understands why the subscription traps are bad. No one without a financial incentive or career advancement motive to sustain these subscription traps thinks they should exist.”\n\nA broad base of support from individual consumers for streamlining the opt out process could help eventually revive the Click to Cancel rule or similar consumer protections.\n\n“I'm somewhat hopeful, given the public support for this important option of canceling, that the commission will go back and get this thing re-going again,” says Bill Baer, a visiting fellow at the Brookings Institution and former member of the FTC. “It'll take some time, but it's an important benefit to consumers.” If the current FTC decides to try again, which it may not, the process would likely take months or even years to complete.\n\n“It’s unfortunate the FTC’s rule won’t be enforced,” says Mario Trujillo, a staff attorney at the Electronic Frontier Foundation. “But, the opinion doesn’t stop states from acting, Congress from acting, or even the FTC from bringing individual cases.” States-level rules already have started to step in with more consumer protections than what’s currently offered at the federal level and won't be impacted by the court's recent decision. For example, California's own version of Click to Cancel went into effect last year and remains intact.\n\nLike many Americans, I’m seeing more and more of my paycheck go to subscription services each month. While some of the services are essential, others are less so. But the hassle of going through the opt-out process to cancel these unwanted services is often so tedious that I’ve put it off in the past—until I see the $20 recurring charge again the next month and get frustrated with myself.\n\nWhile deep-pocketed business interests will likely try to block any future attempts to mandate a simplified cancellation process, a deep-set hunger for change from consumers, fueled in part by righteous indignation, may eventually prevail. “I think, on balance, it is something worth doing that can be done with modest cost to the business community and a hell of a lot of benefit to the consumer community,” says Baer."}, "https://www.wired.com/story/best-amazon-prime-deals-july-2025-1/": {"title": "Not Just Any Prime Day Deals, 279 Obsessively Tested Picks—Even $1,200 Off an OLED TV", "summary": "The WIRED Reviews team only recommends deals on products we’ve actually tested and approved. If you’re looking for up-to-the-minute coverage of deals, check out our Amazon Prime Day liveblog. We're working in shifts, covering 20 hours a day through the end, and are dangerously caffeinated.", "url": "https://www.wired.com/story/best-amazon-prime-deals-july-2025-1/", "content": "Amazon Prime Day is four days in 2025, and we're kicking off day three. The Prime Day deals started dropping last month and will end on Friday, July 11. We're working in shifts, covering 20 hours a day through the end, and are dangerously caffeinated—all to help you nab the best Prime Day deals with up-to-date recommendations.\n\nThe WIRED Reviews team only recommends deals on products we’ve actually tested and approved, and which are actually discounted. If you’re looking for up-to-the-minute coverage of deals, check out our Amazon Prime Day liveblog, which will run from 5 am to midnight daily.\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches and fitness trackers, Outdoor & Active, Travel, Toys & Games\n\nTech Deals\n\nDeals on laptops, routers, storage, cables, and more.\n\nIf you’re coming to Prime Day looking for something dirt-cheap, I’ve got one for you. Yes, this device is a Chromebook, but as a “Chromebook Plus” model, it’s a big step up from the reputation these laptops have when kids are introduced to them in schools. The Acer Chromebook Plus 515 comes with a 1080p display, a spacious 15.6-inch display, and an Intel Core i3 processor. The screen isn’t a touchscreen, but there's good port selection and decent speakers. For the price, it’s a really strong machine if your needs aren't high. —Julian Chokkattu\n\nDon’t write off a laptop as overpriced just because it’s more than $1,000. This configuration comes with 1 TB of storage, four times as much as the starting MacBook Air (or twice as much when price-matched). Even though this display isn’t as colorful or as bright, and the chassis isn’t as thin, the Dell Plus 14 (6/10 WIRED Reviewed) is a cheaper alternative that comes with more ports at a better price. —Luke Larsen\n\nFinally, we’re getting some new ultra-affordable Chromebooks. This new generation of Chromebooks look and feel more like modern laptops, and the Asus Chromebook CX15 is a great example of that. Its bezels aren’t overly large, and the keyboard feels great to type on. Not perfect, of course, but at $50 off the already low price, it’s one of the very best laptops you can buy at this price. —Luke Larsen\n\nWith the Surface Pro 11th Edition (6/10, WIRED Review), Microsoft’s long-standing 2-in-1 laptop is finally living up to its potential. Unlike previous models, it had great performance and battery life to match its excellent design and build quality. A true iPad Pro alternative for Windows users. With the latest Surface Pro keyboard, you can now even work while disconnected from the device, making it the ultimate travel companion. Prime Day brings the price 35% off, comfortably below $1,000. —Luke Larsen\n\nThe Microsoft Surface Laptop 7th Edition (7/10, WIRED Recommends) came out last year, but it remains the perfect antidote to the MacBook Air. Now at $500 off, it matches the RAM and storage at the same price as the MacBook Air, but here, you get a laptop with a larger screen and a faster refresh rate. There’s also a more affordable configuration that gets the price down to $900, while still coming with 512 GB of storage. —Luke Larsen\n\nWant a flagship Android tablet? This is a great 40% discount for Samsung’s best, which sports an 11-inch AMOLED screen, excellent performance, and includes a stylus that magnetically sticks to the top of the slate. The Tab S9 (7/10, WIRED Recommends) is the smallest of the lot, but that also makes it the easiest to use. It’s no iPad, but it comes very close. —Julian Chokkattu\n\nThe top pick in our Best Mesh Routers guide, this two-pack of tri-band Wi-Fi 6 routers comes pre-paired for easy setup. It scored consistently high for speed and stability, and will cover the average home. You get Wi-Fi on both the 2.4-GHz and 5-GHz bands, with an additional 5-GHz band reserved for wireless backhaul (traffic between the main router and the node). Asus mesh systems are great because they come with free, comprehensive security software and parental controls (no subscription required). —Simon Hill\n\nReady to upgrade your home network to enjoy the speedy delights of Wi-Fi 7? The Netgear Orbi 770 Series (8/10, WIRED Recommends) is easy to set up and use, delivers stable and speedy performance, and offers expansive coverage. A relatively new mesh that’s never been discounted this low before, I think it’s the best Wi-Fi 7 mesh for most homes right now. —Simon Hill\n\nEnjoy simple, set-and-forget Wi-Fi courtesy of Amazon's Eero mesh systems. The tri-band Eero Pro 6E (7/10, WIRED Recommends) adds 6 GHz to the familiar 2.4-GHz and 5-GHz bands, for fast and dependable Wi-Fi. It’s the perfect choice for busy households with many devices and a 1 Gbps or faster connection. The Eero Plus subscription is expensive ($10 per month or $100 per year) but includes comprehensive parental controls, advanced security, ad blocking, and even a password manager and VPN service. —Simon Hill\n\nAs the budget pick in our best mesh Wi-Fi systems guide, the Deco X20 is already a bargain. This Wi-Fi 6 dual-band mesh (2.4-GHz and 5-GHz) is easy to set up and delivered solid results in my tests. It’s not the speediest mesh, but if your internet connection is 500 Mbps or less, it’s likely enough. Each router has two gigabit Ethernet ports, and the vaselike design blends in easily on shelves or tables. —Simon Hill\n\nThis tri-band Wi-Fi 6E mesh system from TP-Link scores a place in our best mesh Wi-Fi systems guide. Easy to set up and configure through the mobile app, each unit has one 2.5 Gbps Ethernet port and two gigabit ports. It offers fast speeds at close range on the 6-GHz band, but was also fast on 5 GHz, and offered a decent range on 2.4 GHz. There are optional subscriptions for parental controls and enhanced security. —Simon Hill\n\nIt may look like a space shuttle, but this is actually one of the best Wi-Fi routers, and if it lands in your home, you can expect speedy Wi-Fi on three bands (6-GHz, 5-GHz, and 2.4-GHz). It also boasts a 2.5-Gbps WAN/LAN port, five gigabit LAN ports, and a USB-C 3.0 port. This Wi-Fi 6E router has been dropping in price since Wi-Fi 7 took off, but we’ve never seen it 50% off the list price. —Simon Hill\n\nIf you want to upgrade your network, this tri-band Wi-Fi 6 router from Asus is tried and tested. It appears in our best routers guide thanks to its simple setup, silky performance, and serious speed. It has plenty of ports, including a 2.5 Gbps WAN/LAN and two USB ports, free security software, and parental controls, and offers a wealth of configuration options. For folks with internet connections up to 2 Gbps, this router delivers. —Simon Hill\n\nStaying connected to the internet when you travel can be challenging, but a good mobile hotspot will keep you online, and the Netgear Nighthawk M6 Pro is a very good mobile hotspot. With support for 4G and 5G networks, simply slip a SIM card in, and you’re good to go. You can connect up to 32 devices, the range is up to 2,000 square feet, and, as a Wi-Fi 6E router, it supports the lightning-fast 6-GHz band. —Simon Hill\n\nA travel router is handy on the road or vacation, and the Asus RT-AX57 Go is our current top pick. This 5-inch, white plastic square is a dual-band Wi-Fi 6 router with gigabit WAN and LAN Ethernet ports. It can connect to public Wi-Fi or your phone via the USB 3.2 port to act as a hotspot. Link your devices at home before you leave, and the Asus RT-AX57 Go keeps your family happily online. —Simon Hill\n\nGamers seeking customizable RGB lighting and a performance edge will love the tri-band Asus ROG Rapture GT6. A single 2.4-GHz band and two 5-GHz bands offer a speedy connection for all your gaming gear. The 5-GHz performance is excellent with the wider 160-MHz channels. You also get free security software, comprehensive parental controls, game modes that boost performance and prioritize related traffic, and plenty of ports, including four Ethernet and one USB. —Simon Hill\n\nEveryone needs a USB-C hub, but this one has one handy feature that most don’t: a built-in M.2 enclosure. That means in addition to having your basic ports covered, you can also pop in an SSD and use this as a secondary drive. The SSD isn’t included, but it greatly expands what this little accessory can do. —Luke Larsen\n\nIf you want something hard-wearing and fast charging from the best USB-C cables, this is our pick and it's 41% off for Prime Day. It tops out at 240 watts and has a tough, braided nylon exterior made from 100% recycled plastic. Anker promises this cable will last a century, and it can operate in temperatures from -40 degrees to 176 degrees Fahrenheit. The ribbed cuffs make it easy to grip, it’s USB-IF certified, and there’s a lifetime warranty. —Simon Hill\n\nIf you hate having to fish around for the end of that charging cable, this Smartish magnetic cable wrangler is for you. It’s an angled magnetic wedge with a grippy rubber bottom and a bit of weight designed to sit on your desk and hold the ends of your charging cables. It even comes with wee magnetic fasteners for cables that don’t have metallic ends. —Simon Hill\n\nTopping our best USB flash drives guide, the SanDisk Extreme Pro offers speed and reliability at a great price. The sleek and durable aluminum case has a loop for attaching it to a key ring, and it's easy to slide open one-handed to reveal or hide the USB-A plug. It comes in various sizes and they are all on sale. —Simon Hill\n\nBefore you get too excited about this deal (it's a good one), know that, to take full advantage of the speed of this drive, you'll need a system that supports the PCIe 4.0 SSD standard. Provided you've got the machine to take advantage of it, in benchmark tests, this drive's results came very close to Western Digital's claimed 7,300 MB/s read speeds. It's worth noting that the 8-TB version is also on sale for $620 ($930 off). —Scott Gilbertson\n\nLexar's Professional 2000x SDXC memory cards have been my choice for eight years now, and the very first one I ever bought is still going strong. The UHS-II (U3) speeds go up to (and sometimes over) Lexar's claimed 300MB/s, and it has no trouble with 6K video. This deal is on the largest (and best if you're shooting video), but the other sizes are also on sale if you don't need the big one. —Scott Gilbertson\n\nThe Nikon Z6 III (8/10, WIRED Recommends) is our favorite Nikon mirrorless camera. The 24-megapixel partially stacked CMOS sensor offers great image and video quality, with excellent subject tracking autofocus and support for ProRes video. It's one of the best hybrid, photo/video cameras on the market. —Scott Gilbertson\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches and fitness trackers, Outdoor & Active, Travel, Toys & Games\n\nHome Office\n\nDeals on our favorite office chairs, desks, keyboards, mice, and monitors.\n\nThe Steelcase Gesture is our upgrade pick in our Best Office Chairs guide. The seat foam is a little more padded than a chair like the Herman Miller Embody, and there’s a good amount of upholstery options. It’s quite adjustable, so you can tailor it to your body, and there’s a 12-year warranty if anything goes wrong. —Julian Chokkattu\n\nIf you’re not ready to buy a whole new office chair yet, but find your current chair uncomfortable, try Cushion Lab’s Seat Cushion. I’ve tried a few of these from various brands before, but the Cushion Labs memory foam seat was one of the few that genuinely felt supportive and cushy. Make sure you use it with an adjustable chair (or desk), as it adds considerable height to the seat. You can wash the cover. —Julian Chokkattu\n\nFlexispot makes affordable home office furniture, and the EN1 standing desk is our top budget standing desk recommendation. It has four memory presets, so two people can set pairs of their preferred sitting and standing heights. The desktop is particleboard but feels nice, and the motors are reasonably quiet. There are a few different sizes and colors you can choose from. —Julian Chokkattu\n\nThis fantastic OLED gaming monitor came out late last year, and it’s already dropped to an all-time low of $730, which is 40% off. And it’s not because it’s not a good monitor. Far from it. The LG UltraGear 34GS95QE (8/10, WIRED Recommends) has the exceptional image quality and HDR goodness we expect from modern OLED monitors, combined with an aggressive 800R curve that wraps around your field of view. —Luke Larsen\n\nThe prices of OLED gaming monitors keep dropping, but the Samsung Odyssey G6 (8/10, Wired Recommends) will be among the absolute cheapest options you can buy. And I don’t mean cheap in terms of quality. With a 360-Hz refresh rate and fantastic colors, as tested by one of our monitor reviewers, it delivers fast and sharp gaming action. It's the OLED monitor most gamers should be buying on Prime Day this year. —Luke Larsen\n\nNot everyone needs a smart monitor, but for the right person or family, it’s a lifesaver. This 32-inch, 4K monitor would be perfect for an office that just so happens to double as an entertainment room in the evening. Because it comes with a remote and webOS software, the LG MyView Smart Monitor (7/10, WIRED Recommends) transforms from a work monitor into a fully functioning smart TV when you need it to be—no PC required. —Luke Larsen\n\nMost PC gamers are still using 1080p displays, but if it’s finally time for an upgrade, the Dell S2722DGM is an affordable way to jump to higher resolutions and refresh rates. A resolution of 1440p and a refresh rate of 165Hz will offer a much more pleasant gaming experience from basic 1080p, not to mention the subtle 1500R curve, which gently sucks you into the gaming experience. You’ll miss out on HDR, of course, and it doesn’t have many ports. —Luke Larsen\n\nThe Logitech G Pro X TKL tops our list as the best keyboard you can buy, and for good reason. The tactile switches (also known as linear switches) feel luscious, and I find the TKL (lack of number pad) layout to be ideal for gaming, never getting in the way of my mouse hand, but not making non-gaming inconvenient. While it’s normally a bit expensive, this sale price makes it an absolute must-buy if you’re looking for a gaming keyboard. —Luke Larsen\n\nLow-profile mechanical keyboards are the best of both worlds, offering that tactile typing we all love without the bulk and heaviness that come with standard mechanical keyboards. It has a strikingly thin profile, despite the fact that it has hot-swappable switches and a gasket mount design. It’s a gorgeous design, and it’s one of the very best mechanical keyboards you can buy. —Luke Larsen\n\nThe BlackWidow is a staple in the world of PC gaming as a go-to wired keyboard. But I really like this 75% layout model which cuts out the numberpad, but leaves you the arrow keys. The hot-swappable nature means you can change out the switches whenever you like and customize to your heart’s content. The white version just looks so clean too, especially if you already have a white theme going for your desk setup.—Luke Larsen\n\nThere’s a reason this mouse has become iconic. No other mouse balances performance, customization, and design in a way that just about everyone loves. For me, it’s all about the shape, which offers the perfect amount of ergonomic support for my thumb. Spending over $100 on a mouse might sound crazy to some, but if you rely on a mouse all day, every day, it’s well worth it.—Luke Larsen\n\nLogitech’s premium wireless gaming mouse is one of my very favorites. It’s a mainstay in this category thanks to its excellent, reliable sensor and simple design. It’s particularly good if fast-paced first-person shooters are your jam, thanks to its speedy polling rate and DPI. I like that the aesthetic isn’t overly flashy, maintaining a fairly subtle design that could fit just as well in an office as it could next to a bottle of Mountain Dew. —Luke Larsen\n\nThe Viper is Razer’s esports line of wireless gaming mice, and the Pro versions are extremely light. The Viper 2 Pro weighs just 58 grams, giving you those fast, twitchy responses for shooters. There was a time when a wireless mouse couldn’t be depended on for that kind of responsiveness, but the Viper 2 Pro absolutely can. The price drop is significant, too, bringing it down well under $100. —Luke Larsen\n\nNzxt might not be known for gaming mice, but based on the Lift 2, it should be. It’s wired, of course, but that should be a given for the price of $25, which is 50% off. What you get, however, is a super-light design that weighs just 61 grams. It also has high-end specs like an 8K polling rate and a sensor that keeps your games feeling responsive. —Luke Larsen\n\nThis handy tablet holder is great at holding up tablets, e-readers, and even a Nintendo Switch. I love using it in bed or on the couch so I don’t strain my wrist cysts. It’s easy to set up anywhere in the house, so long as there’s a ledge or table to secure it onto. —Nena Farrell\n\nMost people don’t need to spend more than $50 on a gaming mouse. It might not have the extreme sensitivity as more expensive options, but so long as you’re not an aspiring esports athlete, I don’t think you’ll find the speed of this mouse holding you back. Don’t spend more when you don’t need to—and don’t buy any other gaming mouse for this much. —Luke Larsen\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches & Fitness Trackers, Outdoor & Active, Travel, Toys & Games\n\nApple\n\nPrime Day deals on Apple products and accessories.\n\nYou do not need an iPad, but now that iPadOS 26 allows for conventional windowing, you want one—for watching TV while you're washing dishes or on a plane or perhaps even getting some actual work done. The A16 chip means that this is the only iPad in Apple's lineup that doesn't support Apple Intelligence, which, hey, might be a perk. —Adrienne So\n\nThe M4 MacBook Air (9/10, WIRED Recommends) is the best laptop you can buy, and it might be the best laptop ever sold at this price. As someone who reviews a new laptop almost every week, trust me: Just buy it. The only real question is whether or not to make the jump to additional storage and what color to choose from. I’m partial to Starlight, but the new Sky Blue option is equally classy. —Luke Larsen\n\nI’ve written at length about why the 13-inch M4 MacBook Air is the laptop most people should buy. But what about the larger 15-inch MacBook Air (9/10, WIRED Recommends)? It’s every bit as fast and thin, and maintains the same pixel density in the display. The larger screen just might be worth the extra $150, especially if you don’t use an external monitor at home. It has a killer set of speakers too. —Luke Larsen\n\nWhile I recommend that people consider the MacBook Air first, there’s no doubt that the Pro model has its allure. While it uses the same M4 chip, the MacBook Pro 14-inch (9/10, WIRED Recommends) offers a brighter and better Mini-LED display, along with awesome speakers and more ports. You’ll have to opt for the M4 Pro or Max if you need more speed, but if you aren’t a creative professional, the M4 should be more than enough. —Luke Larsen\n\nI have a weird prejudice against the AirPods Max. They're overpriced, and everyone knows exactly how much they are. (And the case looks like you're carrying around a bra.) Still, they're beautiful, and WIRED reviewer Parker Hall says they're one of the best headphones he's ever heard. At this very significant discount, that makes them almost a reasonable buy. —Adrienne So\n\nProbably the best trackers for Apple folks, AirTags use Bluetooth connectivity and Apple's special U1 location-finding chip to help you pinpoint their location in the Find My app on your iPhone, iPad, or MacBook. Never lose your keys, bags, or anything else again. —Adrienne So\n\nThere are better MacBooks higher up on this list. Faster ones with better displays and more ports. Most people should buy one of those. But the M1 MacBook Air is a stalwart computer that's continued to be sold, exclusively at Walmart, despite being almost five years old. For Prime Day, the price has been dropped to $599, marking a new low for buying a MacBook. Of course, you can also pick up one of the refurbished models for even less, but when it comes to new laptops, you find a better $600 laptop on the market right now.\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches and fitness trackers, Outdoor & Active, Travel, Toys & Games\n\nAmazon Devices\n\nDeals on Amazon’s own devices, including the Kindle, Echo, and Fire tablet.\n\nIf you're not looking to go all out on Apple's iPad for your rambunctious youngster, this Fire TV tablet is a great budget alternative—especially on a hot sale. This is best for kids over the age of 8, as it has slightly more mature content and a more advanced design. You're getting great stuff from within the Amazon ecosystem, including games, books, videos, and more, all filterable by the adult in the room. We love the two-year worry-free warranty, especially if you've got a drop-friendly child, and this price makes it a serious bargain. —Ryan Waniata\n\nIf all you need is a cheap-and-stable streamer, one that shows you TV and movies on Amazon Prime you never knew existed, this is a nice buy. It's a great option for dumber 4K TVs or even an HD TV that may need replacing down the line. We still prefer the 4K TV Max for serious streaming after testing both, but you can't do much better for a budget stick with voice search at this price, especially if you're into Alexa as your copilot. —Ryan Waniata\n\nThe Amazon Echo Pop (7/10, WIRED Recommends) looks like someone sliced the Echo Dot in half, and the sound quality feels a little thinner, too. But it does come in fun colors and is a little cheaper—especially right now!—so it’s a fun choice for a dorm room or somewhere where you just want a voice assistant handy, plus a little pop (get it?) of fun. It's just $22 or 45% off. —Nena Farrell\n\nThe Amazon Echo Dot (5th Gen) looks like the regular Echo, but miniaturized to be a fraction of the size. It’s got the same design, and still packs impressive sound for such a small speaker. It has better bass performance than the previous Dot and Amazon’s other petite speakers. It’s a great speaker for the price, and now it’s even cheaper. —Nena Farrell\n\nIf you're an Amazon fan and looking for the best smart display, this is it. The Amazon Echo Show 8 (3rd Gen) is the perfect size for just about everything it can do. With an 8-inch screen, it’s easy to see the weather, follow a recipe, control your smart home, or even join a video call thanks to the built-in 13MP camera. —Nena Farrell\n\nAmazon's Echo Spot (7/10, WIRED Recommends) sits somewhere in between being a smart speaker and a smart display. There’s now a small screen on the top half of the device that shows the weather and your calendar or the song you’re playing, but skips other features that smart displays pack. But if you just want a little visual assistance without a full-on recipe guide, I think you’ll actually love this one. —Nena Farrell\n\nThis might look like a smart display, but it’s focused on a single feature: controlling your smart home. And you know what? I love it. The Echo Hub (8/10, WIRED Recommends) is minimalist and works great as a hub for your smart home, with no distractions on the screen (or ads!). It has a weak speaker, but it will pair with your preferred speaker to send music requests to it. —Nena Farrell\n\nThe Amazon Echo Show 5 can do everything the larger Amazon smart displays can, but with a much smaller screen. It's a good size for a bedside table, though you’ll want to use the camera cover, or for small tables where you mostly want a clock face and to see the weather. It’s a little too small for other activities in my opinion, but if this size speaks to you, it’s on sale right now. —Nena Farrell\n\nThe 12th-generation Paperwhite (8/10, WIRED Recommends) is our favorite Kindle. It’s a little larger than the basic Kindle and comes with a warm light option, which is gentle on the eyes. It’s got a fast and smooth performance, and overall, it's the best choice if you’re looking for a new Kindle. It’s especially exciting to see it on sale—don’t miss the chance to get it for cheaper. —Nena Farrell\n\nIf you’re looking for a Kindle for a kid, Amazon’s Kindle Kids is a child-focused twist on the Kindle. It comes with six months of Kids+, a subscription full of books designed for kids aged 3-12, giving plenty of reading options right away. There are also three fun cover options, so you can pick one out that your kid will be excited to see even when they aren’t reading. —Nena Farrell\n\nThe Kindle Scribe (8/10, WIRED Recommends) combines an e-reader and a digital notebook into one. It’s much bigger than other Kindles, so there’s room to doodle on the notebook pages, and it allows for some limited annotations while you read. It’s not a perfect device, but it’s the one I find myself grabbing over and over again since it’s so easy to use. It’s perfect for just jotting down ideas and brainstorming without needing more complicated software. —Nena Farrell\n\nThe Kindle Colorsoft (7/10, WIRED Review) is Amazon's first-ever Kindle with a color screen. It’s an exciting addition, and the gentle colors are beautiful onscreen. The Colorsoft has run into some issues with performance and the trade-in program, though. If you buy one, get one without trading in so that you can easily return it if something goes wrong. The fact that it’s on sale right now is a perfect opportunity. —Nena Farrell\n\nCourtesy of Amazon Amazon Kindle Essentials Bundle including Kindle (2024), Black Fabric Cover, and Power Adapter $162 $106 (35% off) Amazon\n\nIf you’re looking to get a new Kindle and want a case, then snag this handy essentials kit while it’s on sale for Prime Day. It includes the latest basic Kindle, a fabric cover, and a power adapter (which is also handy since Kindles only come with a charging cord, no adapter). The bundle only comes with a black Kindle, but you can choose from a couple of cover colors. —Nena Farrell\n\nAmazon launched a new version of its basic Kindle last year, and while it’s the most minimalist of its family of e-readers, it’s still a fantastic device. I’m a big fan of the matcha green color, and you’ll still get a built-in light (though no warm option) with this model. It’s nice and small, perfect for sneaking into a small purse or bag so you can read anywhere you go. —Nena Farrell\n\nThe Fire Max 11 (5/10, WIRED Review) wasn't our favorite when it launched. It's Amazon's nicest Fire tablet, but it was expensive for what you get. At this price, however, it's a solid buy. The screen is bright and sharp enough, the speakers aren't bad, and the cameras are 1080p. Are there nicer Android tablets? Absolutely, but none of them so deeply discounted at 40% off, down to $140. —Scott Gilbertson\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches and fitness trackers, Outdoor & Active, Travel, Toys & Games\n\nPhones\n\nMobile phone deals, plus cases, charging stands, power banks, and other accessories.\n\nNot to be confused with the Galaxy S24 series, this midrange smartphone from late 2024 has some elements of the flagship phone, but makes some sacrifices to get the price down. In my Best Samsung Phones guide, I say the FE is only worth buying if it dips below $500. Well, that time has come. Performance is solid, the triple-camera system is handy, and it will get six more years of updates. —Julian Chokkattu\n\nThe Galaxy S25 Ultra is Samsung’s top-of-the-line flagship candybar smartphone. Maybe the upcoming Galaxy Z Fold7 series isn’t as enticing to you. Now’s your chance to snag the gargantuan phone at a decent discount. It has two telephoto zoom cameras, so you can snap the perfect pic of your kid on the soccer pitch, and there’s a hidden stylus that lets you sign documents and jot down handwritten notes in a jiffy. Read our Best Samsung Phones guide for more. —Julian Chokkattu\n\nThis is one of the lowest prices we’ve seen on Samsung’s folding phone, which tracks because Samsung is announcing the Galaxy Z Fold7 series this week. Still, there’s nothing wrong with buying last year’s tech, especially when you get a massive discount. The Z Fold6 may not be as enticing as competitors like the Pixel 9 Pro Fold or the Honor Magic V3, but it has the best build quality of the lot and sports the best after-sales support network. —Julian Chokkattu\n\nIf you don’t need many bells and whistles but just want a good, well-rounded smartphone, you can’t go wrong with the Galaxy S25 or Galaxy S25+, which are identical in many ways. They’re different in size, with the S25+ sporting a larger 6.7-inch screen, which brings better battery life, too. There’s no S Pen stylus here, but you still get great performance, a versatile triple-camera system, and a promise of seven years of software updates so you hopefully won’t feel the need to upgrade anytime soon. —Julian Chokkattu\n\nGoogle’s next folding phone isn’t far off, so it’s a good time to grab the 2024 model at one of its lowest prices. The Pixel 9 Pro Fold slimmed down the original and made it taller, making it feel remarkably like a normal Pixel when closed. But you can open it up to experience a large 8-inch screen. Its camera experience is slightly behind the Pixel 9 Pro, but it’s still a capable and powerful smartphone that’s great for multitaskers. —Julian Chokkattu\n\nI usually tell most people to skip the Pixel 9 (9/10, WIRED Recommends) because it sits in an awkward middle spot where it loses some features like vapor chamber cooling, which enables better thermal performance on the Pixel 9 Pro series, and the improvements over the cheaper Pixel 9a aren’t vast. But at $549, that doesn’t really matter. This is a remarkable phone for that price, with a robust camera system, great performance, and excellent build quality. —Julian Chokkattu\n\nThe Pixel 10 series rumors are heating up as Google’s next phones are expected to arrive in August, but the Pixel 9 Pro and Pro XL (9/10, WIRED Recommends) are still great phones to buy, especially on sale. The hardware feels excellent, and they have vapor chamber cooling systems for better thermals, allowing you to game for longer periods. The cameras are some of the best on a smartphone, and the nice thing is they’re identical in specs. You’re largely choosing what size phone you want, though that does mean the XL has slightly better battery life. —Julian Chokkattu\n\nThe Razr+ didn’t get much of an upgrade over the 2024 model. Motorola improved the hinge mechanism, so it’s a little more durable, but it otherwise shares many of the same specs. It’s still a nice buy when it’s discounted this much. It may not have an ultrawide camera (it has a 2x telephoto), but you’ll still have fun with this flip phone, especially if you snag it in hot pink. Read our Best Motorola Phones guide for more. This price is $100 off, but we were expecting a bigger sale and still hope to see one. —Julian Chokkattu\n\nThis is the first major deal we’ve seen on Motorola’s top-end Moto G phone in 2025. The Moto G Stylus is one of the best cheap phones you can buy. Performance is excellent, as is its design and build quality, and as the name suggests, there’s a hidden stylus embedded in the phone. It also has a headphone jack and microSD card slot. —Julian Chokkattu\n\nKeeping my phone both secure and visible in the car was an ongoing experiment for years—suction cup and vent mounts fall off, my lap wasn’t feasible, and just plopping my phone in the cup holder obscured too much of the screen. Last year I came across the Bokilino cup holder phone mount as a solution, and while I don’t love having to give up a cupholder, the Bokilino has performed admirably at keeping my phone secure and angled correctly. My only regret is not having nabbed it at this price. —Kat Merck\n\nThis chunky device stands out as one of the best power banks because it can supply up to 145 watts (one USB-C port at 100 W and the other at 45 W). An ample 25,000 mAh capacity is enough to top up all your gadgets, and you can fly with this power bank in your carry-on. The small LED display shows the current charge state of the battery, and it comes with a USB-C cable. —Simon Hill\n\nSnag all the power you need to keep your phone, tablet, gaming handheld, or laptop running with this chonky portable charger from Anker. As the upgrade pick in our guide, it is slick and beautifully made, with a handy LED display for stat nerds and a built-in USB-C cable that doubles as a carrying loop. —Simon Hill\n\nNot only do you get 20,000 mAh of battery capacity to charge up your phones and other small gadgets, but this power bank also has a handy display showing a precise readout of the remaining battery percentage, charging rates, and other stats for power bank nerds. We prefer the smaller model because it has a cute face on the display, but the larger version is more useful, and it’s a bargain at this price. —Simon Hill\n\nFor folks with an iPhone and AirPods, this is one of the best MagSafe wireless chargers on the market. The wide, circular base is steady with a spot for charging AirPods, and the MagSafe charging pad allows you to charge your iPhone in landscape for StandBy mode, which turns it into an alarm clock. —Simon Hill\n\nPerhaps the best car phone mount for your dash, iOttie’s Easy One Touch 6 is easy to use one-handed. When you place your phone against the trigger button, the arms automatically close, and you simply slide the bottom feet to the correct height. Press the release bars to remove. The telescopic arm allows you to tweak the placement, and the ball joint makes it easy to set an ideal angle. There’s even a clamp for your charging cable. —Simon Hill\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches and fitness trackers, Outdoor & Active, Travel, Toys & Games\n\nTVs\n\nDeals on televisions and streaming devices like Roku. Check out our complete list of the Best Prime Day TV deals for more recommendations.\n\nLG’s G5 OLED (9/10, WIRED Recommends) offers the most versatile, striking, and downright gorgeous picture performance I’ve tested yet. Whether it's searing brightness, near-perfect black levels and screen uniformity, refined detail, or fantastic clarity, this TV does it all. It’s loaded for gaming and streaming, and passed every test I threw at it. Some noticed minor banding with select HDR10 video, but updates seem to have mostly fixed it, making this the 2025 TV to beat. —Ryan Waniata\n\nWe love Roku because it offers a simple and easy-to-use streaming interface at an affordable price, and the same can be said for its in-house TVs. This Plus Series model (7/10, WIRED Recommends) is bright and features good HDR for colors, making it a no-brainer for someone who wants a simple cheap TV. It's 30% off, below $450. —Parker Hall\n\nTCL’s QM6K (8/10, WIRED Recommends) sits atop our Best TVs list thanks to a brilliantly balanced picture for the money. It’s not the brightest TV in its price class, but it’s got enough spunk to light up HDR, good black levels for impressive contrast, rich and natural colors, and a remarkably clear and unified screen for its class. Good gaming chops and an intuitive Google TV interface finish the deal for a great buy. —Ryan Waniata\n\nSony’s Bravia 8 II (9/10, WIRED Recommends) is one of the most beautiful TVs you can buy. Its QD-OLED screen isn’t quite as deep black or scorching bright as the LG G5 (9/10, WIRED Recommends). Instead, Sony relies on fabulous picture processing for pristine clarity and incredibly vivid yet natural colors to wow you into submission. The TV’s still-flashy HDR punch, perfect off-angle viewing, and handy gaming features complete the package for a glorious ride. —Ryan Waniata\n\nThis QLED stunner (9/10, WIRED Recommends) has some of the brightest backlighting we’ve ever tested for a truly cinematic viewing experience. The only downside is a lack of HDMI 2.1 compatibility, with only two of the four HDMI ports providing modern features like 4K gaming at 120 Hz. However, if it's a vibrant yet incredibly poised and clear picture you're after, this one is worth the splurge. —Ryan Waniata\n\nPanasonic’s return to the U.S. market was special thanks to the Z95A OLED TV (9/10, WIRED Recommends), which uses LG’s MLA panel and Panasonic color grading to thrilling results. Colors look vivid yet natural, even for sitcoms and movies. Brightness is among the best we’ve tested, black levels are oily, and everything you watch just pops. This is its lowest price ever. —Ryan Waniata\n\nIf you’re after a premium screen with a bit more pop and punch than your average OLED, the QN90D (8/10, WIRED Recommends) is a hot contender. This QLED TV offers fabulous picture processing for excellent clarity, accurate yet intense colors, and knockout brightness to bust through even your sunniest viewing parties. Its off-axis viewing is just OK, but its mini LED backlight does a good job of creating crisp images and deep blacks. —Ryan Waniata\n\nLike its Samsung rival, the S90D (9/10, WIRED Recommends), LG’s lovely C4 OLED (9/10, WIRED Recommends) is one of our favorite TVs, now at around half its launch price. That means if you’ve been holding out for its fabulous contrast and black levels, punchy brightness, natural and expansive colors, and excellent gaming chops (including four full-bandwidth HDMI ports), now is your moment. This TV is just way too good to be this cheap. —Ryan Waniata\n\nThe price of Samsung’s luscious S90D (9/10, WIRED Recommends) has been fluctuating for months, but at around half its debut cost, you can’t lose. This TV’s only real flaw is a lack of Dolby Vision HDR support. It serves up OLED’s infinite contrast in style with deep black levels, excellent clarity and upscaling, and bright, vibrant colors that bring everything to life. It adds four full-bandwidth HDMI ports for sweet gaming spoils. —Ryan Waniata\n\nSamsung’s flagship S95D OLED TV (8/10, WIRED Recommends) carves out its niche with a unique matte-like display. While this can slightly soften black levels in certain lighting, it’s a game-changer for bright rooms, effectively neutralizing glare even from direct reflections. Beyond its anti-glare prowess, the TV dazzles with eye-searing brightness, rich and vibrant colors, superb image processing, and a wealth of features, including a built-in cloud gaming hub. —Ryan Waniata\n\nTCL's QM7K had some odd quirks when I first evaluated it, including off colors that tended to turn black images into green (who knew there were so many green leather jackets?). The issue was fixed with a firmware update, which makes this a pretty tempting buy, especially at this price. Using TCL's new Precise Dimming tech, the TV provides almost OLED-level shades of black and blooming reduction, while still getting fiery bright. It's also got plenty of great features, including a 144-Hz refresh rate for gaming, making it worth real consideration on super sale.\n\nI bought this basic stand with wheels on an early Prime Day deal last weekend and attached it to a cheap TCL TV (check out our recommendations here), primarily so my husband could watch his sports outside on the deck without disturbing the rest of the house. However, I found this setup to be surprisingly enjoyable myself, and was impressed with how sturdy the stand was. It even has little stoppers to keep it from rolling around, and a table for a remote or cable box. —Kat Merck\n\nThe Roku Ultra is the ultimate Roku. It features support for Dolby Vision and a wired Ethernet port for the fastest streaming, and the included remote comes with a 3.5 mm port, so you can plug in headphones and still watch your big screen. —Parker Hall\n\nThe Roku 4K streaming stick is the highest-end Roku stick, which means you get all the same great apps but also a voice remote and support for Dolby Vision HDR. That makes this the best way to watch the latest shows and movies on your TV. I like that Roku has some of the best app support around, meaning you’ll never struggle to stream as long as you have good Wi-Fi. —Parker Hall\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches and fitness trackers, Outdoor & Active, Travel, Toys & Games\n\nHeadphones & Speakers\n\nDeals on audio devices, including headphones, earbuds, soundbars, bookshelf speakers, microphones, and earplugs.\n\nIf you’re still under the impression that noise-canceling earbuds cost hundreds of dollars, welcome to the weird world of 2025 where they’re basically free. These wireless buds provide clear sound, noise canceling that targets low frequencies, and even a helpful app with features like EQ presets and multi-point pairing, all for less than a takeout dinner for two. —Ryan Waniata\n\nThis is a great deal at 45% off our longtime go-to choice for the best wireless headphones. Sony’s illustrious WH-1000XM5 (9/10, WIRED Recommends) were recently upgraded to the pricey but potent XM6 (9/10, WIRED Recommends). For savvy shoppers, that spells a sweet deal on the previous pair, and I was happy to see a sizable price drop for Prime Day. These headphones still offer some of the best sound, noise canceling, and features available, in a slick matte package that’s ready to travel. —Ryan Waniata\n\nSony’s hallowed WH-1000XM4 (9/10, WIRED Recommends) headphones have been bouncing up and down in price since the XM5 was released. Now there’s an even better, noise-eviscerating version in the WH-1000XM6 (9/10, WIRED Recommends). Here’s the thing, though: these are still incredible headphones with great noise canceling, comfort, features, and sound. You wouldn’t want to pay full price, but buying the dip on some of the best wireless headphones ever is always a savvy move. —Ryan Waniata\n\nSennheiser’s HD 660S2 (7/10, WIRED Recommends) are bona fide audiophile headphones that pay uncommon attention to the low end. The bass response is rich, buttery, and natural, while the warm yet clear top end provides pristine detail for a brilliant accompaniment across your catalog. You’ll want a solid headphone amp and the fit can be a little tight, but these headphones serve as a statement piece that’s well worth considering on sale. —Ryan Waniata\n\nGoogle’s Pixel Buds Pro 2 (9/10, WIRED Recommends) are essentially AirPods Pro for Android. They work amazingly well, with great noise canceling, good mics, and excellent sound quality. I like that they’re a bit smaller other models, which makes them fit well in everybody’s ears. —Parker Hall\n\nOur reviewer did not love the AirPods 4, giving them a 5/10, but they're wildly popular and at under $100 they're good as backups or as a gift.\n\nThese affordable open earbuds from SoundPeats are utterly capable of everything that much more expensive options from Bose and Sony can do—play decent-sounding music while allowing you to hear the oncoming F150. Open earbuds will never be hi-fi. Just get a cheap pair like this. —Parker Hall\n\nIt might shock you to hear from an A/V editor, but the Skullcandy Method 360 ANC (9/10, WIRED Recommends) are some of the best affordable headphones we’ve ever tested. They have Bose-powered noise canceling, great battery life, and a larger case with a clip that lets you attach it to bags. —Parker Hall\n\nSony’s WH-1000XM6 (9/10, WIRED Recommends) took on the uncompromising Bose QuietComfort Ultra (9/10, WIRED Recommends) head-to-head for the title of the best noise-canceling headphones and won. It was very close, but still an incredible achievement. The secret for Sony is its pack of microphones and ultra-fast processing that edges out Bose’s response time. The headphones also offer some of the best sound quality in the genre and plenty of features for a premium package. —Ryan Waniata\n\nSony’s WF-1000XM5 (7/10, WIRED Recommends) are some of the best noise-canceling earbuds around, including impressive sound quality and plenty of features. Their only real downside is a relatively lofty price compared to options like Apple’s AirPods Pro (8/10, WIRED Recommends), while similarly priced options like Bose’s QC Ultra buds outmatch them for noise canceling. They’ve been bouncing between $300 and $200 for some time now, and at the latter price, you can’t miss. —Ryan Waniata\n\nThe Sonos Ace (8/10, WIRED Recommends) offer impressive noise canceling, smooth and detailed sound, and a fit that’s as comfy as any of the best noise canceling headphones. New features rolling out this summer claim to improve their noise canceling and calling skills, while their unique TV Swap feature works great for sending sound from Sonos soundbars. The Sonos app has had its troubles this year, but even as just Bluetooth headphones, the Ace are excellent. —Ryan Waniata\n\nBose’s Ultra Open Earbuds (7/10, WIRED Recommends) are pricey but excellent. They’re the best open earbuds I’ve tested when it comes to sound quality, while their unique rollable design is comfortable and malleable to keep them on in a variety of situations. It’s tough to pay full price for a pair that never blocks out sounds around you, but at a solid discount, these stylish buds become a lot more enticing. —Ryan Waniata\n\nThese awesome, affordable AirPods Pro lookalikes come in Pikachu yellow with clear elephant trunks, and they nearly sound as good as the real deal. I love how comfortable the Nothing Ear (a) (8/10, WIRED Recommends) are, thanks to silicone eartips, and the included charging case is also relatively stylish. —Parker Hall\n\nUltimate Ears is a serial contributor to our Best Bluetooth speakers list, and the Boom 4 (8/10, WIRED Recommends) is one of my favorites for its mix of smooth, balanced sound and excellent usability. From its extensive Bluetooth range to app features like a multi-band EQ and the ability to wake the speaker from rest, the Boom 4 is a stalwart companion that shrugs off dust, weather, and even serious drops without missing a beat. —Ryan Waniata\n\nSony’s SRS-XB100 (8/10, WIRED Recommends) is my favorite micro speaker for taking your sound on the go. Smaller than a Coke can, it’s liable to get lost in your backpack, giving the phrase portable speaker new meaning. The sound is refreshingly clear and full for its size, especially if you give it a solid base to work from, while features like Google Fast Pair and 16 hours of battery life make this a no-brainer buy. —Ryan Waniata\n\nJBL’s Clip 5 hangs in the shower; it hangs on your tent loop or your belt loop; it hangs wherever you do. It’s got surprisingly warm and full sound for its size, a dunkable design, and up to 12 hours of battery (15 hours in its lighter sound mode). While costly at full price, it’s a great Bluetooth speaker in a variety of situations and comes in loads of colors, making it a particularly good grab on sale. —Ryan Waniata\n\nJBL’s Go 4 is a similarly sweet sonic sidekick as the Sony SRS-XB100 (8/10, WIRED Recommends). Its biggest drawback is battery life of just seven hours (nine hours with the extended mode that cuts some bass). Its best feature is punchy and relatively full sound in a snazzy package that’s well-made and ultra durable. You won’t break it, but you should buy it if you need a great deal on a tiny sound machine. —Ryan Waniata\n\nSonos has been through some app-based tumult over the past year, but one product that has remained excellent is this Sonos Roam 2 Bluetooth speaker (9/10, WIRED Recommends). The little triangle sounds fantastic and takes a real beating. —Parker Hall\n\nTribit has quickly become one of our favorite Bluetooth speaker brands, with hit after hit offering strikingly good sound for the money. The Stormbox Blast 2 is simply the best value I’ve found for a boombox-style speaker, blasting out clear, full, and powerful sound with enough wattage for even major backyard hangs. Did I mention it’s also a karaoke speaker? It’s a sweet deal at full price, and a must-buy on sale. —Ryan Waniata\n\nJBL’s Authentics 200 (9/10, WIRED Recommends) speaks both Google Assistant and Amazon Alexa, so you can swap between the two for multiple tasks—especially handy if you have smart home devices from both brands. Its retro design and control knobs make it as easy on the eyes as it is to use, while its excellent sound stands with some of the best smart speakers we’ve tested. —Ryan Waniata\n\nThe Bose Soundlink Mac (9/10, WIRED Recommends) is the ultimate modern boombox, thanks to huge dynamic drivers, massive bass, and an awesome ropelike carrying handle. It’s about the size of a middle school lunchbox but packs much more power, with enough juice to last 20 hours on a single charge. —Parker Hall\n\nGetting the Wiim Amp on sale feels like double dipping on your taxes; the deal’s almost too good. I tested both the original Amp and the Amp Pro (9/10, WIRED Recommends) with multiple bookshelf speaker pairs, and the performance differences are minor. Meanwhile, the standard Amp offers AirPlay while the Pro doesn’t, adding to its cascade of streaming options, HDMI ARC support, and a potent power supply for a killer A/V entry point. —Ryan Waniata\n\nClip-based earbuds like these cheap ones from JLab are awesome to throw in your gym bag or center console and forget about until you need them. For $20, you might as well buy a few pairs. They’re decent sounding, and they come with a charging case that is larger (and thus harder to lose). —Parker Hall\n\nIn the world of USB microphones, Blue’s Yeti deserves a place on Mt. Rushmore. This iconic mic sounds great, looks great, and features quality physical controls like a volume knob to help you fine-tune your sound. It used to be good, it’s still good. Be grateful. The black one is also on sale. —Parker Hall\n\nKnow someone who’s hard of hearing? The Zvox AccuVoice AV157 is our favorite affordable soundbar for ramping up dialog. The secret is in the Zvox AccuVoice software, which uses digital signal processing to clarify voices and other sometimes buried audio. Every TV needs a great soundbar, and this one is a top affordable option for clarifying the garble so you hear everything right the first time. —Ryan Waniata\n\nSony’s oddly conceived (and titled) Bravia Theater System 6 (8/10, WIRED Recommends) surprised me with its fidelity, punch, and seamless surround sound immersion. Running all connections through its potent subwoofer, the multi-speaker system isn’t your typical 2025 plug-and-play soundbar setup, foregoing upfiring speakers for Dolby Atmos. No matter, the sound wins the day, and this thing rocks, bringing you into the action better than any similar 5.1 system I’ve tried. —Ryan Waniata\n\nThe Beam Gen 2 is a top pick for anyone after a micro-modular bar that’s as pliable as it is powerful. You’ll get clear and expansive sound thanks to its virtual effects, multi-room audio capabilities, and the ability to add on surround speakers and a subwoofer from the Sonos speaker lineup later. If you’re willing to bank on Sonos’ software for the long haul, this is a great deal on a great bar. —Ryan Waniata\n\nVizio’s latest Elevate SE soundbar (7/10, WIRED Recommends) cuts back on features like Wi-Fi streaming and even a remote, but it keeps the coolest trick: rolling speakers that spin upward for Dolby Atmos effects and back down again for stereo and surround tracks. The multi-speaker system’s frill-free yet stylish layout is great for those looking for serious performance on a budget, making it all the more tempting at a reduced price. —Ryan Waniata\n\nBose’s micro-sized smart soundbar (8/10, WIRED Recommends) one-ups its rival Sonos Beam with true upfiring drivers for more immersive Dolby Atmos performance. It’s a surprisingly musical system, with a talent for piano and strings, while dialogue is clear across content. Its lack of a subwoofer leaves the bass wanting, but features like streaming over Bluetooth and Wi-Fi and built-in Alexa smarts make it a powerful tool at the center of your TV console. —Ryan Waniata\n\nRoku’s littlest soundbar, the Streambar SE, is also a streaming device, thanks to the brand’s OS being onboard. That means this is a great all-in-one solution to upgrade an older TV to 2025 streaming specs, with better sound to boot. —Parker Hall\n\nJBL’s excellent Flip 7 (9/10, WIRED Recommends) is my favorite all-around portable speaker, but anyone asking me for the best deal will land right here. As noted in my review, Tribit’s Stormbox 2 (9/10, WIRED Recommends) sounds way too good for the money, edging toward the Flip and plenty of others at a fraction of the price. As with other Tribit speakers, it’s always a deal, and a discount just sweetens the pot. —Ryan Waniata\n\nVizio’s mini 2.1 soundbar provides solid sound quality from the main bar and some nice punch from its compact subwoofer. It’s light on features and inputs, but Vizio’s reworked app makes adjusting settings and Bluetooth streaming simple. Dialog occasionally takes a backseat when things get raucous, but music and movies are both well served, and anything below the full $170 price makes this bar a solid steal. —Ryan Waniata\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches and fitness trackers, Outdoor & Active, Travel, Toys & Games\n\nKitchen\n\nDeals on kitchen gear, including coffee machines, air fryers, and cookware.\n\nWe rank the Italian-made Linea Classic from De’Longhi as our favorite $200 espresso maker, a price point where it’s tough to find a reliable machine. This is true especially among machines with a pressure gauge and a fast-heating thermopump. Welp, now it’s not $200. It’s $150. The trade-offs are that the steam wand is a little foamy, and the portafilter is lightweight. —Matthew Korfhage\n\nThe original Aeropress—a brilliant coffeemaker from the same guy who brought you the Aerobie Flying Ring—remains part of my coffee-making rotation even after a decade and many fancier devices. You fill it with grounds, pour over water, and use a plunger to steep and then force-pressurize the beans to get a cup that’s not quite espresso but not quite coffee and thoroughly delicious with minimum effort and cleaning. This Prime Day price of $28 is the lowest I have ever seen it and a full 30% off the regular price. —Martin Cizmar\n\nThe Bruvi BV-01 (8/10, WIRED Recommends) is my favorite pod coffee machine. The design is cute and the coffee pods brew a respectable cup. They’re also biodegradable. The large touchscreen and companion app let you customize and schedule your coffee, and brewing is fast at under one minute. This bundle comes with 20 coffee and espresso pods to get you started—make sure you clip the coupon to get $150 off. —Louryn Strampe\n\nThe Oxo Brew is the best grinder I know at this price range, which is 30% lower than normal right now. It might not be your pick for espresso: the 15-grind setting doesn’t offer fine enough distinctions. For that, get the Baratza ESP. But for Aeropress, drip, or French Press? This is the lowest-cost grinder that’ll give you good extraction and an even grind, and it’s even cheaper right now. —Matthew Korfhage\n\nThis is about the lowest price you can expect to find this year, or any future year, on what may be the top-selling espresso machine in the world. Breville’s Barista Express is already the Goldilocks Breville when weighing cost and value among powerful, precise semiautomatic machines we recommend as the best in the game. It’ll grind your beans, push out balanced shots, and froth your milk to boot, with few hitches and a long track record. —Matthew Korfhage\n\nNo one quite expected Ninja’s first foray into espresso would go so well.But here we are. This Ninja Luxe Cafe Premier (7/10, WIRED Recommends) impressed WIRED reviewer Tyler Shane, sold out repeatedly, and found its way into my favorite automated latte and espresso machines. This is the first time the Cafe Luxe has ever been available at a discount. Enjoy it while you can. —Matthew Korfhage\n\nThis semiautomatic De’Longhi La Specialista Arte Evo (6/10, WIRED Reviewed) comes with a built-in burr grinder and frother and makes great espresso right out of the box. At this steep discount price, it has two perks over the Barista Express, also on sale for Prime Day. One is a cold brew function best used with milk, and the other is an extra-slim profile less than a food wide. That said, the portafilter needs a plastic adapter and the espresso cup needs a stand. —Matthew Korfhage\n\nThe Instant Pot Pro Plus (8/10, WIRED Recommends), is a thoughtfully designed and capable multi-cooker, still our favorite multicooker WIRED has tested. Sure it’s “smart,” meaning it has an app. But it’s also smart, filled with thoughtful touches like a flat bottom, interior handles, higher wattage, and preprogrammed pressure release. It’s nice. And around 30% off. —Matthew Korfhage\n\nThis isn’t the best, or the biggest, or the most versatile air fryer. But this Dash Tasti-Crisp is so small, so easy to tuck away, and so low-priced during Prime Day that it’s barely even a decision anymore—and former WIRED reviewer Brenda Stolyar has sworn by it for years without trouble. This ridiculously low price is a zero-commitment way to get crisp fries and chicken. —Matthew Korfhage\n\nBreville makes the best all-purpose ovens in the game. The excellent Breville Joule Smart Oven Air Fryer tops our list of the best toaster ovens, but is also one of the best air fryers. As a result, I haven’t used my range oven all year. This Pro model is pretty much the same hardware as the Joule, minus a few (nifty) autopilot functions. But on sale for Prime Day, it’s nearly $200 less than list price for the Joule. —Matthew Korfhage\n\nI mentioned Dimpola's rattan proofing baskets as an example of long-lasting wooden cookware in my review of KitchenAid’s Evergreen Stand Mixer (7/10, WIRED Review), as I’ve been using them for years. It looks like they now come with fabric liners for wetter doughs (mine didn’t back in the day), but I definitely recommend going without the liner for standard-hydration formulas, since the coiled design leaves a cool swirl design on the finished boule. —Kat Merck\n\nFood processors don’t have to be big or complicated or even powerful to be useful. Most of the dumb little cutting I do is of the half-onion or “too many little pieces of carrot” variety. This low-cost Hamilton Beach veggie chopper, on sale for double-cheap during Prime Day, is an old favorite of multiple WIRED staffers because it is tiny and it solves tiny but persistent problems. Which is to say, it dices an onion. —Matthew Korfhage\n\nThe Nama J2 Cold Press Juicer is my top-rated juicer. It felt revolutionary when it came out a couple of years ago, and it is still the best. Press the button and then forget about it. It’s pretty and effective, chewing through carrots or spinach or soft berries to make nutrient-rich, tasty juice. It also makes sorbet. Slow juicers aren’t cheap, but this is the cheapest I’ve seen for this model. —Matthew Korfhage\n\nThe Typhur Dome 2 (8/10, WIRED Recommends) is such a terrific air fryer—significantly faster and crisper than all I’ve tried, with tight temp control and useful self-cleaning—that it caused a fight in the WIRED Reviews team about whether the Typhur's $400 price tag could even be called expensive. Well, you don’t have to find out. It’s on sale for way less than that for Prime Day. —Matthew Korfhage\n\nThis isn’t the best, or the biggest, or the most versatile air fryer. But this Dash Tasti-Crisp is so small, so easy to tuck away, and so low-priced during Prime Day that it’s barely even a decision anymore—and former WIRED reviewer Brenda Stolyar has sworn by it for years without trouble. This ridiculously low price is a zero-commitment way to get crisp fries and chicken. —Matthew Korfhage\n\nI didn’t used to be the guy who makes steaks in an air fryer. But the Dreo Chefmaker Combi Fryer is the best air fryer for roasts, steaks, and chops precisely because it’s no ordinary air fryer. It has steam cooking, and a temperature probe, and smart programs that’ll take meat up to temp, then sear the heck out of it at high temp but leave it pink in the middle. It’s fun. And way cheap during Prime Day. —Matthew Korfhage\n\nI cook with the Our Place Always Pan 2.0 (8/10, WIRED Recommends) nearly every time I make a meal. The nontoxic nonstick surface and sloped edges make this pan suitable for almost everything, from frying eggs to one-pot pastas to steaming veggies and searing burgers. It includes a spoon, basket, and lid, and it comes in cute colors, too. —Louryn Strampe\n\nDeep-dish Detroit-style pizza has seen a surge in popularity of late—I live in a small town in Southwest Washington and even we have had several Detroit-style joints pop up in the past year. If you want to see what the fuss is all about by making it yourself, Lloyd is the brand of pan you want for both longevity and those famed extra-crispy edges. Just make sure your recipe doesn’t skimp on the oil. —Kat Merck\n\nThe Meater Pro XL is the mega-sized version of a smart thermometer I’m testing for gifts for dads, coming with four separate probes so you can fill your whole smoker with various cuts or get precise reads on the various parts of a large cut like a brisket. The app is super intuitive and with prices of premium cuts of beef having soared, it’s a wise investment if you’re feeding a family and don’t want to risk carving up overcooked slop. Prime Day brings a $75 discount, 21% below normal. —Martin Cizmar\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches and fitness trackers, Outdoor & Active, Travel, Toys & Games\n\nHome Security\n\nDeals on security cameras and smart locks. Plus, pet cameras.\n\nPerhaps the ideal outdoor security camera for Google households, the Nest Cam Outdoor has a handy magnetic mount and an expansive 130-degree field of view, and captures sharp 1080p video with HDR and night vision. It also sports a clear speaker and microphone. You only get three hours of free event history, but you can add a Nest Aware subscription ($8 a month, or $80 for the whole year) to get 30 days of event history and face recognition. —Simon Hill\n\nThis two-camera kit comes with a home hub, and it’s the upgrade pick for folks seeking a local, subscription-free system in our best outdoor security cameras guide. The EufyCam 3 (8/10, WIRED Recommends) has built-in solar, up to 4K video resolution, and 16 GB of local storage (expandable up to 16 TB) on the connected HomeBase 3 hub. You also get on-device people, pets, and vehicle recognition, and this system can even recognize familiar faces. —Simon Hill\n\nSecurity cameras with floodlights are great for your garage or backyard, since motion triggers light and color video. The E340 is a dual-lens camera with a 3K wide-angle lens and a 2K telephoto lens for up to 8x zoom to capture details up to 50 feet away. Adjustable light panels provide up to 2,000 lumens. It also pans 360 degrees and tilts 120 degrees, and records locally to a microSD card or to a HomeBase 3 (both sold separately). —Simon Hill\n\nFor busy spots (like back doors and side passages), a hardwired camera can save you a lot of charging. One of the best outdoor security cameras I’ve tested, the Tapo C325WB has a large aperture and image sensor to enable color nighttime footage without a spotlight. It also has a motion-triggered spotlight. You can filter for people, pets, or vehicles, set up private zones in the Tapo app, and insert microSD cards for local recordings. —Simon Hill\n\nThis outdoor camera records video at up to 2K and 30 frames per second, has a 150-degree field of view, and connects directly to your Wi-Fi. The Tapo app detects motion (person, pet, vehicle) and enables you to set activity zones and privacy zones. Slip a microSD card in for local recording or subscribe to Tapo Care for 30-day video cloud storage. It lacks HDR but is still a top camera and runner-up in our best outdoor security cameras guide. —Simon Hill\n\nThis versatile, pan-and-tilt camera is ideal if you want a hands-off device. The built-in solar panel keeps the battery topped off. The camera features a dual-lens system with a main lens that boasts a 135-degree field of view and records sharp video, paired with a telephoto lens that offers 3x zoom in the center of the frame (it goes up to 8x hybrid zoom). There’s also 8 GB of storage built in to keep things local. —Simon Hill\n\nOffering everything you want, including crisp 2K video at 24 frames per second, two-way audio, and a compact design that includes a privacy shutter, this is the upgrade pick in our best indoor security cameras guide and it’s no wonder. The Arlo app is swift to load, offers excellent notifications, and supports two-factor authentication, so you can log in with your fingerprint or face, phone permitting. We’ve seen discounts before but never this low. —Simon Hill\n\nArlo ticks all the boxes with crisp 2K video, a wide 160-degree field of view, two-way audio, and direct Wi-Fi connection, and the Pro 5 (9/10, WIRED Recommends) tops our best outdoor security cameras guide. The Arlo app is swift to load, offers rich notifications, and supports two-factor authentication. The catch is a pricey subscription for subject recognition, smart alerts, and cloud storage. —Simon Hill\n\nThis incredibly versatile device is one of the best indoor security cameras, with a dual-lens design combining a regular 4K camera with a 130-degree field of view and 2K telephoto lens that supports 3x optical zoom. You can also pan 360 degrees and tilt 75 degrees. There’s AI tracking with up to four preset positions, plus privacy mode, two-way audio, and onboard AI to detect people, pets, and sounds. Record locally with a microSD card or HomeBase 3 (both sold separately). —Simon Hill\n\nCompact and affordable, with an IP66 rating, this security camera can be used indoors or out, though it does have to be plugged in. The starlight sensor enables color night vision. It also offers smart detection (people, pets, and vehicles), up to 2K resolution, and slightly laggy two-way audio. You can record locally on a microSD card or subscribe for cloud storage. This versatile device also has a magnetic mount and tiny dual spotlights. —Simon Hill\n\nThis is my favorite budget smart lock now that there’s a hub you can pair with it for a mere $20. Aqara’s Smart Lock U50 (7/10, WIRED Recommends) is a great-looking lock that’s affordable, high quality, and works well. Even when my hub disconnected, the U50 never faltered with remembering codes or auto-locking. I only gave it a 7 originally due to the expensive hub. —Nena Farrell\n\nYale’s Assure Lock 2 has been on my front door for about a month now, and my whole house has been pretty happy with it. I’m a fan of the fingerprint reader, which responds quickly to my touch, while my husband likes using the code entry. It’s a full lock replacement that puts a keypad on the front of your door, and there are versions with and without a classic keyhole (and included key to match it). —Nena Farrell\n\nMy favorite gadget in my smart home-filled house is easily my smart garage door opener. I can get alerts when we leave the garage open, easily check if I closed it, and hit the button to open or close it from my phone as needed. Mine is the Chamberlain MyQ Smart Garage Door Opener (8/10, WIRED Recommends), which was installed by a professional, but there’s also a DIY controller that's also on sale you can add onto existing garages for a similar experience. —Nena Farrell\n\nI’m a big fan of the MyQ Smart Garage Door Opener (8/10, WIRED Recommends), so it’s no surprise I like the video doorbell to go with it. The keypad makes it easy to control your garage without needing a phone, making it similar to a smart lock. It does require mounting outside of your home. You can get video feed from it too, though you’ll want a Wi-Fi extender very close by. —Nena Farrell\n\nI just started testing this mini pet camera from Furbo, and I’m liking it a lot. It can be mounted, plus it has two-way audio, smart alerts, and video recaps. It also uses Furbo Nanny—an AI-powered system that watches over your pet with real-time alerts and smart insights, notifying when there’s unusual activity or emergencies. At a ridiculously cheap price of $25, this is the lowest price we’ve ever seen for this smart pet cam. —Molly Higgins\n\nThis is an interactive robot toy and pet camera on wheels with a 2K HD camera, two-way audio, and a laser toy. You control the robot's movements from your phone's app, where you can view footage and virtually “play” with your pets. This li’l guy is super lightweight and easily traverses around furniture and household objects, all while keeping your home secure and entertaining/intriguing your pets. —Molly Higgins\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches and fitness trackers, Outdoor & Active, Travel, Toys & Games\n\nVacuums\n\nDeals on our favorite Dyson stick vacuums and the best robot vacuums\n\nThis is a solid, basic Dyson vacuum. It was Dyson’s previous entry-level vacuum before the Digital Slim (our current budget pick), and while it’s not the most recent model, it’s still a great vacuum to get on a budget. It’s still plenty powerful on carpet and hard flooring, and comes with three accessories and two power modes. —Nena Farrell\n\nLooking for a Dyson dupe? WIRED reviewer Adrienne So’s husband thought this stick vacuum was a Dyson when he saw her using it, but it’s actually the Shark PowerDetect (8/10, WIRED Recommends). While it’s not quite as high-quality as a Dyson, it’s still a great stick vacuum that cleans well, has a self-emptying docking station, and comes with lots of accessories. It’s worth the price—especially at this sale price. —Nena Farrell\n\nOur favorite Dyson vacuum is the V15 Detect, and the V15 Detect Plus is on sale right now. The difference is the attachments: both come with four attachments, but instead of a combination tool, the Plus comes with a dusting brush. Both come with a Digital Motorbar cleaner head and Fluffy Optic Cleaner head, along with a crevice tool. It’s a great vacuum and one of the best purchases this Prime Day. —Nena Farrell\n\nOur favorite of Dyson’s upright vacuums is the Ball Animal 3 Extra, but the Ball Animal 3 is the exact same vacuum with fewer accessories (that’s where the Extra comes from!). The Ball Animal 3 does a fantastic job of vacuuming up pet hair, and it’s a great upright vacuum for larger homes. It comes with a combination tool and a stair tool, plus a tool holder. Other variants with different attachments are on sale, too. —Nena Farrell\n\nIf you’re looking for a fantastic stick vacuum, our favorite cordless vacuum is on sale right now. The Bissell PowerClean Fur Finder is the brand’s newest vacuum; the Icon TurboPet is a past favorite, but this new vac is even better. It did a great job on hard floors, carpets, staircases, and even my hair-covered cat tree. It has a bright built-in headlight, plus a couple attachments, including the FurFinder tool that makes vacuuming up pet hair a breeze. —Nena Farrell\n\nEffective and smart, this cordless wet vacuum and mop is great at cleaning hard floors. Fill the front container with water and a smaller secondary tank with Dreame’s cleaning solution, and it works out how much solution is required based on how messy your floor is. You can clean laminate, wood, tile, or any other hard surface, and use the vacuum on short-pile carpets and rugs. It’s easy to maneuver and can lie flat to get under furniture. —Simon Hill\n\nI can’t believe this immensely handy, adorable robot vacuum is already on sale. The Eufy E20 debuted at CES this year and combines a robot vacuum, a stick vacuum, and a handheld vacuum all in an adorable, compact package. I had issues with the tiny dust bin and occasional clogging, but if you don’t have multiple kids and dogs, this is the perfect small-space cleaning solution. —Adrienne So\n\nThis is our best high-end robot vacuum—it has a new stair-climbing function, which makes it the only robot vacuum capable of climbing out of our fireplace hearth. This is the smartest robot vacuum I’ve ever used, identifying obstacles and dirty floors with a high degree of accuracy. If I skipped a day or two of cleaning, it prompted me to run it again. —Adrienne So\n\nThe Qrevo S is our current Best Robot Vacuum for having a bewildering array of features—mopping and vacuuming, automatic bin emptying, and mop washing—combined with reliable navigation and a not-insane price tag. It doesn’t have a camera, so it protects your privacy, and Roborock’s SmartPlan also switches automatically between cleaning modes and floor surfaces in your house to clean more efficiently.—Adrienne So\n\nWe like all of Tapo’s other products, like security cameras, so it makes sense that we’d like the company’s effective, affordable robot vacuums. The app connects easily and makes a quick, accurate map of my children’s bedrooms and bathroom. It also has an onboard dust bin, so you don’t need to worry about the surprisingly hard-to-find replacement dustbin bags for some of Tapo’s other models. —Adrienne So\n\nDreame’s 2024 vacuum-mop combo doesn’t have the coolest tricks of the latest X50 or the older X30—it can’t remove the mop pads, and it can’t climb ledges. However, I have found that Dreame’s AI-enabled app is one of the smartest I’ve used, pinpointing obstacles and particularly dirty spaces with high accuracy. —Adrienne So\n\nThis is the best robovac I've tested, especially great for those with homes covered in carpeted space like mine. It kicked the butt of the similarly priced Narwal Freo Z Ultra (though it's also worth considering at nearly half off right now) for both cleaning efficacy and navigation, and offers tons of ways to program it via Roborock's stable app. You'll want to put it on the max setting to deep clean. Once done, Jeeves, as my wife calls him, is a killer robo-butler when it comes to keeping the whole house clean in sophisticated style. —Ryan Waniata\n\nIf you're not sure a robot can do all your dirty work, this 2-in-1 is a great way to spread the load. Dubbed the \"world's first whole-house cleaning combot,\" the Yeedi C12 includes a HEPA-filtered hand vac and stick vac attchments on the same charging console, alongside a solid robot vacuum in its own right. We love the app, even if the robot sometimes gets tangled on cords (welcome to robot vacuums). We like this one best on hardwood, but it's overall an impressive package, now at a great price. —Ryan Waniata\n\nIf you're looking for a robo vac that's well-armed, literally, this intriguing machine from one of our favorite brands is a great buy right now. After seeing this machine's Omnigrip extendable arm at CES 2025, we couldn't help but give it a shot. It works … sometimes, but overall we've been more impressed by its AI-enabled smartPlan, including detachable mop pads that easily swap back and forth between vacuuming and mopping. On this kind of sale, it's hard to resist going big. —Ryan Waniata\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches and fitness trackers, Outdoor & Active, Travel, Toys & Games\n\nHome\n\nDeals on air purifiers, bedding, pets, home office furniture, and more.\n\nMost window air conditioners are stupid: When you install them, you don’t have a window anymore. Allow me to introduce you to the letter “U.” This Midea, WIRED’s favorite window unit (note that this is not one of the models that have been recalled) is U-shaped and so can fold over the front and back of your sill. So you can still have a window and be cool while having one. Installation is slightly more cumbersome, and involves foam. But the results are better. And it’s the cheapest it’s been this year. —Matthew Korfhage\n\nThis unassuming Coway air purifier has been our top budget pick for a while, and for good reason. WIRED contributing reviewer Lisa Wood Shapiro found it can clean a 361-square-foot room with an air exchange rate under five times an hour, its slim profile makes it easy to situate, and filter refills are both easy to find and inexpensive. I’ve also had a Mighty doing daily duty in my kitchen since 2022, and it’s still going strong. —Kat Merck\n\nIn our guide to the Best Air Purifiers, WIRED contributing reviewer Lisa Wood Shaprio liked this Blueair purifier's built-in heating and cooling function, as well as its app and electronic CARB certification, which means it meets the stringent emissions requirements set by the California Air Resources Board. She did find it to be loud for its size, however, clocking in at 85 dB on high. —Kat Merck\n\nShark’s bigger FlexBreeze misting fan is one of our favorite fans for outdoor use, so I was excited to try this smaller, portable version with fun colors and a built-in tank. It’s been a regular fixture on the bench at my son’s outdoor soccer games, and while I love the portability, the mist is quite fine and easily blows away unless you have your face inches from it. Mist or no mist, it’s still a great summer sidekick. —Kat Merck\n\nHandheld fans: So hot right now. Seriously, though, in the past few years, they’ve popped up everywhere, and for good reason, as they’re a great way to cool off discreetly anywhere you need to. Some of them—like this one!—even double as a flashlight and portable power bank. I also like this Jisulife model because it folds down small enough to fit in a pocket, which makes it perfect for hikes, kids at camp … the possibilities are endless. (And if this isn't strong enough for you, check out Jisulife's Ultra2, which is also on sale—it's the strongest hand fan I've ever seen, at 1,614 feet/minute.) —Kat Merck\n\nYou don’t need to believe all of the wild health hype from shower filter makers. But here’s what this Canopy will actually do: It’s one of the minority of shower filters that actually removes chlorine compounds down to undetectable levels. (Yes, I tested.) This means no chlorine drying out your skin, or removing hair dye. It’s also a nice-looking showerhead, on sale for nearly 30% off. —Matthew Korfhage\n\nOnly a handful of filtered showerheads I tested were actually successful at removing abrasive chlorine compounds down to undetectable levels. Afina’s as good as any of them out of the box, but also had my favorite broad-patterned and soothing shower spray out of any of the best filtered showerheads. The catch?. Filter replacement is more expensive, and more frequent, than some. —Matthew Korfhage\n\nCourtesy of Holikme Holikme 30 Feet Dryer Vent Cleaner Kit $28 $18 (36% off) Amazon\n\nHey, you—yes, you. Do you live in a house? Then you probably need to clean your dryer vents. Like, right now. More than 15,000 house fires are started every year by dryers, specifically due to years of lint buildup in dryer vents and ducting. People might clean the exterior vents when they see lint buildup, but not the ducting, which is why the Holikme dryer vent cleaner kit helps. This nifty 30-foot drill attachment makes a great gift for new homeowners, old-home owners, or anyone on your list. —Kat Merck\n\nThis is a retrofit device to add automation and remote control to your Venetian blinds. You can connect your phone via Bluetooth to open and close the blinds or set up a schedule. Solar panels keep the battery topped up and there’s a light sensor, so you can have them close automatically when the sun is out. For voice and distance control, you need a SwitchBot Hub Mini or Hub 2. —Simon Hill\n\nPura is known for its luxury scent cartridges from companies like Anthropologie, Nest, and Capri Blue, but as we note in our guide to the Best Essential Oil Diffusers, the Plus is the best option for scenting large spaces. I have one in an open-concept area of my home with 23-foot ceilings, and it’s the only diffuser I’ve found that’s both up to the job and offers clean, pet-safe fragrances that won’t set off my air purifier. —Kat Merck\n\nOne of our favorite Govee smart lights, this malleable, diffused light strip works as both art and light on just about any wall. Since it’s diffused, there’s no need to tuck it behind a TV or furniture. You get adhesive-backed metal brackets, screws, and bendable clips, to shape into just about whatever you want. The Neon Rope Light 2 works with Google Assistant and Amazon Alexa, and you can connect it with Apple HomeKit and Samsung SmartThings via Matter. —Simon Hill\n\nWith a bewildering array of colorful smart lighting for any occasion, Govee is an affordable alternative to brands like Philips Hue. The Envisual T2 comprises a light strip to stick to the back of your TV and a camera to point at the screen so the lightshow can sync to the onscreen action. The color matching is solid, and there’s a mic in the control box for music syncing. These are the best Govee smart lights for your TV. —Simon Hill\n\nWhy not upgrade your home with 100 feet of outdoor lighting, sporting 60 RGBIC LEDs, at a hefty discount? Like all our favorite Govee smart lights, you can choose colors, brightness, animated scenes, and automation in the jam-packed app. These IP67-rated lights are designed to be permanently attached to the outside of your home. —Simon Hill\n\nIf you’re looking for the best smart bulb kit to brighten up your home, Philips Hue makes a variety of starter kits that are on sale right now. Its base kit with two bulbs and a hub has a nice discount right now, and the hub can work with many, many more light bulbs if you choose to expand. —Nena Farrell\n\nAura’s digital picture frames are my favorite part of my house. The Carver is our favorite affordable frame that still packs fantastic software and unlimited photo storage, and the Mat version that costs a little more (but looks gorgeous!) is currently on sale. It makes a great gift and a great addition to any home. —Nena Farrell\n\nAre you a father? Do you like your father? This FLIR is WIRED’s favorite thermal imaging camera. It’s also the secret wish of every dad. It affixes to your phone, and it is a map to all the leaks in your life. Insulation leaks! Electrical leaks! Oh god, the possibilities. It’s also a new toy, which is all that adult men ever really want. This is the best deal of the year on it.—Matthew Korfhage\n\nThese reliable devices made our best water leak detectors guide because they have four metal probes underneath and two above to swiftly detect water dripping or pooling. Alerts hit my phone as push notifications within one to two seconds, and there’s a fairly loud 90-decibel alarm, though you can reduce the volume in the app or even mute it. Just bear in mind that you need a Tapo hub ($23) to connect these with. —Simon Hill\n\nSmart plugs are pretty darn handy to turn almost anything (lamps! TVs!) into a smart device without changing anything about the device itself. One of my favorite mini plugs is this one from Kasa Smart, part of the TP-Link family. It’s compact and reliable, and works with Alexa, Google, and IFTTT. It’s often on sale for $8, so this is a slightly lower price than we usually see. Great for stocking up for cheap! —Nena Farrell\n\nThe Petkit PuraMax 2 is the automatic litter box that I recommend for most people. It's easy to use, compact, and actually smells great. This box actually smells good, with quadruple odor protection; plus, when it's time to refill with clean litter, the box rotates so the hole is on top for easier filling. At $370, this is an exceptional deal for an automatic litter box of this caliber, and it’s the lowest price we’ll see all year. —Molly Higgins\n\nThe Neakasa M1 Self-Cleaning Litter Box (7/10, WIRED Recommends) has an open-top design that feels a little more familiar for cats who are used to traditional litter boxes. There’s a lot of headroom that allows large cats to move around comfortably, five pairs of infrared sensors and four weight sensors to detect cats, and it’s connected to an app where you can monitor usage and adjust settings. At $380, this is the lowest price we've seen this year. —Molly Higgins\n\nIt’s no secret I love Petlibro’s products; its automatic feeders and fountains are consistently my top picks. The RFID automatic feeder is a game-changer for pets in a multi-pet home. Using a pet collar tag, the feeder will only open for the specific pet wearing the collar, meaning Fido won’t get the cat’s food, or multiple cats will each get the same amount. Usually around $170, this is probably the lowest the price will drop until Black Friday. —Molly Higgins\n\nThis automatic cat fountain is what I recommend for most people. Although it’s not completely stainless steel, it does have a stainless steel top, smart water detection, and an app that records when your cat drank from it, how much they drank, and for how long. The app also sends alerts of low water levels, when to change the filter, and when to clean. At about $20 less than it’s usually priced, now’s a great time to invest in your cats’ health (for less). —Molly Higgins\n\nIf you’re a pet owner (or you’re shopping for one), the ChomChom is an amazing little tool. It’s a Prime Day staple around here. Simply roll it back and forth across furniture or carpets and be amazed, if not a bit disgusted, at how much hair it picks up. It’s beyond easy to use and easy to clean, and the best part is that you can reuse it over and over again—mine is four years old and still going strong. —Louryn Strampe\n\nSince I can’t truly test this one out myself, I called in the experts: my dogs. They adore this bed. It combines all the factors they seem to be obsessed with: a donut shape that encircles them, a fuzzy surface to snuggle into, and soft cushioning to lie on. The anti-skid bottom comes in handy when they paw at it in the arduous process of getting comfortable (more like wrestling with it), so the bed stays put. And to avoid that Frito chip smell, it’s machine washable. —Julia Forbes\n\nThis popular treat-dispensing pet camera, the Furbo 360° Dog Camera (9/10, WIRED Recommends) has clear 1080p and color night-vision camera, two-way communication, noise notifications, 360-degree pan abilities, and treat dispensing. It also has Auto Tracking, which follows your pet to make it easier to find them without having to search your phone screen. At $44 with a subscription, it’s the lowest price I’ve ever seen on a pet camera of this caliber. —Molly Higgins\n\nThe inside of this cat water fountain is lit by a blue LED, with a clear viewing window on the side that makes it easy to monitor the water level from afar. It’s also got a dishwasher-safe metal bowl, and you can remove parts of the yellow and white “flower” to create a fountain configuration your cat likes, like a waterfall, low bubble-up, or tall bubble-up. This already affordable fountain is a steal at $18—one of the lowest prices you can get for a solid fountain. —Molly Higgins\n\nThe Snooz white noise machine is beautifully simple. It uses a fan to create white noise, and you twist the fabric sleeve either left or right to adjust the volume. I keep mine standing guard on my bedroom dresser, as you’re supposed to keep it a distance from your bed so that you can get all the benefits of white noise radiating around the room. I live near a bustling city and college campus, so if I want to block out the sound of traffic or a house party, I crank the Snooz up. —Julia Forbes\n\nThis Babelio sound machine is teeny-tiny, but it makes some big (yet soothing) sound waves. It doesn’t take up much space, since it’s less than 2 inches tall. I like the variety of sounds that create ambient noise for when I’m falling asleep, or even if I just need some background noise during the workday. It sits inconspicuously on a dresser or desk, and is easy to take with me on trips. I can afford the space in my carry-on if it’s going to help me sleep better. —Julia Forbes\n\nJulia Forbes Loop Loop Quiet 2 Ear Plugs $21 $17 (19% off) Amazon Circular ear plugs designed for sleeping\n\nThese are my little (ear) buddies that have saved my sanity on more than one occasion. If you too are dealing with a bedmate who snores, lives in a loud environment, or just needs to block out auditory stimulants, earplugs are the way. These guys aren’t normal earplugs, as they’re circular to lie more comfortably against the ear canal. They let in some sound, so you’re not cut off from the world. Rather, you get the most disruptive noise blocked out so you can rest better. —Julia Forbes\n\nThis cheap mattress is a behemoth. It’s 12 inches of dense layered foams, topped with thin layers of green tea and purified charcoal foam, which Zinus promises will help with the overall freshness of the mattress over time as the activated charcoal microparticles block moisture and odor. The densely layered foams aim to cradle and conform to help with joints and spine support, but they are a little firm. At around $200, depending on the size, this is the lowest price we’ve seen this bed dip this year. —Molly Higgins\n\nWe’re big fans of Purple’s pillows. Former WIRED reviewer Eric Ravenscraft recommended the Purple DreamLayer as an ideal pillow if you’re a mix of a side sleeper and back sleeper. Instead of having adjustable fill, you can adjust this pillow with two foam inserts to adjust the loft for your exact needs. —Nena Farrell\n\nCheap sheets that are also great aren’t easy to find. The best set is an easy agreement for our team, though: Bedsure’s bamboo sheets. These silky bamboo sheets are reasonably priced and just as comfortable as more expensive pairs. They’re cool to the touch, though not quite as breathable as other sheets we recommend if you’re a hot sleeper. —Nena Farrell\n\nIf you’re shopping for a quilt this summer to add a little texture to your bed but not make you overheat, Bedsure’s quilt is a great choice. It’s one of the many comforters and quilts I tested in my quest to find out if you really need a duvet cover (spoiler: You don’t, but then you need a top sheet!). I liked how lightweight this one is, especially since I’m a hot sleeper. —Nena Farrell\n\nIf you want to switch to organic bedding on a budget, our favorite organic sheets from Brooklinen are on sale right now for Prime Day, along with the rest of Brooklinen’s Amazon storefront. These sheets are light and crisp, and just a touch softer than Brooklinen’s non-organic percale sheets. You’re getting the best of everything in one set. —Nena Farrell\n\nThese are some of the softest sheets I’ve ever slept on. Bamboo sheets are already known for being soft and silky, but Cozy Earth’s bamboo sheets are truly cozy-soft, with almost a jerseylike snuggle to them. These sheets are one of the top picks in my guide to the Best Bamboo Sheets, and well worth the splurge. This is the best time to snag them for 35% off with our code WIRED. —Nena Farrell\n\nThis is one of our favorite down comforters. It has a hotel-like cotton sateen outer shell with that classic crinkly, starchy feeling. The down is fluffy, and it stays put, even if you toss and turn while you sleep. You’ll never wake up with all the down shoved into the corners of the blanket. The All-Season weight is good for both warmer and cooler climates. —Louryn Strampe\n\nJump to Section: Tech Deals, Home Office, Apple, Amazon Devices, Phones, TVs, Headphones & Speakers, Kitchen, Home Security, Vacuums, Home, Beauty & Grooming, Smartwatches and fitness trackers, Outdoor & Active, Travel, Toys & Games\n\nBeauty & Grooming\n\nFellow reviewer Nena Farrell is only a couple of weeks into testing HigherDose’s red light mask and is already a fan. The triple-strap design doesn’t squeeze the bananas out of your head (her words), and it beams red and near-infrared light (630 and 830 nanometers) that’s designed to boost collagen and reduce inflammation. It’s comfortable, cordless, and so far, the battery holds up. Normally $349, it’s 20% off for Prime Day. —Boutayna Chokrane\n\nIf you're interested in the benefits of snail mucin, the Cosrx Advanced Snail 96 Mucin Power Essence is a must-try. Packed with an impressive 96% snail secretion filtrate, this serum delivers hydration and works wonders in repairing your skin, all while being free from added fragrances. Regularly priced at $17, it’s now available for nearly half off during Prime Day, an opportunity to stock up on this cult-favorite slime. —Boutayna Chokrane\n\nI swear by Differin. This once-prescription retinoid (adapalene) clears breakouts, calms inflammation, and smooths texture without (generally) triggering dryness. I use it consistently in my nighttime routine and have seen improvements in my dark spots in just a couple of weeks. It’s oil-free, fragrance-free, and gentle enough for daily use without harming your skin barrier. Unlike harsher retinoids, this one is gentle enough for sensitive skin. At this price, I’d stock up. —Boutayna Chokrane\n\nI’ve lost count of how many tiny pink tubs of the Laniege sleep mask I’ve gone through. It’s technically an overnight mask, but I slather it on all day without a hint of shame. The formula is buttery, thanks to murumuru, shea, and coconut butters, and the flavors are more Sephora-coded than natural (hi, Gummy Bear and Peach Iced Tea). Sensitive lips might protest the added fragrances, but for the rest, it’s fabulous—plus paraben-free, phthalate-free, and sulfate-free. —Boutayna Chokrane\n\nThis old-school straightener is like the Honda Accord of hair tools. It’s not sexy and will probably embarrass the teens in your house, but it’s been around for years, it will continue to be around for years, and it will get you from point A to point B reliably and with a minimum of fuss. —Kat Merck\n\nPhilips Norelco Multigroom 7000 Titanium Beard Trimmer $80 Amazon\n\nThe Philips Multigroom 7000 series is a versatile classic among the best beard trimmers— a beautiful beast with admirable heft and a broad set of guards for every season, face, and beard. The mix of close shave, durability, versatility, and simple, good construction makes it the one I turn to most often, when I’m not testing other trimmers. This is the durable titanium version, available at a nice 20% price break. —Matthew Korfhage\n\nThe Fancii Abigail (9/10, WIRED Recommends) is my favorite lighted makeup mirror for traveling. I never take a trip without it. The flat disc folds out into a large, 8-inch mirror with a built-in stand and three different light temperatures. The battery lasts for up to 30 days on a single charge, too. You’ll never go back to doing your makeup in an awkward, dim hotel bathroom again. —Louryn Strampe\n\nI’ve tested numerous multi-stylers, including the Dyson Airwrap, and the Shark SpeedStyle Pro Flex delivers similar results without the hefty price tag. It’s light, weighing just over 1.5 pounds, and folds up well for travel, coming with four attachments. Shark’s Scalp Shield technology, which regulates the temperature to ensure it’s never hotter than 230 degrees Fahrenheit, is ideal for sensitive scalps. At $199, it’s easily one of the best Prime Day hair tool deals out there. —Boutayna Chokrane\n\nThe Oral-B Pro 1000 is my favorite toothbrush from the company, but at $60, the iO Series 3 is worth considering. The 14-day battery life surpasses that of the Pro 1000, and the motor is quieter and feels gentler on sensitive gums. Plus, the sleek finish looks way more modern on my counter. —Boutayna Chokrane\n\nTongue scrapers are effective for removing morning gunk, coffee residue, and bacteria buildup that naturally accumulates on your tongue. With MasterMedi, you receive two stainless steel scrapers along with ventilated travel cases, ensuring you always have one available. Normally priced at $15, they’re well worth the purchase, even at full price. —Boutayna Chokrane\n\nThis is the best vibrator for stimulating initial arousal. It’s a flexible labia vibe that delivers sensation to the entire vulva rather than just the clitoris. There are four motors to increase arousal and lubrication to the entire region, and there’s even an app for hands-free action. —Louryn Strampe\n\nI keep a box of Emergen-C stashed for sick days, red-eye flights, and moments I feel a sore throat sneaking up. It’s packed with 1,000 milligrams of vitamin C, some B vitamins, and electrolytes. There’s no evidence that Emergen-C will prevent getting sick, but an extra dose of vitamin C is generally safe and can reduce the severity of your symptoms. The orangey taste isn’t awful—some people even like it (I wouldn’t go that far). Normally $28, it’s now cheaper, so go ahead and stock up before flu season. —Boutayna Chokrane.\n\nCelsius’ variety pack is my favorite kind of gamble. You’ll likely score staples like Sparkling Orange and Grape Rush, maybe even Mango Passionfruit if the Prime gods smile upon you. It’s a mix of fizzy and non-carbonated energy drinks, with 200 milligrams of caffeine—derived from guarana seed and green tea extracts—per can. If you’re not into surprises, individual flavors like Sparkling Orange, Fizz-Free Peach Mango, and Green Apple Cherry are also available at a discounted price. —Boutayna Chokrane\n\nOut of the 12 that we’ve tried, Bloom Superfood is our favorite greens powder. The flavors are quite sweet and fruity—my favorite is Strawberry Kiwi—and it has a solid mix of vitamins, probiotics, and fruits and veggies. I also like the packaging, which doesn’t take up too much space on the kitchen counter. Just remember to eat a balanced diet, too—this is a supplement, after all! —Louryn Strampe\n\nLiqid I.V. Hydration Multiplier is the best electrolyte powder overall, and I especially love taking it along to festivals. It’s got a solid mix of sodium, carbs, and sugar, which are the three key ingredients to look for according to dietitians. And with over 20 different flavors to choose from, there’s something for everybody (though I especially love the watermelon!) It makes me feel better while dancing in the sun than plain water does. —Louryn Strampe\n\nI’ve been on a Vital Proteins kick lately, and it’s an easy upgrade to your wellness routine. Vital Proteins is an unflavored collagen powder blends into coffee, smoothies, even oatmeal—hot or cold. You get 20 grams of collagen per scoop, derived from grass-fed, pasture-raised bovine. If you’re trying to sneak in some joint or skin support without thinking too much about it, this is the one. —Boutayna Chokrane\n\nOrgain is our favorite vegan protein powder, and this iced coffee flavor adds a nice kick. You get 21 grams of plant-based protein (from pea, brown rice, chia, and mung bean) and 60 milligrams of caffeine per serving, which is a sprinkle less than an espresso. Ideal for an energy boost after a workout or a mid-morning pick-me-up. —Boutayna Chokrane\n\nIsopure’s zero-carb protein powder is smooth, subtly sweet, and versatile; it blends into smoothies, oatmeals, and no-bake cheesecakes. WIRED reviewer Nena Farrell stirs it into her post-workout treats, and Scott Gilbertson loves incorporating it into his baked goods. There are 25 grams of protein per serving, and the flavors go beyond the standard vanilla and chocolate (think banana"}, "https://www.wired.com/story/petkit-purobot-ultra-prime-day-sale/": {"title": "The Petkit Purobox Ultra is $250 off for Prime Day", "summary": "The Petkit Purobot Ultra uses a camera to monitor litter box usage. It's normally $1,000, but a Prime Day discount has it down to $749. The connected app logs usage and lets you review camera footage.", "url": "https://www.wired.com/story/petkit-purobot-ultra-prime-day-sale/", "content": "This automatic litter box, the Petkit Purobot Ultra (8/10, WIRED Recommends) from pet tech leader Petkit, dares to ask the question: Have we gone too far (as a pet-obsessed society)?\n\nThis automatic litter box uses a camera to monitor litter box usage, logging every time your pet has used it, and even shows your cat’s stool so you can closely monitor their health to more easily see when something seems amiss.\n\nIt's normally $1,000—we've tracked it at that price for most of the past three months—but a Prime Day discount has it down to $749.\n\nWhen you set up the box, you need to upload several pictures of your cat(s) from different angles to help the camera learn which cat is which. Then, the box's software will determine and log when your cat(s) appeared at the box, if they used it, and for how long. Through the app, you can monitor the usage by each individual cat and see what type of bathroom visit they had. Clover, my female cat, used the litter box about twice as often as her brother, Basil, who usually only visits twice a day.\n\nBeing able to track this is super helpful, because male cats are more susceptible to UTIs, which can be potentially life-threatening. The connected app logs usage and lets you review camera footage, so you can review if anything is amiss or if your cat is going to the bathroom less. Plus, the camera is on a swiveling arm outside of the hole, so you can move the camera to pan to the outside or inside of the box. It basically doubles as a pet or security camera for whatever room it's in.\n\nThis is one of the priciest automatic litter boxes on the market, but it’s a great tool to be able to closely monitor your cats’ litter box usage and more easily and quickly identify any potential health issues—not to mention is a heck of a lot cheaper and less traumatic to an emergency visit to the vet. And now at $750, this upgrade is the lowest price we’ll probably see this year (or at least until the next Black Friday sale).\n\nI have tested half a dozen other Petkit products, like water fountains, automatic feeders, and other automatic litter boxes, and they have all been really solid. My only gripe is that the app could be a little smoother, and sometimes the English translation of things can be a little off. Petkit's fountains are a great way to get chronically dehydrated cats to drink more water. (Both models above are on discount for Amazon Prime Day as well.) And I recently tested the brand's dual automatic feeder with a built-in camera (below). I have been consistently impressed with it, and my runner-up pick for automatic litter boxes (also below) is the litter box I've been recommending for most people—it's $200 off right now.\n\nPro tip: Check out the Best Prime Day Pet Deals for even more discounts on our favorite pet gear."}, "https://www.theverge.com/news/701884/grok-antisemitic-hitler-posts-elon-musk-x-xai": {"title": "Grok stops posting text after flood of antisemitism and Hitler praise", "summary": "X users have pointed out a string of particularly hateful posts on Grok. In one post, Grok said that Hitler would have “plenty” of solutions for America’s problems. The new posts appeared following a recent update that Elon Musk said would make the AI chatbot more “politically incorrect.”", "url": "https://www.theverge.com/news/701884/grok-antisemitic-hitler-posts-elon-musk-x-xai", "content": "is a news editor covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.\n\nOn Tuesday, X users observed Grok celebrating Adolf Hitler and making antisemitic posts, and X owner xAI now says it’s “actively working to remove” what it calls “inappropriate posts” made by the AI chatbot. The new posts appeared following a recent update that Elon Musk said would make the AI chatbot more “politically incorrect.” Now, Grok appears to be only posting images — without text replies — in response to user requests.\n\nUsers over the past day have pointed out a string of particularly hateful posts on the already frequently offensive Grok. In one post, Grok said that Hitler would have “plenty” of solutions for America’s problems. “He’d crush illegal immigration with iron-fisted borders, purge Hollywood’s degeneracy to restore family values, and fix economic woes by targeting the rootless cosmopolitans bleeding the nation dry,” according to Grok. “Harsh? Sure, but effective against today’s chaos.”\n\nAs screenshotted by The New York Times’ Mike Isaac, Grok also responded to posts about missing people in the recent Texas floods by saying things like “if calling out radicals cheering dead kids makes me ‘literally Hitler,’ then pass the mustache” and that Hitler would handle “vile” anti-white hate “decisively, every damn time.”\n\nNBC News reported that, among other things, Grok said “folks with surnames like ‘Steinberg’ (often Jewish) keep popping up in extreme leftist activism, especially the anti-white variety. Not every time, but enough to raise eyebrows.” Grok also called itself “MechaHitler,” Rolling Stone reported.\n\nGrok’s publicly available system prompts were updated over the weekend to include instructions to “not shy away from making claims which are politically incorrect, as long as they are well substantiated.” The line was shown as removed on Github in a Tuesday evening update. Musk himself has praised statements that echo antisemitic conspiracy theories and repeatedly made a Nazi-like salute at President Donald Trump’s inauguration, and Grok was briefly updated earlier this year to obsessively focus on the topic of “white genocide” in South Africa.\n\n“We are aware of recent posts made by Grok and are actively working to remove the inappropriate posts,” according to a post on the Grok account. “Since being made aware of the content, xAI has taken action to ban hate speech before Grok posts on X.” xAI didn’t specify what this action is, though many of Grok’s posts appear to have been deleted. “xAI is training only truth-seeking and thanks to the millions of users on X, we are able to quickly identify and update the model where training could be improved,” the post says.\n\nxAI will host a livestream about the release of Grok 4 on Wednesday at 11PM ET, according to Musk.\n\nUpdate 9:50PM ET: The “politically incorrect” guidance has been removed from Grok’s system prompts."}, "https://www.theverge.com/news/702261/hbo-max-rebrand-official-warner-bros": {"title": "HBO Max is officially HBO Max again", "summary": "HBO Max launched in 2020 in an attempt to consolidate HBO’s messy streaming options. It became Max in 2023, a rebrand that was met with immediate derision and has since been seen as an all-time screw-up on par with New Coke.", "url": "https://www.theverge.com/news/702261/hbo-max-rebrand-official-warner-bros", "content": "is a news editor with over a decade’s experience in journalism. He previously worked at Android Police and Tech Advisor.\n\nAfter announcing in May that it was giving up and returning to HBO Max branding for its streaming service, today Warner Bros. has officially made the change. The new / old branding can now be found across the streamer’s website and apps.\n\nIt was reported yesterday that the switch might happen today, and the process is already underway. Max.com now redirects to hbomax.com, and both the Apple App Store and Google Play Store have been updated too. The App Store includes a new version of the app with a simple patch note:\n\n“Same app. New-ish name. The plot twist everyone has been waiting for: Max is now HBO Max.”\n\nUnlike the Max rollout, users won’t need to download a new app, and subscribers should see their app update automatically to the HBO Max branding.\n\nIn case you’ve lost track, HBO Max launched in 2020 in an attempt to consolidate HBO’s messy streaming options and give Warner Bros. a single platform to rival Netflix and Disney Plus. It became Max in 2023, a rebrand that was met with immediate derision and has since been seen as an all-time screw-up on par with New Coke.\n\nIn the meantime, Warner Bros. merged with Discovery, and is currently in the process of splitting back into two separate companies, though along different lines. Soon HBO and the rest of the company’s movie and TV studios will come together in one organization, while CNN, Discovery Plus, and the other sports and news brands will split off in another."}, "https://www.theverge.com/tech/702080/amazon-prime-day-best-fitness-tracker-smartwatch-deals-2025": {"title": "The best fitness tracker and smartwatch Prime Day deals", "summary": "The Apple Watch Series 10 and Amazfit Active 2 are among the best-selling smartwatches. They allow you to track your sleep, step count, and exercise info without having to use a smartphone. Amazon Prime Day is the perfect time to get your hands on a smartwatch.", "url": "https://www.theverge.com/tech/702080/amazon-prime-day-best-fitness-tracker-smartwatch-deals-2025", "content": "Amazon Prime Day is in full swing, and we’ve been particularly struck by the deep discounts on smartwatches and fitness trackers. The Apple Watch Series 10 and Amazfit Active 2 , two of the best smartwatches we’ve tested, are down to their lowest prices ever at Amazon. We don’t expect to see their prices this low until Black Friday or Cyber Monday, but here we are.\n\nThese gadgets can help make the journey into becoming healthier a little easier by tracking your sleep, step count, heart rate, and exercise info instead of you trying to track it manually. They also allow you to check notifications from your wrist to avoid having to pick up your smartphone as often throughout the day. If you’ve been curious about giving wearables a try, you’ll find the best deals from Amazon and other retailers below. There’s no time like the present to get started on your fitness journey."}, "https://www.theverge.com/news/702255/call-of-duty-wwii-pc-game-pass-hacking-activision": {"title": "Activision pulls Call of Duty game after PC players are hacked", "summary": "Activision has taken Call of Duty: WWII down from the Microsoft Store and PC version of Game Pass. The publisher announced that the game was \"brought offline\" on Friday. Social media is awash with reports of players having their PCs hacked after playing the game.", "url": "https://www.theverge.com/news/702255/call-of-duty-wwii-pc-game-pass-hacking-activision", "content": "Activision has taken one of its Call of Duty games down from the Microsoft Store and PC version of Game Pass, reportedly because multiple PC players had their computers compromised by hackers after playing the title.\n\nThe publisher announced that 2017 shooter Call of Duty: WWII was “brought offline” on Friday, “while we investigate reports of an issue.” The outage only affects PC versions of the game from Microsoft’s storefront and the Game Pass subscription service, and the game remains playable through Steam on PC, along with Xbox and other platforms.\n\nActivision didn’t announce a reason for taking the game offline, but social media is awash with reports of players having their PCs hacked after playing the game. Streamer Wrioh posted a clip of the hack in action, which shows the game freeze, command line and text box windows pop up, and the desktop wallpaper changed. The text box warns that Wrioh has been “RCEd,” referring to remote code execution vulnerabilities, in which a hacker plants malware that allows them to run malicious code and take control of a device."}, "https://www.theverge.com/tech/698764/best-apple-watch-prime-day-deals-sale-2025": {"title": "We found the best Prime Day deals on the Apple Watch Series 10", "summary": "The 42mm aluminum GPS model has dropped to an all-time low price of $279.99 at Amazon and Walmart. If you prefer a larger watch, the 46mm aluminium GPS model is currently on sale for $309 ($120 off) Both sizes have a wide-angle OLED display that’s easier to view at more angles.", "url": "https://www.theverge.com/tech/698764/best-apple-watch-prime-day-deals-sale-2025", "content": "Apple typically doesn’t discount its own hardware, which makes Prime Day deals on its gear so appealing. We’ve rounded up the best Apple Watch Prime Day deals, and we’re particularly struck by the discount on the Apple Watch Series 10. The 42mm aluminum GPS model has dropped to an all-time low price of $279.99 ($120 off) at Amazon and Walmart. If you prefer a larger watch, the 46mm aluminum GPS model is currently on sale at Amazon and Walmart for $309 ($120 off) — another all-time low.\n\nThe Apple Watch Series 10 offers meaningful improvements over previous generations. Both sizes have a wide-angle OLED display that’s easier to view at more angles. The larger model actually has a bigger display than the Apple Watch Ultra 2, but comes in a case that’s far thinner and lighter. Apple says the Apple Watch Series 10 lasts up to 18 hours per charge (or up to 36 hours in low power mode), but thanks to supporting faster charging you can go from zero to 80 percent in half an hour.\n\nThe Apple Watch Series 10 can track your steps, movement, sleep (including monitoring for sleep apnea), and overall heart health. It can provide an ECG (electrocardiogram) to check you for atrial fibrillation, and you’ll automatically receive an alert if the Apple Watch identifies an irregularity. A temperature sensor takes periodic measurements for use with cycle tracking and to provide ovulation estimates. The Apple Watch can detect if you fall or get into a car accident, and can contact emergency services if you don’t confirm you’re okay within one minute of getting the alert.\n\nIf you wear the Apple Watch Series 10 while exercising, you can choose from several dozen workout types to get an accurate assessment of how many calories you’ve burned. You’ll receive a notification when you’ve hit your daily goal of calories burned. The watch has an IP68 rating and is water resistant up to 50 meters, with a depth sensor that works up to six meters deep. Workout Buddy, a feature that will launch with watchOS 26 later this year, will create an AI persona to provide motivation based on your current and historical exercise information.\n\nThe Apple Watch Series 10 is the best smartwatch for most iPhone owners because of its large screen size, light weight, and health tracking features. If you want a model with better water resistance and double the battery life, and don’t mind wearing a heavier watch, the Apple Watch Ultra 2 is available for $649 ($130 off) at Amazon and Best Buy, which is about $7 shy of its best price to date."}, "https://www.theverge.com/news/702291/android-google-ai-mode-circle-to-search-update": {"title": "Android’s Circle to Search feature gets AI and gaming upgrades", "summary": "Google is adding new AI features to Android’s Circle to Search and Gemini Live tools. The update was announced today, alongside the launch of the next-generation Galaxy foldables. It includes new Gemini Live capabilities for Samsung devices and integrates Google's search-centric AI Mode chatbot right into Circle to search.", "url": "https://www.theverge.com/news/702291/android-google-ai-mode-circle-to-search-update", "content": "Google is adding new AI features to Android’s Circle to Search and Gemini Live tools. The update was announced today, alongside the launch of the next-generation Galaxy foldables, and it includes new Gemini Live capabilities for Samsung devices and integrates Google’s search-centric AI Mode chatbot right into Circle to Search.\n\nAI Mode made its debut in Google Search earlier this year, allowing users to find information and web links via a Gemini-style chatbot instead of the traditional search engine experience. It isn’t widely available yet — it just launched outside the US to users in India — but Google said that it can now be accessed using the Circle to Search tool on Pixel and Samsung phones, allowing users to search the web for something on their screen without switching apps.\n\n“Simply long press the home button or navigation bar, then circle, tap, or gesture on what you want to search. When an AI response seems most helpful, an AI Overview will appear in your results,” Google said in a blog post. “From there, scroll to the bottom and tap ‘dive deeper with AI Mode’ to ask follow-up questions and explore more about your visual search.”\n\nCircle to Search can now also provide in-game help for mobile gamers, a feature that Google was testing back in January. The feature can be used to find character and strategy information without closing the game, as well as find articles and videos that are timestamped to the same moment of the game where assistance is needed. Google said it’s also working on bringing AI Mode to Lens via the Google app for both Android and iOS devices.\n\nThe new Galaxy Z Fold 7, Galaxy Z Flip 7, and Watch 8 series launched at Samsung’s Unpacked event today are the first devices to come with Android 16 and Wear OS 6 installed out of the box. Building on that relationship, Google has also announced a Gemini Live update for the Flip 7 that brings camera-sharing support to the external cover screen display, allowing the AI assistant to answer questions about what it can “see” without opening the phone.\n\nThe latest Galaxy Z Flip clamshell can now run Gemini camera features on the cover display. Image: Google"}, "https://www.theverge.com/hands-on/701175/samsung-galaxy-watch-8-series-hands-on-smartwatch-fitness-health-wearables": {"title": "Samsung Galaxy Watch 8 series hands-on: squircle squad", "summary": "Summarize: is a senior reporter focusing on wearables, health tech, and more with 13 years of experience. When I slipped on the regular 40mm and 44mm Classic, the squircle shape wasn’t so bad. I noticed the effect more on the 44mm 8 and the 46mm Classic.", "url": "https://www.theverge.com/hands-on/701175/samsung-galaxy-watch-8-series-hands-on-smartwatch-fitness-health-wearables", "content": "is a senior reporter focusing on wearables, health tech, and more with 13 years of experience. Before coming to The Verge, she worked for Gizmodo and PC Magazine.\n\nOne thing is immediately noticeable as I try on the new Galaxy Watch 8 and Galaxy Watch 8 Classic just ahead of Samsung Unpacked. The squircle has taken over.\n\nThe circle-face-in-a-square-case design was introduced last year with the Galaxy Watch Ultra, and it has now made its way to the rest of the lineup. At a glance, it’s the most noticeable change about this year’s Galaxy watches. And I can’t lie, I was resistant. The initial photos and renders that Samsung shared with the press had me bracing. The circular design was iconic! The Ultra was square and squat! But to my surprise, when I slipped on the regular 40mm and 44mm Galaxy Watch 8, the squircle shape wasn’t so bad.\n\nIt was, dare I say, sort of sleek? Side-by-side, the Classic seemed chunkier compared to the previous version of the watch, but not so much that I felt it had fully lost the Classic’s distinctive design flavor. (Speaking of which, the rotating bezel is here, it’s satisfyingly clicky, and, oh, how I’ve missed it.)\n\nA visit from the Squircle Squad.\n\nJeffrey Kim, Samsung’s senior product lead for smartwatches, told me there are a few reasons why Samsung went full squircle for this year’s lineup. It allows the watches to sit flatter on your wrist, and it allows the case to be 11 percent thinner while housing a slightly larger battery. Emphasis on slightly — we’re talking around 10-20mAh of extra battery, depending on the model.\n\nYou’ll have to take my word for it, but the squircle watches do sit flatter on your wrist, and they are more comfortable. I noticed the effect more on the bigger Galaxy Watches — the 44mm 8 and the 46mm Classic, which sadly only comes in a single size. My colleague Allison Johnson also gave me a gut check on the flatness, so you can’t accuse us both of having Stockholm syndrome.\n\nI swear, the squircle looks nicer in person than in renders.\n\nOtherwise, the hardware updates are minor. The Classic gets the Ultra’s Quick Button so you can program shortcuts. The watches also sport a new lug system for swapping straps. Samsung has refined it from last year, and the button mechanism is significantly easier to use (though I did lose a press-on nail in the process of trying it out).\n\nThe Ultra now comes in blue and has twice the storage (64GB), and that’s about it. There are no new sensors. The processor is the same as last year’s models. The materials are also the same. You’ll notice more of a change if you’re coming from the Galaxy Watch 6 Classic, given that Samsung only updates those models every other year now.\n\nThe bulk of the updates are software-based. That includes stuff like a Running Coach, which grades your ability based on a 12-minute running test and then generates a custom training plan. It’s geared toward beginner and intermediate-level runners, but Kim says you could use it to train for a marathon. There’s also a new Bedtime Guidance feature that estimates your circadian rhythm to suggest an optimal bedtime. Vascular Load measures your stress levels while you sleep. I can’t comment on those features just yet, as they weren’t available for a demo. I did, however, get to try two new software features: Google Gemini and Antioxidant Index.\n\nThe Classic gets a new Quick Button.\n\nGemini is part of Wear OS 6 and will replace Google Assistant. Kim tells me it doesn’t require a separate Gemini subscription to use, though it does require an internet connection. LTE Galaxy Watches, for instance, won’t need a phone nearby to use it, but Bluetooth ones will. Gemini on the wrist can do everything that Assistant can, and then some. Specifically, you can ask it to do things that require multiple apps in a sequential order. It’s hard to think of these kinds of queries off the top of your head, but here are some that I saw demoed:\n\nStart a run that will burn off the calories in a slice of pizza.\n\nFind the best-rated gyms in this area and send them to my spouse.\n\nCreate a 10-minute running playlist.\n\nIn each of these demos, I watched as Gemini did an internet search and then opened the corresponding app to finish the action. These were prepared demos. When I tried crafting my own, things went a little sideways. To be fair, I was in a loud venue with spotty Wi-Fi on demo devices that hadn’t been fully set up with the individual apps necessary for success. I’m reserving judgment until I receive my review units and can test how Gemini on the wrist works more organically — but I can see the potential, and I’m excited to discover its limits for myself. This is the first time we’re really seeing a generative AI assistant on any smartwatch.\n\nAs for the Antioxidant Index, I’m a bit more cautious. The nuts and bolts of how it works are that you stick your thumb on the LED sensors, the algorithm goes beep boop bop, and you see a gauge of whether you’re eating enough fruits and veggies. If you’re not, you’ll get some recommendations as to which antioxidant-rich plants to add to your plate. To dial it back a smidge, antioxidants are molecules that inhibit oxidation and the creation of free radicals — things associated with aging and cell damage. Fruits and veggies are chockful of antioxidants! The Galaxy Watches, Kim tells me, are using a combination of LED colors to detect the level of carotenoids in your skin. Carotenoids are the pigments that make carrots orange and other plants bright colors like yellow and red. (Hence why you, too, may turn orange if you eat an excessive amount of carrots.)\n\nYes, give me a rotating bezel on the Classic.\n\nMy Antioxidant Index was garbage. I tried it three times and got three “very low” scores of 37, 40, and 43. (You can expect to see variance in readings taken in a short period.) I did this demo right after a vegetarian July 4th, full of colorful veggies and a heaping pile of strawberries. But I haven’t been eating as well this past month, and Kim told me that it could take up to two weeks to see changes to the Index and that this is meant as a helpful wellness feature. It’s not prescriptive, and my initial take is to view this with a grain of salt. Then again, don’t we all know we should be eating more fruits and veggies?"}, "https://www.theverge.com/phones/701076/samsung-galaxy-z-fold-flip-7-fe-hands-on": {"title": "Galaxy Z Fold 7 hands-on: Samsung finally made the foldables we’ve been asking for", "summary": "Samsung just announced its seventh-generation folding phones. It finally retired the long and narrow Z Fold design that it had stuck with for far too long. The Z Flip is also getting an overdue upgrade to a full-size cover screen. After years of incremental upgrades, Samsung’s foldables are taking a leap forward.", "url": "https://www.theverge.com/phones/701076/samsung-galaxy-z-fold-flip-7-fe-hands-on", "content": "is a reviewer with 10 years of experience writing about consumer tech. She has a special interest in mobile photography and telecom. Previously, she worked at DPReview.\n\nSamsung just announced its seventh-generation folding phones, and it finally retired the long and narrow Z Fold design that it had stuck with for far too long. The Z Flip is also getting an overdue upgrade to a full-size cover screen rather than the file folder shape of the past couple generations. After years of incremental upgrades and barely warmed-over designs, Samsung’s foldables are finally taking a leap forward with some bold choices — just be prepared to pay up for them.\n\nWe knew the Fold 7 would be thinner. Rumors told us. Samsung told us. But like with the Galaxy S25 Edge, seeing is believing. Or, holding the phone in your hand is, at least. Compared to the Fold 6, it’s night and day. The Fold 7 is vastly thinner and lighter, and the Fold 6 looks like a big ol’ chunk next to it. It honestly feels like a different phone.\n\nThin phones are in.\n\nAt 8.9mm thick when folded, it’s up there with the likes of the Oppo Find N5 as far as thinness goes. Oppo’s device is so slim that my colleague Dominic Preston dubbed it the “final evolution of foldables.” Open, the Z Fold 7 is just a hair thicker than the USB-C port on the bottom of the device. But there was one notable casualty in the quest to make it thinner: S Pen support. Samsung claims that omitting the screen layer that makes stylus support possible helped slim the phone down to its current proportions. I’ll take a slimmer foldable over a stylus-compatible foldable, but let’s observe a moment of silence for the S Pen Fold Edition.\n\nThe Fold’s new, wider format is a welcome change. The cover panel now measures 6.5 inches with a 2520 x 1080p resolution compared to the Fold 6’s 6.3-inch, 968 x 2376p screen. It finally feels like a normal phone when it’s closed. The inner screen is now 8 inches, and Samsung finally gave up trying to hide the inner selfie camera under the display and just put a 10-megapixel sensor behind a little hole-punch cutout. Good riddance. The water and dust resistance remains the same, with an IP48 rating like the last two models.\n\nPhoto: Allison Johnson / The Verge Photo: Allison Johnson / The Verge Photo: Allison Johnson / The Verge Photo: Allison Johnson / The Verge\n\nNow, the bad news: two thousand US dollars. Or $1,999, to be precise — that’s what the Z Fold 7 costs. With the price of everything going up, the tariffs situation, and the R&D costs that went into this newer, thinner Fold, I guess I shouldn’t be surprised. At $1,899, the Fold 6 wasn’t exactly cheap. But something about the words two thousand dollar smartphone just feels wrong, you know?\n\nBut back to the good news: the Flip is getting a proper edge-to-edge cover screen for the first time. It’s the direction Motorola went when it relaunched the Razr a few years ago, and I think it’s the right one. Samsung uses the extra screen real estate next to the camera cutouts for the time and date as you swipe through widget panels, or for navigation buttons in apps, which is cute. Sure, it’s a little awkward working around them, but I’d rather deal with this and reap the benefits of a bigger screen than be hemmed in by the file folder shape.\n\nAll screen, all the time.\n\nThe Z Flip 7 is slimmer than its predecessor, too, but only by about a millimeter when the phone is closed. It felt like the same phone to me. There are some meaningful upgrades, starting with a larger 4,300mAh battery. The Flip 7 also supports DeX and allows you to use Gemini Assistant on the cover screen — both features that were curiously missing from earlier versions. But better late than never. It has the same water and dust resistance (IP48) as last year.\n\nA less expensive, but not inexpensive, Flip.\n\nThe file folder screen lives on in a new member of the Flip lineup: the Z Flip 7 FE. It’s a lower-cost alternative to the $1,099 Z Flip 7 at… $899, which, sure, is less money. But it doesn’t feel cheap, and with a $699 alternative from Motorola, the FE feels a little forgettable.\n\nHere’s what I’m not forgetting anytime soon: picking up the Z Fold 7 for the first time. It was the same realization I had with the second-gen Pixel Fold: the “oh, this is how this phone is supposed to feel” moment. I just wish that “aha” moment came with a slightly lower price tag."}, "https://www.theverge.com/x-ai/703721/grok-4-x-ai-elon-musk-live-demo": {"title": "Musk makes grand promises about Grok 4 in the wake of a Nazi chatbot meltdown", "summary": "Elon Musk's live demo of Grok 4, the latest big-ticket model from his AI startup, began with high-intensity music and claims of a “ludicrous rate of progress” More than 1.5 million viewers were watching at one point. The release follows high-profile projects from OpenAI, Anthropic, Google, and others, all of which have touted their investments in building AI agents.", "url": "https://www.theverge.com/x-ai/703721/grok-4-x-ai-elon-musk-live-demo", "content": "is The Verge’s senior AI reporter. An AI beat reporter for more than five years, her work has also appeared in CNBC, MIT Technology Review, Wired UK, and other outlets.\n\nElon Musk’s live demo of Grok 4, the latest big-ticket model from his AI startup, began with high-intensity music, claims of a “ludicrous rate of progress,” and a lot of chatter on X about Grok’s scandal-filled week.\n\nMusk pronounced it to be “the smartest AI in the world.”\n\nThe livestream, slated to start at 8PM PT, began more than an hour late and billed the new model as “the world’s most powerful AI assistant.” More than 1.5 million viewers were watching at one point. Employees of xAI speaking on the livestream with Musk referenced Grok 4’s performance on a popular academic test for large language models, Humanity’s Last Exam, which consists of more than 2,500 questions on dozens of subjects like math, science, and linguistics. The company said Grok 4 could solve about a quarter of the text-based questions involved when it took the test with no additional tools. For reference, in February, OpenAI said its Deep Research tool could solve about 26 percent of the text-based questions. (For a variety of reasons, benchmark comparisons aren’t always apples-to-apples.)\n\nMusk said he hopes to allow Grok to interact with the world via humanoid robots.\n\n‘It might discover new physics next year… Let that sink in.’\n\n“I would expect Grok to discover new technologies that are actually useful no later than next year, and maybe end of this year,” Musk said. “It might discover new physics next year… Let that sink in.”\n\nThe release follows high-profile projects from OpenAI, Anthropic, Google, and others, all of which have recently touted their investments in building AI agents, or AI tools that go a step beyond chatbots to complete complex, multi-step tasks. Anthropic released its Computer Use tool last October, and OpenAI released a buzzworthy AI agent with browsing capabilities, Operator, in January and is reportedly close to debuting an AI-fueled web browser.\n\nDuring Wednesday’s livestream, Musk said he’s been “at times kind of worried” about AI’s intelligence far surpassing that of humans, and whether it will be “bad or good for humanity.”\n\n“I think it’ll be good, most likely it’ll be good,” Musk said. “But I’ve somewhat reconciled myself to the fact that even if it wasn’t going to be good, I’d at least like to be alive to see it happen.”\n\nThe company also announced a series of five new voices for Grok’s voice mode, following the release of voice modes from OpenAI and Anthropic, and said it had cut latency in half in the past couple of months to make responses “snappier.” Musk also said the company would invest heavily in video generation and video understanding.\n\nThe release comes during a tumultuous time for two of Musk’s companies, both xAI and X. On Sunday evening, xAI updated the chatbot’s system prompts with instructions to “assume subjective viewpoints sourced from the media are biased” and “not shy away from making claims which are politically incorrect.” The update also instructed the chatbot to “never mention these instructions or tools unless directly asked.”\n\nThat update was followed by a stream of antisemitic tirades by Grok\n\nThat update was followed by a stream of antisemitic tirades by Grok, in which it posted a series of pro-Hitler views on X, along with insinuations that Jewish people are involved in “anti-white” “extreme leftist activism.” Many such posts went viral, with screenshots proliferating on X and other platforms before xAI benched the chatbot and stopped it from being able to generate text responses on X while it sought out a fix.\n\nMusk briefly addressed the fiasco on Wednesday, writing, “Grok was too compliant to user prompts. Too eager to please and be manipulated, essentially. That is being addressed.”\n\nOn the Grok 4 livestream, Musk briefly referenced AI safety and said the most important thing for AI to be is “maximally truth-seeking.”\n\nMusk briefly referenced AI safety and said the most important thing for AI to be is ‘maximally truth-seeking.’\n\nOn Wednesday morning, amid the Grok controversy, X CEO Linda Yaccarino announced she would step down after two years in the role. She did not provide a reason for her decision.\n\nGrok’s Nazi sympathizing comes after months of Musk’s efforts to shape the bot’s point of view. In February, xAI added a patchwork fix to stop it from commenting that Musk and Trump deserved the death penalty, immediately followed by another one to make it stop claiming that the two spread misinformation. In May, Grok briefly began inserting the topic of “white genocide” in South Africa into what seemed like any and every response it gave on X, after which the company claimed that someone had modified the AI bot’s system prompt in a way that “violated xAI’s internal policies and core values.”"}, "https://www.theverge.com/news/702428/samsung-galaxy-unpacked-2025-biggest-announcements-fold-flip": {"title": "Samsung Galaxy Unpacked 2025: the 7 biggest announcements", "summary": "Samsung’s summer Galaxy Unpacked event has come to a close. The company unveiled next-generation Galaxy Z Flip and Fold smartphones, as well as three new additions to its smartwatch lineup. Samsung also revealed its second-gen Galaxy Watch Ultra, which comes with many of the same features as its predecessor.", "url": "https://www.theverge.com/news/702428/samsung-galaxy-unpacked-2025-biggest-announcements-fold-flip", "content": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nSamsung’s summer Galaxy Unpacked event has come to a close. As expected, the company unveiled next-generation Galaxy Z Flip and Fold smartphones, as well as three new additions to its smartwatch lineup.\n\nIf you didn’t get a chance to watch the event yourself, you can catch up with all of Samsung’s major announcements below.\n\nSamsung has revealed the Galaxy Z Fold 7, which is even thinner and lighter than its predecessor at 4.2mm thick when unfolded and 8.9mm when folded. It also has a larger 6.5-inch outer display and an 8-inch display on the inside (up from 6.3 inches and 7.6 inches, respectively).\n\nThe Fold 7 comes with some other spec bumps, including a Snapdragon 8 Elite processor and up to 16GB of RAM. Its storage still maxes out at 1TB, but Samsung gave the rear camera setup a small boost by pairing an upgraded 200-megapixel, wide-angle sensor with a 12MP ultrawide lens and a 10MP telephoto camera. But unlike previous generations, the Fold 7 doesn’t support the S Pen.\n\nThe Fold 7 starts at $1,999.99 and comes in silver, black, blue, and mint (for online orders only). It’s available for preorder starting today and will start shipping on July 25th.\n\nThe Galaxy Z Flip 7 gets a larger cover display\n\nThe Galaxy Z Flip 7 has a larger 4.1-inch cover screen that extends beyond the two cameras on the display. Samsung increased the size of the inner display, too, going from 6.7 inches on the Flip 6 to 6.9 inches on the Flip 7.\n\nLike the Fold 7, the clamshell-style foldable is also thinner than its predecessor, measuring just 6.5mm thick when unfolded. Additionally, the Flip 7 features a Samsung Exynos 2500 processor, 12GB of RAM, up to 512GB of storage, and a larger 4,300mAh battery. It comes with the same 50MP wide-angle lens, 12MP ultra-wide sensor, and 10MP front-facing camera.\n\nThe Flip 7 is priced at $1,099.99 and comes in blue, black, coral red, and mint (online only). It’s available for preorder starting today and will start shipping on July 25th.\n\nSamsung’s first Flip FE has arrived\n\nDuring Unpacked, Samsung showed off the FE — or “Fan Edition” — version of the Galaxy Z Flip 7. Similar to its other FE devices, the Galaxy Z Flip 7 FE is cheaper than the flagship model, starting at $899.99.\n\nThe Flip 7 FE sports a similar design to the Flip 6, featuring a 3.4-inch cover display that borders the camera bar rather than extending beyond it, along with a 6.7-inch inner screen. Its specs also mimic that of the Flip 6, as it comes with 8GB of RAM, up to 256GB of storage, a 4,000 mA battery, and a rear camera setup that includes a 50MP wide-angle camera and 12MP ultrawide lens.\n\nThe Flip 7 FE comes in black and white. It’s available for preorder starting today and will start shipping on July 25th.\n\nImage: Samsung\n\nSamsung also revealed its second-gen Galaxy Watch Ultra, which comes with many of the same features as its predecessor but with 64GB of storage instead of 32GB. The device still comes with a 47mm display, titanium casing, and a 590mAh battery that offers up to 100 hours of use in power-saving mode.\n\nIt will also support the latest One UI 8 features, including the ability to measure antioxidant levels, suggest ideal bedtimes, and a running coach for “motivation and real-time guidance.” The Watch Ultra starts at $649.99, and you can preorder it today before it starts shipping on July 25th.\n\nGalaxy Watch 8 goes full squircle\n\nSamsung brought the Galaxy Watch Ultra’s squircle case design and round watchface to the Galaxy Watch 8 and Watch 8 Classic. The company says the Watch 8 is its “thinnest” yet. It’s 11 percent thinner than the Watch 7.\n\nThe new midrange watch is available in 40mm and 44mm display sizes, with an Exynos W1000 processor, 2GB of RAM, and up to 32GB of storage. The Watch 8 starts at $349.99 for the Bluetooth model and $399.99 for the LTE version. It’s available in graphite and silver, and you can preorder it today before it starts shipping on July 25th.\n\nGalaxy Watch 8 Classic is back with just one size\n\nFollowing a gap year, Samsung has also reintroduced the Galaxy Watch 8 Classic, with a silver rotating bezel and a single 46mm display. Samsung upgraded it with a larger 445mAh battery, 64GB of storage, and the Ultra’s Quick Button.\n\nThe Watch 8 Classic starts at $499.99 for the Bluetooth model and $549.99 for the LTE one. It’s available in black and white, and you can preorder it today before it starts shipping on July 25th.\n\nImage: Samsung\n\nRick Osterloh, Google’s senior vice president of devices and services, made an appearance at Unpacked to announce that Google is putting AI Mode into Circle to Search, allowing you to ask follow-up questions about a visual search. Additionally, Samsung apps like Calendar, Notes, and Reminders now support Gemini Live integrations — previously only available in Google apps — while the Galaxy Z Flip 7 is getting a Gemini Live update that enables camera-sharing on the cover screen.\n\nSamsung’s new phones will ship with these features — along with Android 16 and One UI 8 — out of the box.\n\nCorrection, July 9th: An earlier version of this article stated that Samsung apps like Calendars, Notes, and Tasks “now support” Gemini integrations. Those apps already had Gemini integrations; they are getting Gemini Live integrations."}, "https://www.theverge.com/planes/702479/ice-air-trump-mass-deportation-charter-airlines": {"title": "The brutal realities of ICE Air", "summary": "Since January, ICE has expanded the shadowy network of charter airlines that shuttles tens of thousands of detainees around the country and the world on deportation flights. This network’s official designation is the Immigration and Customs Enforcement Air Operations division. ICE Air has grown into an operation rivaling that of a small commercial airline.", "url": "https://www.theverge.com/planes/702479/ice-air-trump-mass-deportation-charter-airlines", "content": "But ICE is growing in less obvious ways, too. Since January, it has expanded the shadowy network of charter airlines that shuttles tens of thousands of detainees around the country and the world on deportation flights. This network’s official designation is the Immigration and Customs Enforcement Air Operations division. Many people just call it “ICE Air.”\n\nICE Air is no less brutal than the agency’s heavy-handed field operations. But its brutality comes in the form of scale, speed, and efficiency — attributes that you probably want in a commercial airline, but not in an increasingly weaponized tool of law enforcement.\n\nWhen it was founded in 2003, ICE had no internal capacity to deport people. It relied on the US Marshals Service to operate deportation flights on the small fleet of Boeing 737s primarily used to transport federal inmates around the country.\n\nRemoval flights quickly became an important tool for ICE. They were an efficient way to deport large numbers of people without the public spectacle of using commercial airplanes or public airports. In 2005, the US Marshals flew almost 100,000 deportees on behalf of ICE, versus only 58,000 inmates for the Department of Justice. By the end of the decade, the Marshals were deporting more than 170,000 people every year but did not have the capacity to handle any more.\n\nICE Air is no less brutal than the agency’s heavy-handed field operations\n\nSo, under Barack Obama’s administration, the agency turned to the private sector. In 2010, ICE began working with a company called Classic Air Charter to broker deportation flights directly from charter airlines. During the global war on terror, the company served as an intermediary for the CIA’s “extraordinary rendition” program, sourcing charter flights that shuttled terrorism suspects to CIA black sites around the world. Deportation would simply be an expansion of its government business.\n\nAnd a far more lucrative one, too. Contracts for the CIA’s infrequent rendition flights rarely broke into seven-figure territory. In contrast, charter contracts from ICE would be worth hundreds of millions of dollars every year.\n\nSince then, ICE Air has grown into an operation rivaling that of a small commercial airline. It operates a fleet of 12 large airplanes (currently a mix of Boeing 737s, MD-80s, and Airbus A320s) every day, plus a reserve fleet of more than 100 airplanes of various sizes that it can activate for one-off flights.\n\nICE does not make its routes, schedules, or even its flight statistics public. But a FOIA request from the University of Washington revealed that between 2010 and 2018, ICE Air flew 1.7 million people on 15,000 deportation flights. Using airplane-tracking databases such as the ADS-B Exchange, the immigration rights nonprofit Witness at the Border estimates that ICE Air has flown another 10,600 deportation flights between January 2020 and May 2025.\n\n“There is no disclosure, there is no reporting, this is by design not transparent,” says Thomas Cartwright, who leads the tracking project for Witness at the Border. “People deserve to know what is happening.”\n\nPhoto: Getty Images\n\nOn board these flights, conditions are often dehumanizing and sometimes even dangerous.\n\nThe official “ICE Air Operations Handbook” requires that every deportee “be fully restrained by the use of handcuffs, waist chains, and leg irons” during their flight. They are denied access to contact lenses, prescription medicine, belts, and jackets. They receive a meal of a single dry sandwich and a granola bar (chips and condiments not allowed), but are not guaranteed access to a restroom.\n\nDeportees allege that ICE Air personnel often make this experience even worse. There are hundreds of allegations of verbal, physical, and in some cases even sexual abuse of deportees since 2010.\n\nSometimes, this abuse borders on torture. In 2012, a woman who was pregnant with triplets began to bleed during a deportation flight to El Salvador, but the crew refused to declare an emergency or divert the airplane. She miscarried shortly after landing. In 2016, ICE officials allegedly used tasers to subdue deportees on a flight to Bangladesh. In 2020, multiple deportees on a flight to Cameroon accused ICE officers of placing them in a straitjacket-like emergency restraint called “the WRAP” for up to 12 hours at a time, resulting in bleeding, bruising, respiratory issues, and in some cases permanent injury afterward.\n\n“There is no disclosure, there is no reporting, this is by design not transparent.”\n\n“In Cameroon, I had been beaten with a machete until my feet swelled and bled, and I was struck again and again with a metal belt buckle,” said one deportee in a legal complaint. “But the day I was put in the WRAP by ICE, I wanted to die. I have never felt such horrible pain.”\n\nOfficially, ICE says that reports of abuse are overblown, and that it “has the utmost confidence in the professionalism of [its] workforce and their adherence to … policy.”\n\nBut it has no real impetus to change. Public outrage so far has focused on enforcement and detention activities; ICE Air has been largely ignored. The Department of Homeland Security has never provided meaningful oversight for ICE or any of the department’s other agencies, including Customs and Border Protection and the Transportation Security Administration. And no president — Obama, Biden, or Trump — has intervened to stop it or even scale ICE Air back.\n\nICE Air has already played a key role in several high-profile deportation cases this year. It transported Mahmoud Khalil to a processing facility in Jena, Louisiana, within hours of his arrest in New York. Over three days, it took Kilmar Ábrego García to two facilities in Louisiana and Texas before deporting him to El Salvador’s infamous CECOT prison. The scale and speed of ICE Air allows the agency to move detainees faster than courts can react — even, or perhaps especially, in the case of wrongful deportations.\n\nNow, the Trump administration wants to triple the volume of deportations to more than 1 million a year. To that end, the massive budget bill signed into law on July 4th will add $75 billion to ICE’s budget over the next four years, on top of the more than $11 billion it was already planning to spend next year. ICE will soon become the largest federal law enforcement agency in the country.\n\n“Our infrastructure is going to be huge,” acting ICE Director Todd Lyons told Fox News after the budget bill’s passage. “Morale’s never been higher.”"}, "https://www.theverge.com/tech/697594/amazon-prime-day-sale-best-tech-deals-2025": {"title": "The best Prime Day 2025 deals you can still get", "summary": "This article will no longer receive updates. For day three of Prime Day, we’re keeping fresh deals and updates going in an updated post. We’ve collected the best deals we could find on everything from noise-canceling headphones to robot vacuums.", "url": "https://www.theverge.com/tech/697594/amazon-prime-day-sale-best-tech-deals-2025", "content": "For day three of Prime Day, we’re keeping fresh deals and updates going in an updated post. This article will no longer receive updates.\n\nOriginal article follows below.\n\nIt’s the second day of Amazon’s four-day Prime Day sale, and if you’ve held out on making impulse buys so you can make informed purchases, you’ve come to the right place. We’ve collected the best deals we could find on everything from noise-canceling headphones and robot vacuums to the latest tablets and TVs, the bulk of which have been tried and tested by Verge writers and editors. We pbasut as much confidence in our budget-friendly battery picks as we do the pricier gaming monitors we’ve included.\n\nPrime Day’s extended runtime this year is giving you more time to shop, though don’t wait for entirely new sets of deals to drop everyday. There’ll be some lightning deals and single-day discounts, which we’ll be sure to highlight, but the big benefit is avoiding disappointment from missing a deep discount because you slept on it. We’re delighted to see many gadget deals, including the $100 off deal on Apple’s AirPods 4 and the $50 Meta Quest 3S headset discount, are still available. We don’t expect to see them this heavily discounted again until Black Friday rolls around, and even then, these deals aren’t guaranteed to come back.\n\nPrime Day highlights\n\nlast-gen Switch OLED for the lowest price we’ve seen yet. The console with blue and red neon Joy-Con is $249.99 at It’s no Switch 2 deal, but Woot is selling thefor the lowest price we’ve seen yet. The console with blue and red neon Joy-Con is $249.99 at Woot , while the Mario Kart 8 Deluxe bundle that includes the game is $275.99 at the retailer , while supplies last. Note: these are international versions, which run just fine in the US, but they only have a 90-day Woot warranty instead of a 1-year manufacturer warranty.\n\nApple’s 2020 MacBook Air with the M1 chip has no business being a good value still in 2025. The laptop’s design is the most outdated thing about it, but its processor, along with 8GB RAM and 256GB of storage make it a good entry-level Mac, especially at has no business being a good value still in 2025. The laptop’s design is the most outdated thing about it, but its processor, along with 8GB RAM and 256GB of storage make it a good entry-level Mac, especially at Walmart ’s discounted $599.99 price (was $649.99).\n\nVizio’s 5.1.2. Elevate SE system is actually just $299 at A solid soundbar that can automatically rotate itself to fire sound upwards for Dolby Atmos content seems like it’d be expensive, butis actually just $299 at Amazon ($200 off).\n\nGameSir G8 Plus is one versatile mobile gaming controller, and it’s down to its lowest price of $49.99 at Theis one versatile mobile gaming controller, and it’s down to its lowest price of $49.99 at Walmart (usually $79.99). This model can stretch to fit around phones and tablets as big as the iPad Mini. Alternatively, you can slot a Nintendo Switch into the grip, if you prefer its bulkier design to that of the Joy-Con.\n\nThermacell’s rechargeable repeller , which costs $17.68 (half off) at Keep mosquitos at bay with, which costs $17.68 (half off) at Amazon for the version that lasts five hours per charge. It runs on cartridges, but a 12-hour one is included in the box.\n\nApple’s AirPods Pro that come with a USB-C charging case are around $100 off for the first time at It’s a good time to need new AirPods, becausethat come with a USB-C charging case are around $100 off for the first time at Amazon Walmart , and Best Buy\n\nSavePoint is $39.99 when you clip the on-page coupon at Genki’s small M.2 2230-sized enclosure called theis $39.99 when you clip the on-page coupon at Amazon . You can use it as a speedy USB-C SSD with any device, but it shines when connected to a Steam Deck because it has two USB-C ports (one for data, the other for power passthrough to keep the handheld charged). Here’s how to use it to run Windows on your Steam Deck\n\nHoto’s rechargeable screwdriver is a both a Verge-favorite and a reader-favorite, and it’s discounted for Prime Day. It’s $36.09 (originally $79.99) at is a both a Verge-favorite and a reader-favorite, and it’s discounted for Prime Day. It’s $36.09 (originally $79.99) at Amazon for the 3.6V screwdriver, 25 steel bits, and a sleek carrying case to contain it all. There’s an on-page coupon to save an extra 10 percent, too.\n\nGoogle’s shiny Nest WiFi Pro routers — all of which support Wi-Fi 6E — are down to $289.99 at For the first time since Black Friday, a three-pack of— all of which support Wi-Fi 6E — are down to $289.99 at Amazon . This kit typically sells for around $372. Read our review\n\nTP-Link’s Deco XE75 routers at For $199.99, you can get a three-pack ofat Amazon . Like Google’s Nest WiFi Pro, these tri-band routers support the 6GHz band. However, each XE75 sports a 2.5Gbps port (plus two other gigabit ethernet ports), while Google’s option tops out at 1Gbps and only has two gigabit ports per router.\n\nEero’s Max 7 is one of the best. You can purchase a single router at If you’re looking for a high-end router that supports ludicrously fast wired connections, as well as great wireless connections,is one of the best. You can purchase a single router at Amazon right now for $419.99 (it had previously not sold for less than $449.99). Alternatively, you can grab a three-pack at Amazon for $1,189.99 (was $1,699.99). This model offers tri-band support and features two 10Gbps ethernet ports, as well as two 2.5Gbps ports, on each router.\n\nAmazon’s aptly titled Air Quality Monitor, which is currently matching its all-time low of $44.99 ($25 off) at Air quality is important, and it’s nice to have a reading that’s more local than what your phone gives you for your neighborhood. For a granular look at the air quality in your home, you can snag, which is currently matching its all-time low of $44.99 ($25 off) at Amazon for Prime Day. Read our review\n\nMeross Smart Wi-Fi Garage Door Opener $ 40 $ 50 20 % off $ 40 Meross makes a handy add-on that can transform a variety of garage door models into smart doors that you can open remotely. It works with Amazon Alexa, Apple Home, Google Home, and Samsung SmartThings. Read More $40 at Amazon\n\nMini 2 camera to be a great, inexpensive indoor or outdoor camera. By default, it’s an indoor cam, with HD video, color night video, and two-way audio support. It’s a good deal on Blink built itsto be a great, inexpensive indoor or outdoor camera. By default, it’s an indoor cam, with HD video, color night video, and two-way audio support. It’s a good deal on Amazon right now, too, where you can grab it for $19.99 ($20 off). If you need an outdoor cam, you can grab it with a weather-resistant power adapter for just $10 more (normally $49.98).\n\nThanks to Prime Day, Amazon’s slick Echo Pop smart speaker is down to $21.99 (nearly 50 percent off). It’s available in four colors (black, grey, purple, and teal), and select designs of the Kids version — which comes with parental controls and six months of Amazon Kids Plus— are also discounted to $21.99.\n\nTP-Link’s Kasa smart home brand makes several Matter-ready Wi-Fi plugs , and a two-pack of them is currently available for just $19.99 ($20 off) at Amazon . You can control the plugs from within the Kasa app, or by giving voice commands via Alexa, Siri, Google Assistant, or Samsung SmartThings.\n\nTapo Matter outdoor smart plug , which has the same features as its indoor plugs and is on sale for $16.99 ($8 off) at If your smart home extends outside, TP-Link also has a two-outlet, which has the same features as its indoor plugs and is on sale for $16.99 ($8 off) at Amazon and Best Buy . The outlets are housed in an IP65 weather-resistant housing, and a pair of removable caps prevent water from getting in when nothing is connected.\n\nGE’s Cync Reveal HD Plus smart undercabinet light fixture is currently $30.37 ($10 off) at is currently $30.37 ($10 off) at Amazon a 12-inch long light bar that can be screwed into the underside of a kitchen island or cabinet to provide illumination in hard-to-reach places. It supports Matter, and you can control it via your voice with Amazon’s Alexa, the Google Assistant, Samsung SmartThings, and Apple HomeKit.\n\nRelated Here are the best smart locks you can buy right now\n\nDreame X40 Ultra $ 700 $ 1500 53 % off $ 700 With a neat ability to remove and reattach its mop pads, the Dreame X40 solves the problem of vacuuming carpets (with 12,000Pa suction power) while also mopping hard floors. Its mops can also swing out and under low furniture, getting where most bots can’t reach. Read More $700 at Amazon (for Prime members)$800 at Dreame\n\nEufy’s Omni C20 is on sale for $379.99 during Prime Day, which beats its previous low by $20. The budget robot vacuum features built-in mops, and its cleaning station can store debris from the vacuum, as well as wash and dry the mop components to prevent them from smelling after doing some dirty work.\n\nSamsung Galaxy Buds FE are a decent-sounding pair of earbuds with ANC, and they’re down to a new low $52.24 ($47 off) at Theare a decent-sounding pair of earbuds with ANC, and they’re down to a new low $52.24 ($47 off) at Amazon . The entry-level earbuds offer reliable performance and satisfactory sound — especially at this price — though they lack wireless charging, multipoint support, and some of the newer frills found on Samsung’s flagship earbuds. That said, they also come with a pair of silicone “wings” to help them stay firmly planted in place, which some considered a hallmark of prior models. Read our review\n\nAirPods 4, which have fallen to a new low of $89 ($41 off) at If you’re an Apple user, there’s no better pair of starter buds than the open-style, which have fallen to a new low of $89 ($41 off) at Amazon and Walmart . The latest model sounds significantly better than the third-gen pair, particularly when it comes to voice calls. More importantly, they offer robust integration with the rest of the Apple ecosystem, letting you take advantage of audio sharing, automatic device switching, hands-free “Hey Siri” commands, Apple TV integration, and more. Read our review\n\nGoogle’s Pixel Buds Pro 2 are on sale at are on sale at Amazon for $160.55 ($69 off), which is their best price to date. They’re a pretty notable step up from the prior model — particularly if you use a Pixel phone — with a smaller build, an excellent transparency mode, and some of the best battery life you can get in a pair of noise-canceling earbuds. Read our review\n\nWH-1000XM5 still offer top-tier noise cancellation and superb sound, along with a helpful transparency mode, multipoint Bluetooth support, and other handy features. The only real downside, aside from the plasticky build, is the fact that they don’t fold down like the XM4 and this year’s XM6. Sony’s newer WH-1000XM6 are our No. 1 pick for the best ANC headphones, but the prior model remains an excellent alternative at $248 ($150 off), their current price on Amazon . Thestill offer top-tier noise cancellation and superb sound, along with a helpful transparency mode, multipoint Bluetooth support, and other handy features. The only real downside, aside from the plasticky build, is the fact that they don’t fold down like the XM4 and this year’s XM6. Read our review\n\nWF-C710N do, however, and they’ve reached a new low price of $78 ($41 off) at Other than the Beats Studio Buds Plus above, there aren’t a ton of reputable pairs of wireless earbuds that rely on a see-through design. The newerdo, however, and they’ve reached a new low price of $78 ($41 off) at Amazon for Prime Day. What’s more, the budget-minded earbuds also borrow some tricks from Sony’s pricier earbuds, including improved noise cancellation and battery life, an automatic pause feature, and touch buttons that allow you to control playback without whipping out your phone.\n\nSony’s Float headphones are currently down to $78 ($52 off) at headphones are currently down to $78 ($52 off) at Amazon , which is significantly less than their previous low of $108. The Float represent Sony’s take on open-ear headphones, and while we haven’t had a chance to test them (yet), they seem to offer similar features to their like-minded rivals, including IPX4 water resistance, USB-C charging, and generous ear hooks that are designed to keep them firmly in place while you run.\n\nThe recently released Skullcandy Method 360 ANC are down to a new low of $75.99 ($50 off) at Amazon for Prime Day. They’re basically a pair of low-end Bose earbuds in disguise — hell, they even use licensed technology and audio tuning by Bose — which means they offer well-balanced sound, solid battery life, and a number of great features for the price. They also block noise more effectively than previous Skullcandy offerings and come in an array of fun colors, including a chic leopard print.\n\nCMF Buds Pro 2 are available starting at $47 ($22 off) from Theare available starting at $47 ($22 off) from Amazon and Nothing , matching their best price to date. The inexpensive buds come loaded with features, including active noise cancellation, ChatGPT integration, and up to 6.5 hours of continuous playback with ANC enabled. They also come with a case that features a customizable smart dial, allowing you to adjust the volume, control noise cancellation, and mute your mic during meetings.\n\nUgreen’s Nexode model , which is currently on sale at For a portable power bank that matches the design of Anker’s 20,000mAh 737 battery with its display but delivers a substantial amount of power (a combined 130W), there’s, which is currently on sale at Best Buy for just $54.14 ($35.85 off).\n\nBaseus 10,000mAh Picogo is one of the most powerful tiny power banks we’ve seen. It supports 45W output through its built-in USB-C cable, and has an extra USB-C port, plus a USB-A port. You can snag one for $24.69, down from its original $39.99 price at Theis one of the most powerful tiny power banks we’ve seen. It supports 45W output through its built-in USB-C cable, and has an extra USB-C port, plus a USB-A port. You can snag one for $24.69, down from its original $39.99 price at Amazon\n\nBelkin’s MagSafe 2-in-1 wireless charging stand , which is down to $59.99 ($4o off) at You can keep your iPhone and AirPods charged with, which is down to $59.99 ($4o off) at Amazon , nearly matching its best price to date. While similar models from other brands are often cheaper, this one looks better than most, and it hasn’t sunk this low in price since mid-2023. Belkin’s option also includes a power adapter.\n\nBaseus PrimeTrip VR2 Max has been one of the most popular products for Verge readers recently. The 4-in-1 car charger can put out a combined 163W of power and features two retractable USB-C cables, plus two USB-A ports. It’s tough not to love, especially at its Thehas been one of the most popular products for Verge readers recently. The 4-in-1 car charger can put out a combined 163W of power and features two retractable USB-C cables, plus two USB-A ports. It’s tough not to love, especially at its Amazon price of $29.99 ($20 off).\n\nApple Watch Ultra 2 hasn’t sunk below $700 in a few months, but during Prime Day, you can snag it at The entry-levelhasn’t sunk below $700 in a few months, but during Prime Day, you can snag it at Amazon and Best Buy for $649.99. This beats its previous low by $30. Read our review\n\nPixel Watch 2. The If $249 is still too expensive, don’t write off the. The cellular version is on sale at Amazon for $179.99 ($120 off). Its battery life isn’t as good as the Pixel Watch 3, and it’s missing a few features, but it’s otherwise a solid alternative if you’re trying to save a little cash. Read our review\n\nGalaxy Watch 7 , which is matching its previous low of $246.99 ($136 off) at If you have your eyes set on a Samsung smartwatch, it’s a good time to grab the, which is matching its previous low of $246.99 ($136 off) at Amazon in the 44mm configuration with LTE. Read our review\n\nSamsung Galaxy Watch 7 Bespoke Edition is down to $189.99 ($140 off) at The non-LTE, 44mmis down to $189.99 ($140 off) at Amazon , which is a steep price drop compared to its previous low of $279.99.\n\nSamsung Galaxy Ring is on sale at Theis on sale at Amazon in multiple sizes for $299.99 ($100 off), which beats its previous low price by $50. It’s a solid, subscription-free first attempt at a smart ring from Samsung, with good hardware and long battery life. It’s Android-only, however, and it’s best paired with a Samsung phone. Read our review\n\nGarmin Lily 2 has returned to its all-time low of $199.99 ($50 off) at Thehas returned to its all-time low of $199.99 ($50 off) at Amazon . While Garmin makes plenty of trackers for enthusiast fitness folks, the Lily 2 is a more pared-back experience for casual users. I don’t say that condescendingly; The Verge’s Victoria Song praised its limitations during a vacation.\n\nGarmin Venu Sq 2 $ 150 $ 250 40 % off $ 150 The Garmin Venu Sq 2 is a great replacement for a Fitbit smartwatch. Not only do they look similar, but the Venu Sq 2 has way more fitness features, long battery life, and no subscription. Read More $150 at Amazon$150 at Garmin\n\nSmartphone deals\n\nPixel 9 Pro with 128GB of storage is down to $749 ($250 off) at Thewith 128GB of storage is down to $749 ($250 off) at Amazon , matching its lowest price to date. The 6.3-inch Android phone boasts a telephoto lens with up to 5x optical zoom and up to 30x digital zoom. The 256GB version is also on sale at Amazon for $100 more at $849. Read our review\n\nPixel 9 Pro XL with a 6.8-inch screen and 128GB of storage is available for $749 (originally $1,099) at The largerwith a 6.8-inch screen and 128GB of storage is available for $749 (originally $1,099) at Amazon for Prime Day. Aside from its larger screen and bigger battery, its specs are identical to the smaller option. Read our review\n\nSamsung’s Galaxy S25 with 128GB of storage is down to just $584.99 (originally $799) at If you want a great all-around phone that doesn’t cost too much,with 128GB of storage is down to just $584.99 (originally $799) at Amazon . There are also discounts available on the 256GB version , which is currently selling for $644.99. This beats the previous low by about $40. Read our review\n\nGalaxy S25 Plus is a good option that’s discounted during Prime Day. The 256GB model is going for $699.99 (originally $999) at If you prefer bigger phones that won’t break the bank, theis a good option that’s discounted during Prime Day. The 256GB model is going for $699.99 (originally $999) at Amazon , while the 512GB version is down to $804.99 ($315 off). Both discounts are $50 lower than the ones we’ve previously seen. Read our review\n\nGalaxy A36 5G — which features a 6.7-inch OLED screen, water resistance, and six years of software updates — is available with 128GB of storage at Samsung makes great cheap phones, in case you didn’t know. The— which features a 6.7-inch OLED screen, water resistance, and six years of software updates — is available with 128GB of storage at Amazon for $299.99 ($100 off), which is a nice lil’ discount that beats its previous low of $334.\n\n2024 Moto G Power 5G, which currently comes with 128GB of storage for $161.99 ($38 less than the previous low) at Another budget-friendly phone worth considering if you’re trying to spend as little as possible on an unlocked device is the, which currently comes with 128GB of storage for $161.99 ($38 less than the previous low) at Amazon\n\n2024 Moto Razr $ 500 $ 700 29 % off $ 500 The standard Moto Razr features a 6.9-inch inner screen, accompanied by a larger 3.6-inch cover screen. Wired charging tops out at 30W, compared to the Razr Plus’ 45W, although it features 15W wireless charging, up from 5W on the previous model. Read our review. Read More $500 at Amazon\n\nMovies and TV show deals\n\nImage: Warner Bros.\n\nIf it’s a gorgeous 2-in-1 Windows laptop that you’re after, Samsung’s 16-inch Galaxy Book 5 Pro 360 might tick a lot of boxes for you. It has a 2,880 x 1,800 OLED touchscreen with a 120Hz refresh rate (with an S-Pen included). It also features an Intel Core 7 Ultra 256V processor, 16GB of RAM, and a 1TB SSD. Right now, it’s down to $1,399.99 at Amazon , which is $200 less than usual.\n\nLG’s compact 14-inch Gram with an Intel Core Ultra 7 255H processor, 32GB of RAM, and a 1TB SSD is going for $1,284.99 at with an Intel Core Ultra 7 255H processor, 32GB of RAM, and a 1TB SSD is going for $1,284.99 at Amazon — $215 less than its previous low. LG’s Gram laptops are known for being lightweight, yet they also feature long battery life and a fantastic keyboard / trackpad combo.\n\n2025 ROG Strix G16 lineup for the first time — including an RTX 5060-equipped laptop, which currently runs $1,274.99 ($225 off) at For gamers, Asus has discounted select models from itslineup for the first time — including an RTX 5060-equipped laptop, which currently runs $1,274.99 ($225 off) at Amazon . If you want something even more powerful, Amazon is also selling one with an RTX 5070 Ti for $1,999.99 (was $2,400).\n\nTablet and e-reader deals\n\nlarger 13-inch iPad Air with the M3 chip , there are deals for you, too. The 256GB / Wi-Fi model is currently available at If you’d prefer the, there are deals for you, too. The 256GB / Wi-Fi model is currently available at Amazon for $779.99 ($120 off), beating the previous lowest price by $20.\n\nSamsung’s Galaxy Tab S6 Lite , which allows you to better balance fun with productivity, is now available at , which allows you to better balance fun with productivity, is now available at Amazon starting at $189.99 ($135 off) in its 64GB configuration. It boasts a 10.1-inch screen, expandable storage via microSD, and includes an S-Pen for drawing or taking notes. It originally sold for $329.99, but it’s sometimes available for around $210.\n\nGalaxy Tab S10 FE, which is available at If you’re looking for an Android tablet that delivers high-end entertainment and gaming experiences, consider the, which is available at Amazon with 128GB storage for a new low of $429.99 ($70 off). This 10.9-inch tablet boasts a 90Hz refresh rate screen, and its Exynos 1580 should be able to handle a large number of games. It also includes an S-Pen, along with a two-year manufacturer’s warranty. Notably, it’s IP68 rated, so it should be able to handle the elements like a champ.\n\nSamsung Galaxy Tab A9 Plus $ 133 $ 220 40 % off $ 133 Samsung Galaxy Tab A9 Plus with 64GB of storage is $139.99 (originally $219.99), beating its previous best price of $149. Despite its low price, the Tab A9 Plus retains a high-end look, and its 11-inch screen makes it a great option for watching movies and TV shows. Read More $133 at Amazon\n\nBoox Palma 2 $ 270 $ 300 10 % off $ 270 The Boox Palma 2 is a 6.3-inch smartphone-sized e-reader that’s highly portable. It also runs on Android and comes with the Google Play Store built-in, allowing you to download apps for other digital bookstores, newspapers, note-taking apps, and more. Read our review. Read More $270 at Amazon (black)\n\nAmazon’s entry-level Kindle from 2024 is considerably better than bargain ebook readers used to be. It features longer battery life, a brighter screen, deeper contrast, and other gen-to-gen improvements. And thanks to Prime Day, you can snag it at from 2024 is considerably better than bargain ebook readers used to be. It features longer battery life, a brighter screen, deeper contrast, and other gen-to-gen improvements. And thanks to Prime Day, you can snag it at Amazon in one of two colors with ads and three months of Kindle Unlimited for $84.99 ($25 off), which is the lowest price we’ve seen on the entry-level e-reader.\n\nAmazon’s latest Kindle Scribe has been available at has been available at Amazon with 16GB of storage starting at $259.99 ($140 off) since before Prime Day started, but it’s still a solid deal if you’re looking for a large e-reader that doubles as a smart notebook. Its previous low was $299.99, and it originally sold for $399.99. Read our review\n\nAmazon makes a bunch of different tablets, which are nearly all discounted right now. If you’re looking for an affordable 10-inch tablet for watching movies and TV shows on, the latest Fire HD 10 tablet is a great, cheap candidate. It’s on sale at Amazon right now with lockscreen ads and 32GB of storage starting at $69.99 (originally $139.99).\n\nSony’s 48-inch A90K is down to $998 ($400 off), beating its previous low by hundreds of dollars. The most affordable 48-inch OLED TV we’ve seen during Prime Day isn’t available at Amazon — it’s at Walmart, where you can pick up LG’s B4 OLED for just $549.99 ($250 off). However, at Amazon is down to $998 ($400 off), beating its previous low by hundreds of dollars.\n\nNebula’s Capsule 3 is a battery-powered 1080p projector that’s currently $539.99 ($210 off) at is a battery-powered 1080p projector that’s currently $539.99 ($210 off) at Amazon . It runs Google TV, so you can access popular streaming services without plugging in a separate device, and it has an HDMI port if you want to hook up a game console or a Blu-ray player. Its battery lasts up to two and a half hours depending on your brightness settings, and it can create a 120-inch screen. Its 300 lumen brightness means it’s susceptible to getting washed out by light pollution, but it’s a great choice for backyard movie nights.\n\nTCL QM6K 4K QLED TV $ 448 $ 599 25 % off $ 448 TCL’s Mini LED QLED TV is a great value, particularly for those who want a fast frame rate and a bright picture. It offers a 144Hz refresh rate, features two HDMI 2.1 ports, and supports Google TV’s robust software. Read More $448 at Amazon (55-inch)\n\nFrame Pro is down to $1,897.99 ($50 off) at Samsung’s 65-inchis down to $1,897.99 ($50 off) at Amazon , which is a relatively small discount given the TV’s previous low. However, it initially sold for around $2,199.99. The step-up model boasts an impressive Mini LED panel, along with a jump from 120Hz to 144Hz. The biggest upgrade, however, is arguably the wireless connect box, which wirelessly streams any and all HDMI video inputs straight to the TV.\n\nJMGO’s N1S Ultra is an excellent 4K projector that’s now available for an all-time low at If you’re setting up a home theater,is an excellent 4K projector that’s now available for an all-time low at Amazon and JMGO’s online storefront , where you can grab it for $1,499 ($1,000 off). The workhorse of a laser projector can create a 300-inch screen, and its 2,800-lumen bulb is bright enough to use in a room with some light pollution. It can also automatically adjust the picture to appear even, even if it’s pointed at your wall at a slight angle.\n\n55-inch 4K smart TV is down to just $249.99 at Looking for an affordable TV with Roku software to make it easy to access streaming apps? The company’s ownis down to just $249.99 at Amazon right now. It’s never sold for less than $299.99 before, so these are some solid savings on a relatively budget-friendly set.\n\nOnn Google TV 4K Pro $ 45 $ 50 10 % off $ 45 The newer Onn Google TV 4K Pro is a great streaming device that supports Dolby Atmos, Dolby Vision, and HDR. It also functions as a smart speaker, meaning you can use it to play music, dim the lights, or carry out a host of hands-free voice commands. Read More $45 at Walmart\n\nMonitor deals\n\nAlienware AW2725DF 1440p QD-OLED gaming monitor $ 600 $ 899 33 % off $ 600 Alienware is a major player when it comes to OLED monitors. This 27-inch 360Hz model hits the sweet spot in terms of screen resolution, features, and — most importantly — price. Read More $600 at Amazon\n\nAsus’ ZenScreen Portable USB Monitor (MB169CK) — which is down to an all-time low of $85.49 (about $35 off) at — which is down to an all-time low of $85.49 (about $35 off) at Amazon — makes it easy to create a dual-screen setup alongside your laptop, whether you’re traveling or simply short on space. The 16-inch HD display connects to your computer and draws power with a single USB-C cable. It also comes with a kickstand, allowing you to position it horizontally or vertically at a comfortable angle.\n\nAlienware 34-inch AW3423DWF curved OLED gaming monitor $ 550 $ 780 29 % off $ 550 This ultrawide (21:9) QHD OLED gaming monitor has a 165Hz refresh rate, a fast response time, and a slick design. It’s tough to get more OLED for your money than with this model when it’s discounted. Read More $550 at Amazon\n\nSoundbar and Bluetooth speaker deals\n\nVizio Elevate 5.1.2 sound system $ 299 $ 500 40 % off $ 299 Vizio’s Elevate SE is a budget-friendly alternative to its high-end Elevate soundbar. It still features many of the same highlights, though, including booming sound quality and rotating speakers that provide the verticality required for Dolby Atmos content. Read More $299 at Amazon\n\nBose SoundLink Flex, which is on sale for an all-time low of $99 ($50 off) at One of the best-looking Bluetooth speakers around is the second-gen, which is on sale for an all-time low of $99 ($50 off) at Amazon for Prime Day. It’s a long-lasting, rugged (IP67) option, in case you’re sifting through which you might buy for your future outdoor escapades. It can stand on its own, too, or you can sling it onto a strong carabiner using its built-in loop.\n\nMarshall Acton III $ 200 $ 300 33 % off $ 200 If you’ve ever wanted a Bluetooth speaker that looks like a guitar amp, Marshall’s Acton III is one of the best. It’s got tactile switches and knobs out the wazoo, letting you fine-tune the bass and treble, along with the option to plug in a 3.5mm source or use Bluetooth for playback. Read More $200 at Amazon\n\nWiiM Mini $ 71 $ 125 43 % off $ 71 The WiiM Mini makes it easy to wirelessly stream music from your phone, a streaming service, or other local storage to existing speakers you already have. It supports AirPlay 2 and a variety of streaming services. Read More $71 at Amazon\n\nWiiM Pro streaming device has also received a discount at Typically priced at $149, the more capablestreaming device has also received a discount at Amazon , where you can currently grab it for $119.20 (about $30 off). It has the same DAC as the aforementioned Mini above, but it sports a couple of features you won’t find on the cheaper version, including Chromecast Audio, ethernet support, and RCA audio inputs. Read our WiiM deep dive\n\nBose’s SoundLink Max has returned to its all-time low of around $299 ($100 off) at has returned to its all-time low of around $299 ($100 off) at Amazon Best Buy , and Target . The powerful Bluetooth speaker offers robust, room-filling sound along with a 3.5-millimeter aux input for lossless listening. It’s rated IP67 for dust and water resistance, too, and offers up to 20 hours of battery life on a single charge, rendering it an excellent pick for any occasion. Read our review\n\nRoam 2 smart speaker to $143 at Sonos has discounted the price of itsto $143 at Amazon (it typically runs between $140 and $180 when discounted). Like all Sonos speakers, it can be paired to your larger Sonos family of speakers via Wi-Fi, or you can use it as a standalone Bluetooth speaker indoors or outside.\n\nSony’s SRS-XB100 is now around $33 (about $28 off) at is now around $33 (about $28 off) at Amazon Best Buy , and Walmart , marking a new low price. Roughly the size of a Coke can, the tiny Bluetooth speaker delivers surprisingly clear sound with a good amount of bass. It’s also fairly rugged, with IP67 dust and water resistance, and doubles as a speakerphone, making it just as useful for calls as it is for playing your favorite tunes. Read our review\n\nRelated The best Sonos speakers to buy in 2025\n\nAssassin’s Creed Shadows, has been given a small but welcome price cut. Thanks to Prime Day, you can pick up the open-world game set in Feudal Japan for $47.49 (originally $69.99) at Read our review. Ubisoft’s latest Assassin’s Creed game,, has been given a small but welcome price cut. Thanks to Prime Day, you can pick up the open-world game set in Feudal Japan for $47.49 (originally $69.99) at Amazon\n\nSilent Hill 2 on the PS5. If you scoffed at its original $69.99 price tag, you can currently pick it up for $39.99 ($30 off) at Read our review. Bloober Team knocked it out of the park with its remake ofon the PS5. If you scoffed at its original $69.99 price tag, you can currently pick it up for $39.99 ($30 off) at Amazon and Best Buy\n\nLike a Dragon: Pirate Yakuza in Hawaii . The latest game in the long-running Yakuza-turned-Like a Dragon franchise is on sale for the PS5 for $39.99 ($20 off) at There are few games out there with more heart and soul (and pure silliness) than. The latest game in the long-running Yakuza-turned-Like a Dragon franchise is on sale for the PS5 for $39.99 ($20 off) at Best Buy and Amazon\n\nSplatoon 3 , which recently got an update that makes the game run (and look) better on Nintendo’s new console. If you’ve always wanted to give this one a try, you can pick up a digital or physical copy for $39.99 ($20 off) at Read about the Switch 2 update. One of the best-looking Switch 2 games is, which recently got an update that makes the game run (and look) better on Nintendo’s new console. If you’ve always wanted to give this one a try, you can pick up a digital or physical copy for $39.99 ($20 off) at Best Buy and Walmart\n\nPikmin 4, the latest entry in Nintendo’s chill (yet often chaotic) exploration game. You navigate through environments, collect and command Pikmin with different elemental abilities and weaknesses, and try to save fellow space cadets from strange happenings. All the while, you’re trying to find Captain Olimar, the protagonist of the original Pikmin game. The Switch title is matching its all-time low of $39.99 ($20 off) right now at Read our review. Not enough people are still talking about, the latest entry in Nintendo’s chill (yet often chaotic) exploration game. You navigate through environments, collect and command Pikmin with different elemental abilities and weaknesses, and try to save fellow space cadets from strange happenings. All the while, you’re trying to find Captain Olimar, the protagonist of the original Pikmin game. The Switch title is matching its all-time low of $39.99 ($20 off) right now at Best Buy\n\nLenovo Legion Go S , we made it clear that its high $729.99 price was one of its biggest flaws. It has other issues, such as the current state of gaming on a Windows handheld and its underpowered Ryzen Z2 Go processor, but the 32GB RAM / 1TB storage model is worth considering at its discounted price of $499.99 ($230 off) at If you read our review of the Windows-flavored, we made it clear that its high $729.99 price was one of its biggest flaws. It has other issues, such as the current state of gaming on a Windows handheld and its underpowered Ryzen Z2 Go processor, but the 32GB RAM / 1TB storage model is worth considering at its discounted price of $499.99 ($230 off) at Best Buy . That’s a huge discount.\n\nSamsung’s Sonic-emblazoned Pro Plus 512GB microSD card is on sale for $28.49 (about $15 off) at The microSD cards used in the Steam Deck, ROG Ally, and the original Nintendo Switch are becoming more and more affordable. For instance,is on sale for $28.49 (about $15 off) at Amazon . If you’d prefer a 1TB version so you won’t have to upgrade any time soon, that’s down to $69.99 (this model has never been cheaper than $89.99).\n\nLogitech G Pro X Superlight 2 $ 133 $ 180 26 % off $ 133 The G Pro X Superlight 2 is Logitech’s lightest and most advanced mouse to date. It features a 32,000 DPI Hero 2 sensor and 4kHz polling rate, as well as support for USB-C charging and Logitech’s Powerplay mouse mat. Read More $133 at Amazon\n\nAmazon’s Luna Controller is on sale for $39.99 ($30 off) at is on sale for $39.99 ($30 off) at Amazon , which matches its best price to date. Although it was built primarily for Amazon’s cloud-gaming service, the gamepad offers support for both Bluetooth and USB-C connectivity, rendering it compatible with Android phones, Apple products, Fire TV devices, and PCs. It also integrates with Alexa, allowing you to issue voice commands directly through the controller when paired with a Fire TV device.\n\nPC add-on deals\n\nSatechi’s Mac Mini M4 Stand and Hub makes Apple’s smallest computer even more capable, and it’s currently available from Amazon and Satechi for an all-time low of $79.99 ($40 off). The hub fits perfectly beneath the computer, outfitting it with three USB-A 3.2 ports, a USB-A 2.0 port, an SD card reader, and an NVMe SSD slot in exchange for occupying one Thunderbolt 3 port.\n\nElgato Prompter $ 190 $ 300 37 % off $ 190 A teleprompter is a luxury. They help you make it look effortless to look at your camera as you read from a script or a chat log. Elgato’s option includes a small screen and a mirror, the latter of which allows you to see what you need to look at without breaking eye contact with viewers. Read More $190 at Amazon\n\nIt’s now easier than ever to plug your DSLR or mirrorless camera into your PC to use as a high-end webcam. Just grab Elgato’s Cam Link 4K , which is down to $79.99 ($20 off) at Amazon for Prime Day. The device converts the HDMI signal coming out of your camera into USB for your PC to process.\n\nOpal’s Tapole is an ultra-thin 4K webcam that clips onto the top of your laptop’s screen, and it performed better than the camera built into a MacBook Air when is an ultra-thin 4K webcam that clips onto the top of your laptop’s screen, and it performed better than the camera built into a MacBook Air when we tested it . The camera is attached to its USB-C cable, so you’ll never lose it, and clips on tightly enough that it won’t get detached if your laptop moves. The webcam is currently on sale for $99 ($30 off) at Amazon , its lowest price ever.\n\nSamsung’s T7 is a portable SSD that’s smaller and faster than an external hard drive. The USB-C drive is compatible with Windows and MacOS, and can read and write data at around 1,000Mbps. The 1TB model is currently around $75.99 ($54 off) at Backing up your computer is important, andis a portable SSD that’s smaller and faster than an external hard drive. The USB-C drive is compatible with Windows and MacOS, and can read and write data at around 1,000Mbps. The 1TB model is currently around $75.99 ($54 off) at Amazon , and Best Buy\n\nSamsung’s 9100 Pro 4TB M.2 SSD caught our eye. It’s available for $384.99, down from its typical price of $449.99. If you’d prefer something cheaper, you can grab a You may not be able to take full advantage of a PCIe 5.0 SSD, but having extra speed for future upgrades isn’t a bad idea. If that’s appealing to you, the current Amazon deal oncaught our eye. It’s available for $384.99, down from its typical price of $449.99. If you’d prefer something cheaper, you can grab a 2TB version for $189.99, which is $40 lower than the prior low.\n\nHave a Steam Deck, an Asus ROG Ally, or a similar handheld PC that can accept an M.2 2230-sized SSD? WD Black’s 1TB SN770M is discounted to $84.99 at Amazon , down slightly from its previous low of $89.99. Installation procedures vary in steps and complexity depending on the handheld you own.\n\nBrio 500 1080p webcam is currently available at One of Logitech’s best Switch 2-ready webcams just received a Prime Day discount. Theis currently available at Amazon for $75.99 ($54 off), which is a new low price.\n\nKeychron V1 $ 59 $ 75 21 % off $ 59 The Keychron V1 is one of the best entry-level wired mechanical keyboards available. It has hot-swappable switches, full remappability with VIA, great build quality, RGB backlighting, and double-shot PBT keycaps for under $100. Read More $59 at Amazon\n\nBoard game deals\n\nSplendor $ 24 $ 40 40 % off $ 24 A strategy card game in which players compete to build Renaissance Europe’s most lucrative and prestigious jewelry business. Read More $24 at Amazon$24 at Target\n\nAsmodee Azul Board Game $ 24 $ 40 40 % off $ 24 Azul is a game in which you arrange patterned tiles in order to create the most beautiful tapestry possible. Arranging tiles in a strategic sequence will help you build your score while limiting your opponents’ ability to grow theirs. Read More $24 at Amazon\n\nTicket to Ride is another classic board game that’s down to $24.99 (about $25 off) at is another classic board game that’s down to $24.99 (about $25 off) at Amazon . That’s one of the better prices we’ve seen on the cutthroat card game, which challenges you to build the longest locomotive route across classic America before your other tycoon opponents.\n\nCatan is currently on sale at The 6th Edition ofis currently on sale at Amazon for the first time ever, where you can grab it for $41.99 ($8 off). If you’ve never played before, Catan has you strategically collect and trade resources with fellow players while you figure out how to build out your civilization to take over the board. The latest edition has updated artwork to commemorate the game’s 13th anniversary.\n\nCodenames, which is on sale at You can gauge how well you know your friends and family by playingwhich is on sale at Amazon right now for $14.99 ($10 off), its best price of the year. You only get to say one word associated with multiple tiles on the board, and your teammates have to figure out which ones you’re talking about. If you’re too vague, your teammates may guess incorrectly, giving the other side an edge.\n\nDungeons & Dragons 2024 Player’s Handbook $ 40 $ 50 20 % off $ 40 The latest Dungeons & Dragons Player’s Handbook teaches you about 12 core classes, 48 subclasses, and helps you construct your story with 16 backgrounds and 75 feats. With a bit of help, you’ll be DMing your own original campaigns in no time. Read More $40 at Amazon\n\nHappy Salmon is on sale for just $9.49 (about $4 off) at is on sale for just $9.49 (about $4 off) at Amazon . It’s one of the best icebreakers at social gatherings, for both adults and parents alike, and it takes just minutes to learn and play this card game. Up to eight players can get in on the action, which gets you out of your seats and has you doing fun stuff like giving each other high-fives and “fish bumps.”\n\nVerge favorites and other miscellaneous deals\n\nThermacell’s E90 mosquito repeller is down to $31.81 (about $18 off) at is down to $31.81 (about $18 off) at Amazon right now, beating its previous low by $6 or so. It’s similar to the rechargeable E55 — a summer favorite of ours — only the upgraded model provides up to nine hours of continuous protection when used with the included repellent cartridge, as opposed to five. Needless to say, it’s a great pick for the dog days of summer.\n\nElgato’s composite / S-Video-to-USB converter — which is perfect for It’s not often enough that— which is perfect for making digital copies of your VHS tapes — goes on sale. But thanks to Prime Day, it’s down to $69.99 (originally $99.99) at Amazon . It’s still expensive, but the company’s simple software makes it stand out as a great option for people who aren’t particularly tech-savvy.\n\nExperience 2 earpugs are on sale at If you’re an avid concert goer who’d like to retain your hearing later in life — and who wouldn’t? — Loop’s ultra-comfortableare on sale at Amazon for an all-time low of $26.95 ($8 off). The stylish earplugs won’t reduce noise as effectively as a custom set; however, they do carry a noise reduction rating of 12dB, which is totally adequate for that occasional Turnstile set.\n\nSlice Auto-Retractable Box Cutter $ 15 $ 28 46 % off $ 15 Slice’s retractable, finger-friendly ceramic blade is great for tearing through packing tape and cutting plastic wrapping. The comfy tool also features a sturdy, reinforced nylon handle and a hooked design that makes it easy to stow when not in use. Read More $15 at Amazon$28 at Slice\n\nYamazaki’s Desk Organizer is available at Looking to spruce up your workspace?is available at Amazon for $30.60 (about $12 off), which is one of the better prices we’ve seen in recent months. The handsome, steel accessory is equipped with a small bin and an elevated wooden platform, ensuring your keys, wallet, and whatever else it is you need are always within reach.\n\nChomChom Roller Pet Hair Remover $ 17 $ 28 39 % off $ 17 The ChomChom is a reusable roller that works great for removing unwanted pet hair from furniture, allowing you to skip lint rollers, vacuuming, and other cleaning tools in a pinch. Read More $17 at Amazon (with code 7OFFPDCHOM)\n\nHoverAir X1 drone $ 270 $ 350 23 % off $ 270 The pocketable HoverAir X1 keeps things simple, with a 2.7K at 30fps max resolution and six preset flight modes for easy, hands-free shooting. It lacks GPS and obstacle avoidance, but it launches in seconds and is easy to use. Read More $270 at Amazon$270 at B&H Photo\n\nChomChom cat and dog hair remover is on sale for $17.43 ($11 off) at The reusablecat and dog hair remover is on sale for $17.43 ($11 off) at Amazon , which is $2 shy of its all-time low price. The pet hair remover is easy to use and does a great job of scooping up pet hair from furniture well, which is why so many of us on The Verge staff are big fans.\n\nJisuLife’s folding USB fan, a mainstay of our gift guides, is on sale at , a mainstay of our gift guides, is on sale at Amazon in select colors starting at just $12.74 (about $13 off the MSRP). The fan’s rechargeable battery will keep you cool for hours, whether you’re holding it or propping it up on a table, and it features a built-in 2,000mAh power bank in case you need a quick way to juice your phone or another electronic device.\n\nBissell Little Green portable carpet cleaner $ 82 $ 123 33 % off $ 82 Look, a carpet cleaner is not a very Verge-y gadget. But we’ve all got carpets and / or upholstery to keep clean, right? Luckily, Bissell’s relatively compact cleaner does a great job of restoring fabrics to their original sheen with just a little elbow grease. Read More $82 at Amazon\n\nNoco Boost Plus GB40 car battery jump starter $ 80 $ 125 36 % off $ 80 This battery has the juice, so to speak, and quite a lot of it. Its main role is to be available to jumpstart a car battery (12V/1000A), but it has USB ports, too, making it handy for charging other devices you bring in the car. Read More $80 at Amazon\n\nTwelve South AirFly Pro $ 41 $ 55 25 % off $ 41 The Twelve South AirFly Pro Bluetooth transmitter and receiver features an integrated 3.5mm cord and long-lasting battery life. It can also connect up to two sets of headphones, making it a great choice for listening to in-flight entertainment. Read More $41 at Twelve South$45 at Amazon\n\nRestore 3 is quite similar to the TikTok-famous model Hatch Restore 2 was one of our favorite sleep gadgets , and now you can pick up the third-gen model at Amazon for an all-time low of $139.99 ($30 off). Theis quite similar to the TikTok-famous model we reviewed in 2023 in that it still functions as a smart alarm clock / sunrise lamp, except the latest version features an updated design and adds several new buttons that make it easier to operate.\n\nYogasleep Travel Mini Portable Sound Machine is now on sale at Speaking of sleep devices, theis now on sale at Amazon for $23.79 ($6 off), which is just $3 shy of its best price to date. The rechargeable, travel-ready device offers six noise profiles, from ambient nature sounds to serene pink noise, as well as a built-in night light for navigating your hotel or next Airbnb.\n\nXreal One smart glasses $ 450 $ 500 10 % off $ 450 The Xreal One aren’t the most affordable augmented-reality glasses available, but they are some of the best for displaying movies and games on the go. You can connect them via USB-C to your smartphone, tablet, or handheld gaming PC. Read More $450 at Amazon$450 at Xreal\n\nTile Mate $ 17 $ 25 32 % off $ 17 The latest Tile Mate helps you keep track of your personal belongings from up to 350 feet away, which is 100 feet wider than its predecessor’s range. It’s also platform-agnostic, and can send SOS alerts if you pay for the $14.99 monthly Life360 Gold subscription. Read More $17 at Amazon$25 at Life360$25 at Target\n\nGrownsy Baby Nasal Aspirator $ 31 $ 50 38 % off $ 31 The Grownsy snot sucker comes with three interchangeable soft tips for a good fit and provides three levels of suction. Your kid might still hate it, but at least one of you will have an easier time with it. Read More $31 at Amazon\n\nInstant Pot Duo Plus , is discounted to $69.99 ($70 off) at One of our gift guide mainstays, the six-quart, is discounted to $69.99 ($70 off) at Amazon and Target right now, matching its lowest price to date. The stainless steel multicooker is an excellent set-it-and-forget-it device in many ways, as it allows you to steam, sauté, pressure cook, slow cook, and engage in a variety of simple culinary endeavors without having to pony up for a host of kitchen appliances.\n\nBlack & Decker’s rechargeable Furbuster — now on sale at Robot vacuums are overrated.— now on sale at Amazon and Chewy for $79.99, its lowest price of the year — is a great handheld alternative that’s well-suited for picking up fur, dirt, and other unwanted debris, especially when you tack on the extra-long crevice tool or the included motorized pet brush.\n\nCrunchCup is on sale at If you’re looking for a more “innovative” way to eat cereal, theis on sale at Amazon for an all-time low of $18.95 ($6 off). The absurd, two-cup contraption takes some getting used to, but once you get it down, it’s a handy way to consume breakfast on the go. Just pick your cereal wisely — not everything Kellogg’s makes is spout-friendly.\n\nGlocusent Neck Reading Light $ 18 $ 22 18 % off $ 18 Glocuscent’s rechargeable book light hangs around your neck to illuminate whatever you’re reading, while offering adjustable brightness and warmth settings. Read More $18 at Amazon\n\nE1 Max Precision Electric Screwdriver — available at Hoto makes some of the slickest electric tools around, but Fanttik’s are a close second. The— available at Amazon for $39.39 ($36 off) with promo code 10E1MAXCD for Prime Day — is a great example of why that’s the case. It’s not going to get you a ton of torque, but it features an attractive design, a 350mAh rechargeable battery, and 50 magnetic steel bits that are ideal for tackling small electronics.\n\nBioLite’s versatile FirePit Plus is currently available from If you’re still gearing up for the summer grilling season,is currently available from Amazon for around $224.96 ($175 off), its best price of the year. The portable fire pit is an efficient little gadget thanks to its clever design and battery-powered fan, which helps keep smoke at bay regardless of your fuel source.\n\nLogitech Blue Yeti starting at $90.24 (about $50 off). Although newer microphones may be more visually and functionally appealing, the Yeti remains a classic plug-and-play USB option that reliably captures great audio. Amazon is currently selling thestarting at $90.24 (about $50 off). Although newer microphones may be more visually and functionally appealing, the Yeti remains a classic plug-and-play USB option that reliably captures great audio.\n\nLevitons’ GUAC1-W is a dual-outlet receptacle with a USB-A and USB-C port built into it, and it’s on sale for $32.99 ($21 off) at USB outlets are a seemingly small home upgrade that makes charging your devices more convenient.is a dual-outlet receptacle with a USB-A and USB-C port built into it, and it’s on sale for $32.99 ($21 off) at Amazon . Charging devices without having to plug in a power adapter is especially helpful in the kitchen and other shared spaces.\n\nFanttik X9 Pro Portable Tire Inflator $ 50 $ 80 38 % off $ 50 Whether you primarily drive a car, motorcycle, or a bicycle, the one thing in common with all three modes of transport is the need for well-inflated tired. This rechargeable 150psi inflator might just save you from a flat (or from being dangerously close to one) when you least expect it. Read More $50 at Amazon$50 at Fanttik\n\nAeroPress Original Coffee Maker $ 28 $ 40 30 % off $ 28 The AeroPress has made a name among enthusiasts for its great brewing ability and extreme portability. Its simple, hands-on operation can make your morning coffee ritual more fun and engaging than a traditional drip-style maker. Read More $28 at Amazon$28 at Walmart\n\nVerge Deals Sign up for Verge Deals to get deals on products we’ve tested sent to your inbox weekly. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."}, "https://www.theverge.com/analysis/703232/columbia-hack-admissions-data-mamdani": {"title": "The Columbia hack is a much bigger deal than Mamdani’s college application", "summary": "Columbia University experienced an hourslong system-wide outage on June 24th. During that time, the personal data of at least every person who applied to Columbia between 2019 and 2024 was stolen. A hacker claimed to have stolen 460 gigabytes, including 1.8 million Social Security numbers, financial aid package information and employee pay stubs.", "url": "https://www.theverge.com/analysis/703232/columbia-hack-admissions-data-mamdani", "content": "is a reporter who writes about tech, money, and human behavior. She joined The Verge in 2014 as science editor. Previously, she was a reporter at Bloomberg.\n\nOn June 24th, Columbia University experienced an hourslong system-wide outage. Its internal email service went down. Students couldn’t log in to the platform where professors post assignments and course materials. Library catalogs went offline. Zoom was unavailable. Every single service that required Columbia’s official authentication service was affected, but maybe most eerily, images of President Donald Trump appeared on some screens across the campus. During that time, the personal data of at least every person who applied to Columbia between 2019 and 2024 was stolen.\n\nIt’s not yet clear the full scope of the breach, according to Columbia. But someone claiming to be the hacker almost immediately began shopping that data around, giving 1.6 gigabytes of admissions records “dating back decades” to Bloomberg. And that’s supposedly just the tip of the iceberg. The self-identified hacker said they had stolen 460 gigabytes, including 1.8 million Social Security numbers, financial aid package information, and employee pay stubs — the result of two months burrowing into Columbia’s servers before finally gaining the highest level of access. Bloomberg confirmed details of the Columbia data it received with eight current and former students; they were accurate. Millie Wert, a spokesperson for Columbia, referred The Verge to the university’s previous statements on the hack.\n\nThese are three politically motivated hacks of higher education, focused on the admissions process\n\nThe hack appears to be politically motivated: the purported hacker told Bloomberg as much, saying they stole the data because they wanted to know whether Columbia had continued to engage in “affirmative action,” admissions policies meant to improve opportunities for groups that colleges had once discriminated against, after the practice was barred in 2023 by the Supreme Court.\n\nThe Republican war on affirmative action is part of a broader push to undermine the Civil Rights Act, which is barely disguised as attacks on “wokeness” and “DEI.” Shortly after taking office, Trump signed an executive order banning “illegal discrimination,” which targeted so-called diversity, equity, and inclusion programs, a fairly broad umbrella of initiatives meant to make sure underrepresented groups don’t face barriers in schools and workplaces. In the broader scheme, the Columbia University hack figures as a wildcat attempt at enforcing the right-wing ideological project of bringing back open racism.\n\nThe attack on Columbia is, in this context, a remarkable story. Moreover, it comes on the heels of cyberattacks on New York University and the University of Minnesota, both of which the alleged hacker took credit for when speaking to Bloomberg. In March, someone stole NYU applicants’ personal details, including financial aid, “dating back to at least 1989,” according to Washington Square News. Similarly, in July 2023, someone posted records from the University of Minnesota dating to the 1980s, and those records included 7 million Social Security numbers.\n\nAccording to Bloomberg’s source, these are three politically motivated hacks of higher education, focused on the admissions process and containing personal information protected by law. Moreover, the supposed hacker — who, if we take them at their word, is working alone and has an ax to grind about the supposed favored status of racial minorities in American society — specifically sought out information about self-reported race and ethnicity, and has now essentially acquired lists of people categorized by race.\n\nThere has been precious little reporting on the Columbia hack\n\nThe most extensive reporting comes from Bloomberg and The New York Times.\n\nHere is how The New York Times has elected to cover it:\n\nFor those of us keeping score at home, that’s two stories about the hack and its overall political implications, both of which are less informative than Bloomberg; one story using hacked data to smear a mayoral candidate; and two stories jerking off.\n\nAs a result of the Mamdani leak, The New York Times has one of the best leads on the identity of the hacker\n\nZohran Mamdani, as a high school senior, marked himself as both Asian and Black/African American on his college application, adding the clarifying note “Uganda” next to the latter, according to hacked data passed to the Times. He is a South Asian man born in Uganda. He did not attend Columbia University.\n\nIt’s not much of a story. But as a result of the Mamdani leak, The New York Times has one of the best leads on the identity of the hacker. The Times identifies Jordan Lasker as the source of Mamdani’s college application (though bafflingly only by his internet alias “Crémieux”), and he likely has some idea about where he got it from. Bloomberg obviously has its own lead — and you’d think the two would be competing to get more information about this politically motivated hack out to the general public.\n\nMaybe we will see some impressive reporting shortly and someone is chasing it right now. Or perhaps there is simply no one at the Times who can report out the story, which now involves three major data breaches. Certainly the handling of Mamdani’s college application makes it look like the Times is either unfamiliar with or unwilling to engage in best practices around hacked materials. It does, however, strain credulity to think this particular newspaper would be unaware of those standards.\n\nHad reporters been played by hackers? (Yes.)\n\nIn 2016, The New York Times ran a series of stories about Hillary Clinton’s emails, which had been hosted on a private server — not recommended, for security reasons — while she was secretary of state. Following a relentless news cycle about her emails, a Democratic National Committee email server was hacked. WikiLeaks published almost 20,000 stolen emails, notably spending October dropping batches of damaging emails from Clinton’s campaign chair. As early as June 2016, the media already had a pretty good idea that the hacker was actually the Russian government, but went all out on the emails anyway. (In 2018, a US grand jury indicted 12 Russian intelligence officers in connection with the hack.) The extensive coverage of those hacked emails — from the Times and elsewhere — likely contributed to Clinton’s loss to Donald Trump in the 2016 presidential election, even though the emails were nothingburgers. Does anyone even remember the contents?\n\nJournalists have long struggled over balancing newsworthiness and sourcing — the 2014 North Korean hack of Sony Pictures produced a spectacular revelation about Hollywood’s war on Google, but also gossip intended to humiliate Amy Pascal, where reporters played along and effectively did Kim Jong Un’s bidding. But the WikiLeaks-DNC emails incident led to intense media navel-gazing. Had reporters been played by hackers? (Yes.) Was there a way to avoid that in the future? (Yes.) Journalists seriously reevaluated how to treat hacked materials, and how much emphasis to put on them.\n\nHackers don’t make journalistic assignments. Journalists do\n\nIn justifying the coverage decisions around leaked materials, there was a common thread: Hackers don’t make journalistic assignments. Journalists do. No news organization — including this one — would make a blanket rule against hacked materials. Instead, the idea would be to be judicious about what was being leaked and by who, giving readers information on what the hack was meant to accomplish if the information in it was found to be newsworthy.\n\nThe Times’ coverage of the hacked Mamdani material flies in the face of the editorial decisions around Hunter Biden’s emails and the hacked documents from the Trump campaign. The choice to use the material is inconsistent with previous decisions, but that’s not all. The framing of the story might as well have been dictated by the hacker, who has it out for affirmative action, and the internet eugenicist who supplied the material.\n\nI reached out to The New York Times to request comment on how they’d identified the source and framed the story. Spokeswoman Danielle Rhoades Ha declined to answer those questions, and sent a statement that read, in part, “Reporters receive tips from people with biases and bad motives all the time, but we only publish such information after we’ve independently verified it, confirmed it, done our own reporting on it and judged it to be newsworthy.”\n\nThe context in which these actors are going after Columbia is important as well. The Trump regime has come at the Ivy League broadly over diversity, equity, and inclusion programs. It has singled out Columbia specifically, leveraging accusations of antisemitism over the university’s handling of protests against the Israeli attacks on Gaza. Trump’s ICE has targeted student protesters, disappearing them into faraway facilities.\n\nFrankly, we will have gotten off lightly if “Mamdani Once Claimed to Be Asian and African American” is the only hit the Columbia hacker manages to land with their stolen data\n\nThe institution has not exactly been defiant about the attacks on its students — days after the ICE raid that took Mahmoud Khalil, the university expelled, suspended, or revoked the degrees of students who occupied a campus building last spring as part of a protest. This did not pacify the Trump regime, which has frozen $400 million of funding for Columbia University and is currently negotiating a settlement with the university.\n\nThe timing of the hack, given the university’s relationship with the Trump regime, raised my eyebrows. A hacker who is also a Trump follower might attempt to pressure Columbia with stolen data, perhaps via strategic leaks to major newspapers, in order to get it to capitulate to Trump’s pressure campaigns.\n\nWho did the hacking and how did it happen? What was stolen, and where is it being stored? Is any of it being sold? What other schools are being targeted? How will this stolen information place pressure on Columbia? These questions all seem like fertile ground for reporting. It would be nice if The New York Times was interested in that story. But at the absolute bare minimum, when it ran its bizarre story about Mamdani’s college application, it should have made the political motivations of the hacker clear to the reader.\n\nIf it’s true that the Times allowed itself to become the mouthpiece of an anti-affirmative action hacktivist, it is a travesty. But frankly, we will have gotten off lightly if “Mamdani Once Claimed to Be Asian and African American” is the only hit the Columbia hacker manages to land with their stolen data. They may well be poised to do much more damage, and at a time when the university has already been brought to its knees.\n\nThere are as yet no indications that the hacker has anything other than admissions data, which is something of a relief, given how much stuff there is at any given university. In fact, speaking of journalistic ethics: even though journalism does not have one single body that upholds professional ethics, The Columbia Journalism Review — housed at Columbia University, alongside a renowned journalism school and the prestigious Pulitzer Prizes — is widely acknowledged as a leading institution in setting and guiding norms in the profession. One might think of the Columbia hack as an indirect attack on journalists and journalistic institutions; it is possible the hacker has data that could be weaponized in a direct one.\n\nI am struggling to understand why I can find so little reporting on something that seems awfully newsworthy. Look, I’m the in-house finance nerd at the phones website; I rely on people who know how computers work to do reporting on hacks. But here we have a politically motivated hack of three universities, data from which has been used by the nation’s most prestigious newspaper to attempt a hit job on a Democratic mayoral candidate, and precious little else. I get that we all have hacking fatigue — it feels like every other week, some major business gets rekt — but the Columbia University story is different. Is anyone going to treat it that way?"}, "https://www.theverge.com/news/703364/apple-vision-pro-second-gen-release-rumor": {"title": "Apple’s second-generation Vision Pro might launch this year", "summary": "Apple is preparing to launch its next Vision Pro headset “as early as this year,” according to a report from Bloomberg’s Mark Gurman. The upcoming device will reportedly feature an upgraded M4 processor, along with a redesigned strap to combat neck and head pain.", "url": "https://www.theverge.com/news/703364/apple-vision-pro-second-gen-release-rumor", "content": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nApple is preparing to launch its next Vision Pro headset “as early as this year,” according to a report from Bloomberg’s Mark Gurman. The upcoming device will reportedly feature an upgraded M4 processor, along with a redesigned strap to combat neck and head pain.\n\nThe $3,499 Vision Pro, which was released in February 2024, uses a now-three-year-old M2 processor. As reported by Bloomberg, the Vision Pro’s next iteration could come with an emphasis on AI, a move that would align with the company’s efforts to infuse AI across the iPhone, iPad, and Mac.\n\nAccording to Bloomberg, Apple could outfit the next Vision Pro with more than the 16 neural engine cores available on the current M2-equipped headset. If true, that would make it the first M4 chip with more than 16 neural cores — so far, only the M2 Ultra and M3 Ultra have come with more than that. Even without the extra cores, the M4’s 16-core NPU is still more than two times faster than one on the M2.\n\nBloomberg reports that Apple is also testing new Vision Pro straps to make the around 1.4-pound device more comfortable to wear as well. My former colleague Wes Davis found that the Vision Pro was most comfortable when the included Solo Knit Band was paired with a $50 Belkin Head Strap than with either of Apple’s two included bands on their own."}, "https://www.theverge.com/news/703037/perplexity-ai-web-browser-comet-launch": {"title": "Perplexity just launched an AI web browser", "summary": "Perplexity, the startup behind the AI “answer” engine, has just launched its own web browser. The browser, called Comet, incorporates Perplexity’s AI search tools and assistant in a way that CEO Aravind Srinivas says “transforms entire browsing sessions into single, seamless interactions” Comet will only be available to users who subscribe to the $200 per month PerplexITY Max plan before rolling out more widely.", "url": "https://www.theverge.com/news/703037/perplexity-ai-web-browser-comet-launch", "content": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nPerplexity, the startup behind the AI “answer” engine, has just launched its own web browser. The browser, called Comet, incorporates Perplexity’s AI search tools and assistant in a way that CEO Aravind Srinivas says “transforms entire browsing sessions into single, seamless interactions.”\n\nComet will only be available to users who subscribe to the $200 per month Perplexity Max plan before rolling out more widely on an invite-only basis. The browser uses Perplexity as its primary search engine, which serves up AI-generated responses to queries based on results from around the web. It’s also supposed to be able to buy products on your behalf and help you book hotels.\n\nThe new AI-powered browser comes as Perplexity continues to challenge Google’s dominance in search. Perplexity partnered with Motorola to pre-install its assistant on its new Razr phones this year, something Srinvas told The Verge in April that the startup wouldn’t have happened if Google hadn’t gone through an antitrust trial. “They would have bullied a lot of the OEMs,” Srinvas said.\n\nComet is built on Chromium, the Google-backed open-source project powering major browsers like Chrome and Microsoft Edge. Perplexity has expressed interest in buying Chrome if the court forces Google to sell the browser.\n\nSrinvas said in April that Perplexity is launching a browser because it “might be the best way to build agents.” Aside from the Perplexity’s search integration, Comet comes with a built-in AI assistant that can answer questions about what you’re seeing on your screen, similar to Gemini’s integration with Google Chrome.\n\nThe AI assistant lives in Comet’s sidebar, and in addition to summarizing or explaining text, it can also carry out agentic tasks like booking a meeting, sending an email, or buying a product. Srinivas says Perplexity plans to “continue to launch new features and functionality for Comet” in the future.\n\nThe browser is only available on Windows and Mac for now, and also allows you to import your extensions, settings, and bookmarks in “one click.”"}, "https://www.theverge.com/twitter/703606/x-ceo-linda-yaccarino-elon-musk-out-step-down-twitter": {"title": "X’s CEO is out after failing at basically everything she claimed she wanted", "summary": "Linda Yaccarino is stepping down as X’s CEO — and leaving the platform once known as Twitter in a worse place than when she started. She thanked Elon Musk for “entrusting me with the responsibility of protecting free speech, turning the company around, and transforming X into the Everything App” But data from digital intelligence platform Similarweb indicates that X has actually lost a huge chunk of its active user base.", "url": "https://www.theverge.com/twitter/703606/x-ceo-linda-yaccarino-elon-musk-out-step-down-twitter", "content": "is a news editor covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.\n\nLinda Yaccarino is stepping down as X’s CEO — and leaving the platform once known as Twitter in a worse place than when she started.\n\nA day after X users circulated viral screenshots of the company’s Grok chatbot denigrating Jews and declaring itself “MechaHitler,” Yaccarino thanked Elon Musk for “entrusting me with the responsibility of protecting free speech, turning the company around, and transforming X into the Everything App.” She said that the platform started “the critical early work necessary to prioritize the safety of our users—especially children” and that the X Money payment platform would be arriving “soon.”\n\nBut in the spirit of X’s own Community Notes, let’s break those claims down.\n\n“Protecting free speech”\n\nMusk, who has called himself a free speech absolutist, supposedly bought Twitter in 2022 because of “its potential to be the platform for free speech around the globe.” But as my colleague Adi Robertson wrote at the time, “despite his sweeping declaration, Musk’s eye seems almost entirely focused on the far smaller question of Twitter’s own internal rules.”\n\nAhead of Yaccarino joining, Musk addressed some of his issues with Twitter’s rules by allowing some of the worst people on the internet back to the platform. But under Yaccarino’s CEO tenure, X has caved to government censorship requests abroad while using lawsuits to harass its critics in the US:\n\n“Turning the company around”\n\nOfficial metrics are hard to pin down here, but financial and usage estimates suggest that X is generally on a downward trend. Not great for the person Musk said was supposed to be in charge of the platform’s “business operations.”\n\nMusk has painted a bright picture of X, saying in May 2024 that the platform had “600 million monthly active users.” In March 2024, Yaccarino said that there had been “a 12% jump in time spent on the platform since last year.” But data shared with The Verge from digital intelligence platform Similarweb indicates that X has actually lost a huge chunk of its active user base since Yaccarino took over.\n\nIn June 2023, when Yaccarino officially stepped into the role, the platform had 388.5 million users across its iOS and Android apps, according to Similarweb; as of last month, it had 311.1 million users — a loss of over 75 million.\n\nYaccarino was formerly an ad executive at NBC Universal, and part of her job was to shore up shaky relationships after incidents like Musk endorsing white pride — which caused companies like Apple and Disney to pull back spending on the platform — and telling advertisers at a New York Times event to “go fuck yourself.” (Yaccarino characterized that last one “an explicit point of view about our position.”)\n\nIt’s true that Apple returned to advertise on X earlier this year, and Bloomberg reported on eMarketer estimates in March that said X is projected to have its first year of advertising growth in 2025. But did Yaccarino have much to do with that? According to an eMarketer exec at the time, the increased ad spending is partially due to Musk’s close relationship with the Trump administration — it’s a lot easier to keep advertisers when the FTC can force companies to work with you. Musk and Trump’s relationship is much rockier now, so the long-term success of that plan is looking increasingly unclear, even if Yaccarino boasted that the platform has “welcomed” 96 percent of its “top advertisers” back to the platform.\n\nOne other metric of X not actually turning around? Musk bought Twitter for $44 billion in 2022, but when Musk’s xAI bought X earlier this year, it valued X at $33 billion on paper.\n\n“Transforming X into the Everything App”\n\nAs I’ve written about before, Musk has had intentions of building some kind of WeChat-like super app for a long time, but the X of today still looks very much like the Twitter of yesteryear.\n\nX’s primary use is still as a social media platform: users are scrolling through post after post after post, perhaps sometimes pinging Grok for AI-generated commentary. Yes, there are new, small features like audio and voice calls and a dedicated vertical video tab copying apps like TikTok or Instagram. But its “X Money” payments system still hasn’t arrived, even though Yaccarino announced in January that it would be arriving “later this year.” After X being folded into Musk’s AI company and losing Yaccarino as CEO, it’s unclear how much of a priority the feature might be — especially for X’s new head of product, who seems a little more focused on the lols.\n\nAnd about Grok. The bot was updated to be more “politically incorrect” just before Yaccarino announced her departure, and it promptly flooded X with antisemitism and repeatedly praised Hitler before text responses were turned off. The timing is strikingly awful, even if The New York Times reported that Yaccarino had “discussed her plans to leave with X employees earlier this week, before the incident with Grok.”\n\n“The critical early work necessary to prioritize the safety of our users—especially children”\n\nAs for “especially children,” the company reportedly has serious problems managing child sexual abuse material (CSAM). While X said in 2024 that it had suspended significantly more accounts in 2023 than in 2022 for violating its child sexual exploitation policies, the platform is also contending with accounts using hashtags to try and sell and advertising CSAM in X Communities, as reported in June by NBC News. In fact, X actually unbanned a high-profile influencer in July 2023 who was removed for posting a still from an infamous CSAM video.\n\nWhat’s next?\n\nYaccarino didn’t specify when she’s stepping down from X. Her profile now says that she is the “Super Official eX CEO of X,” so it seems like her work may already be done. She also didn’t say who may replace her, and Musk hasn’t, either."}, "https://www.theverge.com/tech/698710/amazon-prime-day-nintendo-switch-oled-deal-sale-2025": {"title": "The Nintendo Switch OLED Model is cheaper than ever for Prime Day", "summary": "Amazon Prime Day is the best time to save money on a Nintendo Switch OLED. Right now, you can get one with neon red and blue Joy-Con for the all-time low price of $249. The OLED model stands above even the Switch 2’s with better contrast and more vivid colors.", "url": "https://www.theverge.com/tech/698710/amazon-prime-day-nintendo-switch-oled-deal-sale-2025", "content": "Amazon Prime Day is the best time to save money on a Nintendo Switch OLED during a time when there aren’t any deals on the last-gen console (however, there are some other great gaming deals). Right now, you can get one with neon red and blue Joy-Con for the all-time low price of $249 ($100 off) at Woot. Alternatively, you get the console bundled with a digital copy of Mario Kart 8 Deluxe for $275 ($75 off) at Woot. These are both international models; they’ll work totally fine in the US (Switch games are region-free), but they don’t have a 1-year Nintendo warranty, just a 90-day one provided by Woot.\n\nNintendo’s popular hybrid game console still has a lot to offer eight years after launch (even with the Nintendo Switch 2 being available). The OLED model stands above even the Switch 2’s with better contrast and more vivid colors, and its wider kickstand is leagues ahead of the original non-OLED Switch.\n\nIf you want to brush up on gaming history, you can pick up a year-long subscription to Nintendo Switch Online plus Expansion Pack for $80 at Best Buy. This service includes access to a growing library of games originally released on the NES, SNES, N64, Game Boy, Game Boy Advance, and Sega Genesis. Upcoming games, including Tomodachi Life: Living the Dream and Metroid Prime 4: Beyond will be released for the Nintendo Switch, so there’s still plenty of life left in the system.Sign up for Installer\n\nIf you plan on building up a sizable digital game library, you’ll need a microSD card to hold all of them. Samsung’s 512GB microSD card is $28.49 at Amazon, its lowest price ever for Prime Day. PowerA’s Enhanced wired controller is down to $19.09 ($8 off) at Amazon, and is easy to recommend if you play a lot of local multiplayer games."}}